(function (window, document, Math) {

var cityData =[{
	"Code": "110000",
	"Name": "北京市",
	"level": [{
		"Code": "110001",
		"Name": "东城区",
		"sort": 1,
		"level": [{
			"Code": "110001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110002",
		"Name": "大兴区",
		"sort": 2,
		"level": [{
			"Code": "110002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110003",
		"Name": "昌平区",
		"sort": 3,
		"level": [{
			"Code": "110003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110004",
		"Name": "顺义区",
		"sort": 4,
		"level": [{
			"Code": "110004",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110005",
		"Name": "通州区",
		"sort": 5,
		"level": [{
			"Code": "110005",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110006",
		"Name": "房山区",
		"sort": 6,
		"level": [{
			"Code": "110006",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110007",
		"Name": "门头沟区",
		"sort": 7,
		"level": [{
			"Code": "110007",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110008",
		"Name": "海淀区",
		"sort": 8,
		"level": [{
			"Code": "110008",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110009",
		"Name": "石景山区",
		"sort": 9,
		"level": [{
			"Code": "110009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110010",
		"Name": "丰台区",
		"sort": 10,
		"level": [{
			"Code": "110010",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110011",
		"Name": "朝阳区",
		"sort": 11,
		"level": [{
			"Code": "110011",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110012",
		"Name": "宣武区",
		"sort": 12,
		"level": [{
			"Code": "110012",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110013",
		"Name": "崇文区",
		"sort": 13,
		"level": [{
			"Code": "110013",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110014",
		"Name": "西城区",
		"sort": 14,
		"level": [{
			"Code": "110014",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "110015",
		"Name": "延庆县",
		"level": [{
			"Code": "110015",
			"Name": "延庆镇",
			"sort": 1
		}, {
			"Code": "110015",
			"Name": "永宁镇",
			"sort": 2
		}, {
			"Code": "110015",
			"Name": "康庄镇",
			"sort": 3
		}, {
			"Code": "110015",
			"Name": "大榆树镇",
			"sort": 4
		}, {
			"Code": "110015",
			"Name": "井庄镇",
			"sort": 5
		}, {
			"Code": "110015",
			"Name": "八达岭镇",
			"sort": 6
		}],
		"sort": 15
	}, {
		"Code": "110016",
		"Name": "平谷县",
		"level": [{
			"Code": "110016",
			"Name": "平谷镇",
			"sort": 1
		}, {
			"Code": "110016",
			"Name": "大华山镇",
			"sort": 2
		}, {
			"Code": "110016",
			"Name": "夏各庄镇",
			"sort": 3
		}, {
			"Code": "110016",
			"Name": "马坊镇",
			"sort": 4
		}, {
			"Code": "110016",
			"Name": "刘家店镇",
			"sort": 5
		}, {
			"Code": "110016",
			"Name": "金海湖镇",
			"sort": 6
		}, {
			"Code": "110016",
			"Name": "峪口镇",
			"sort": 7
		}, {
			"Code": "110016",
			"Name": "马昌营镇",
			"sort": 8
		}, {
			"Code": "110016",
			"Name": "南独乐河镇",
			"sort": 9
		}, {
			"Code": "110016",
			"Name": "山东庄镇",
			"sort": 10
		}, {
			"Code": "110016",
			"Name": "王辛庄镇",
			"sort": 11
		}, {
			"Code": "110016",
			"Name": "东高村镇",
			"sort": 12
		}, {
			"Code": "110016",
			"Name": "大兴庄镇",
			"sort": 13
		}, {
			"Code": "110016",
			"Name": "滨河工业开发区",
			"sort": 14
		}, {
			"Code": "110016",
			"Name": "兴谷工业开发区",
			"sort": 15
		}, {
			"Code": "110016",
			"Name": "杨家桥镇",
			"sort": 16
		}, {
			"Code": "110016",
			"Name": "金谷工业开发区",
			"sort": 17
		}, {
			"Code": "110016",
			"Name": "金海工业开发区",
			"sort": 18
		}, {
			"Code": "110016",
			"Name": "峪山镇",
			"sort": 19
		}],
		"sort": 16
	}, {
		"Code": "110017",
		"Name": "密云县",
		"level": [{
			"Code": "110017",
			"Name": "密云镇",
			"sort": 1
		}, {
			"Code": "110017",
			"Name": "十里堡镇",
			"sort": 2
		}, {
			"Code": "110017",
			"Name": "河南寨镇",
			"sort": 3
		}, {
			"Code": "110017",
			"Name": "西田各庄",
			"sort": 4
		}, {
			"Code": "110017",
			"Name": "溪翁庄",
			"sort": 5
		}, {
			"Code": "110017",
			"Name": "密云经济技术开发区",
			"sort": 6
		}, {
			"Code": "110017",
			"Name": "太师屯镇",
			"sort": 7
		}, {
			"Code": "110017",
			"Name": "北庄镇",
			"sort": 8
		}, {
			"Code": "110017",
			"Name": "穆家欲镇",
			"sort": 9
		}],
		"sort": 17
	}, {
		"Code": "110018",
		"Name": "怀柔区",
		"sort": 18,
		"level": [{
			"Code": "110018",
			"Name": "--",
			"sort": 1
		}]
	}]
}, {
	"Code": "440000",
	"Name": "广东省",
	"level": [{
		"Code": "440003",
		"Name": "河源市",
		"level": [{
			"Code": "440003",
			"Name": "和平县",
			"sort": 1
		}, {
			"Code": "440003",
			"Name": "连平县",
			"level": [{
				"Code": "4875",
				"Name": "忠信镇"
			}],
			"sort": 2
		}, {
			"Code": "440003",
			"Name": "市区",
			"level": [{
				"Code": "4210",
				"Name": "源城区  "
			}, {
				"Code": "4211",
				"Name": "高新区 "
			}, {
				"Code": "4212",
				"Name": "新市区 "
			}, {
				"Code": "4213",
				"Name": "源南镇 "
			}, {
				"Code": "4214",
				"Name": "东埔镇 "
			}, {
				"Code": "4215",
				"Name": "源西镇 "
			}, {
				"Code": "4216",
				"Name": "埔前镇"
			}],
			"sort": 3
		}, {
			"Code": "440003",
			"Name": "东源县",
			"level": [{
				"Code": "4854",
				"Name": "福新工业园"
			}, {
				"Code": "943",
				"Name": "仙塘镇"
			}],
			"sort": 4
		}, {
			"Code": "440003",
			"Name": "紫金县",
			"level": [{
				"Code": "4904",
				"Name": "城南镇 "
			}, {
				"Code": "4905",
				"Name": "紫城镇 "
			}, {
				"Code": "4906",
				"Name": "附城镇中心 "
			}, {
				"Code": "4907",
				"Name": "乌石镇中心 "
			}, {
				"Code": "944",
				"Name": "古竹镇"
			}, {
				"Code": "945",
				"Name": "临江镇"
			}],
			"sort": 5
		}, {
			"Code": "440003",
			"Name": "龙川县",
			"level": [{
				"Code": "946",
				"Name": "老隆镇"
			}, {
				"Code": "947",
				"Name": "陀城镇"
			}, {
				"Code": "948",
				"Name": "附城镇"
			}],
			"sort": 6
		}],
		"sort": 3
	}, {
		"Code": "440004",
		"Name": "阳江市",
		"level": [{
			"Code": "440004",
			"Name": "江城区 ",
			"sort": 1
		}, {
			"Code": "440004",
			"Name": "阳春市",
			"level": [{
				"Code": "4940",
				"Name": "地豆岗开发区 "
			}, {
				"Code": "4932",
				"Name": "牛迳桥开发区 "
			}, {
				"Code": "4933",
				"Name": "城北工业区"
			}, {
				"Code": "4934",
				"Name": "黎湖工业区"
			}, {
				"Code": "4935",
				"Name": "城南管理区 "
			}, {
				"Code": "4936",
				"Name": "新云管理区 "
			}, {
				"Code": "4937",
				"Name": "泰安管理区 "
			}, {
				"Code": "4938",
				"Name": "石上管理区 "
			}, {
				"Code": "4939",
				"Name": "中朗管理区 "
			}, {
				"Code": "4931",
				"Name": "站港路民营开发区 "
			}, {
				"Code": "4930",
				"Name": "尖岗岭开发区"
			}, {
				"Code": "4929",
				"Name": "升平管理区 "
			}, {
				"Code": "4928",
				"Name": "合岗管理区 "
			}, {
				"Code": "4926",
				"Name": "河西管理区 "
			}, {
				"Code": "4927",
				"Name": "大安管理区 "
			}, {
				"Code": "951",
				"Name": "春湾镇"
			}, {
				"Code": "952",
				"Name": "合水镇"
			}, {
				"Code": "953",
				"Name": "陂面镇"
			}, {
				"Code": "954",
				"Name": "马水镇"
			}, {
				"Code": "955",
				"Name": "谭水镇"
			}, {
				"Code": "950",
				"Name": "春城镇"
			}],
			"sort": 2
		}, {
			"Code": "440004",
			"Name": "阳东县",
			"level": [{
				"Code": "4896",
				"Name": "那味工业区 "
			}, {
				"Code": "956",
				"Name": "东城镇"
			}, {
				"Code": "957",
				"Name": "合山镇"
			}, {
				"Code": "958",
				"Name": "北惯镇"
			}, {
				"Code": "959",
				"Name": "红丰镇"
			}, {
				"Code": "960",
				"Name": "雅韶镇"
			}, {
				"Code": "962",
				"Name": "那霍工业区"
			}],
			"sort": 3
		}, {
			"Code": "440004",
			"Name": "阳西县",
			"level": [{
				"Code": "963",
				"Name": "织贡镇"
			}, {
				"Code": "964",
				"Name": "塘口镇"
			}],
			"sort": 4
		}],
		"sort": 4
	}, {
		"Code": "440005",
		"Name": "清远市",
		"level": [{
			"Code": "440005",
			"Name": "连山壮族瑶族自治县 ",
			"sort": 1
		}, {
			"Code": "440005",
			"Name": "清城区",
			"level": [{
				"Code": "965",
				"Name": "附城镇"
			}, {
				"Code": "966",
				"Name": "横荷镇"
			}, {
				"Code": "967",
				"Name": "洲心镇"
			}, {
				"Code": "968",
				"Name": "龙塘镇"
			}, {
				"Code": "969",
				"Name": "石角镇"
			}, {
				"Code": "970",
				"Name": "源潭镇"
			}],
			"sort": 2
		}, {
			"Code": "440005",
			"Name": "连州市",
			"level": [{
				"Code": "971",
				"Name": "连州镇"
			}],
			"sort": 3
		}, {
			"Code": "440005",
			"Name": "英德市",
			"level": [{
				"Code": "4899",
				"Name": "望埠镇 "
			}, {
				"Code": "4898",
				"Name": "大站镇 "
			}, {
				"Code": "4900",
				"Name": "云岭镇 "
			}, {
				"Code": "4897",
				"Name": "英城镇 "
			}, {
				"Code": "4901",
				"Name": "浛洸镇 "
			}, {
				"Code": "4902",
				"Name": "东华镇 "
			}],
			"sort": 4
		}, {
			"Code": "440005",
			"Name": "清新县",
			"level": [{
				"Code": "972",
				"Name": "太和镇"
			}, {
				"Code": "973",
				"Name": "洄澜镇"
			}, {
				"Code": "974",
				"Name": "山塘镇"
			}, {
				"Code": "975",
				"Name": "太平镇"
			}, {
				"Code": "976",
				"Name": "飞来峡镇"
			}],
			"sort": 5
		}, {
			"Code": "440005",
			"Name": "佛冈县",
			"level": [{
				"Code": "978",
				"Name": "石角镇"
			}, {
				"Code": "979",
				"Name": "水头镇"
			}, {
				"Code": "980",
				"Name": "三八镇"
			}, {
				"Code": "981",
				"Name": "汤塘镇"
			}, {
				"Code": "982",
				"Name": "龙山镇"
			}, {
				"Code": "983",
				"Name": "迳头镇"
			}, {
				"Code": "984",
				"Name": "烟岭镇"
			}],
			"sort": 6
		}, {
			"Code": "440005",
			"Name": "阳山县",
			"level": [{
				"Code": "4941",
				"Name": "城南区"
			}, {
				"Code": "985",
				"Name": "城北区"
			}],
			"sort": 7
		}, {
			"Code": "440005",
			"Name": "连南瑶族自治县 ",
			"level": [{
				"Code": "987",
				"Name": "三江镇"
			}],
			"sort": 8
		}],
		"sort": 5
	}, {
		"Code": "440006",
		"Name": "东莞市",
		"level": [{
			"Code": "440006",
			"Name": "望牛墩镇",
			"sort": 1
		}, {
			"Code": "440006",
			"Name": "黄江镇",
			"sort": 2
		}, {
			"Code": "440006",
			"Name": "清溪镇",
			"sort": 3
		}, {
			"Code": "440006",
			"Name": "塘厦镇",
			"sort": 4
		}, {
			"Code": "440006",
			"Name": "凤岗镇",
			"sort": 5
		}, {
			"Code": "440006",
			"Name": "虎门镇",
			"sort": 6
		}, {
			"Code": "440006",
			"Name": "厚街镇",
			"sort": 7
		}, {
			"Code": "440006",
			"Name": "沙田镇",
			"sort": 8
		}, {
			"Code": "440006",
			"Name": "道滘镇",
			"sort": 9
		}, {
			"Code": "440006",
			"Name": "洪梅镇",
			"sort": 10
		}, {
			"Code": "440006",
			"Name": "麻涌镇",
			"sort": 11
		}, {
			"Code": "440006",
			"Name": "中堂镇",
			"sort": 12
		}, {
			"Code": "440006",
			"Name": "高埗镇",
			"sort": 13
		}, {
			"Code": "440006",
			"Name": "樟木头镇",
			"sort": 14
		}, {
			"Code": "440006",
			"Name": "大岭山镇",
			"sort": 15
		}, {
			"Code": "440006",
			"Name": "大朗镇",
			"sort": 16
		}, {
			"Code": "440006",
			"Name": "寮步镇",
			"sort": 17
		}, {
			"Code": "440006",
			"Name": "长安镇",
			"sort": 18
		}, {
			"Code": "440006",
			"Name": "茶山镇",
			"sort": 19
		}, {
			"Code": "440006",
			"Name": "石碣镇",
			"sort": 20
		}, {
			"Code": "440006",
			"Name": "石龙镇",
			"sort": 21
		}, {
			"Code": "440006",
			"Name": "石排镇",
			"sort": 22
		}, {
			"Code": "440006",
			"Name": "企石镇",
			"sort": 23
		}, {
			"Code": "440006",
			"Name": "横沥镇",
			"sort": 24
		}, {
			"Code": "440006",
			"Name": "桥头镇",
			"sort": 25
		}, {
			"Code": "440006",
			"Name": "谢岗镇",
			"sort": 26
		}, {
			"Code": "440006",
			"Name": "东坑镇",
			"sort": 27
		}, {
			"Code": "440006",
			"Name": "常平镇",
			"sort": 28
		}, {
			"Code": "440006",
			"Name": "莞城区",
			"sort": 29
		}, {
			"Code": "440006",
			"Name": "万江区",
			"sort": 30
		}, {
			"Code": "440006",
			"Name": "南城区",
			"sort": 31
		}, {
			"Code": "440006",
			"Name": "东城区",
			"sort": 32
		}],
		"sort": 6
	}, {
		"Code": "440007",
		"Name": "中山市",
		"level": [{
			"Code": "440007",
			"Name": "石岐区",
			"sort": 1
		}, {
			"Code": "440007",
			"Name": "东区",
			"sort": 2
		}, {
			"Code": "440007",
			"Name": "西区",
			"sort": 3
		}, {
			"Code": "440007",
			"Name": "南区",
			"sort": 4
		}, {
			"Code": "440007",
			"Name": "五桂山区",
			"sort": 5
		}, {
			"Code": "440007",
			"Name": "火炬开发区",
			"sort": 6
		}],
		"sort": 7
	}, {
		"Code": "440008",
		"Name": "潮州市",
		"level": [{
			"Code": "440008",
			"Name": "湘桥区",
			"sort": 1
		}, {
			"Code": "440008",
			"Name": "枫溪区",
			"sort": 2
		}, {
			"Code": "440008",
			"Name": "潮安县",
			"level": [{
				"Code": "990",
				"Name": "庵埠镇"
			}, {
				"Code": "1004",
				"Name": "官塘镇"
			}, {
				"Code": "1003",
				"Name": "铁铺镇"
			}, {
				"Code": "1002",
				"Name": "磷溪镇"
			}, {
				"Code": "1001",
				"Name": "意溪镇"
			}, {
				"Code": "1000",
				"Name": "桥东镇"
			}, {
				"Code": "999",
				"Name": "江东镇"
			}, {
				"Code": "998",
				"Name": "龙湖镇"
			}, {
				"Code": "997",
				"Name": "东凤镇"
			}, {
				"Code": "996",
				"Name": "凤塘镇"
			}, {
				"Code": "995",
				"Name": "浮洋镇"
			}, {
				"Code": "994",
				"Name": "沙溪镇"
			}, {
				"Code": "993",
				"Name": "金石镇"
			}, {
				"Code": "992",
				"Name": "彩塘镇"
			}, {
				"Code": "1005",
				"Name": "古巷镇"
			}],
			"sort": 3
		}, {
			"Code": "440008",
			"Name": "饶平县",
			"level": [{
				"Code": "4888",
				"Name": "联饶镇 "
			}, {
				"Code": "1007",
				"Name": "饶平县城"
			}, {
				"Code": "1008",
				"Name": "黄岗镇"
			}, {
				"Code": "1009",
				"Name": "钱东镇"
			}, {
				"Code": "1010",
				"Name": "井洲镇"
			}, {
				"Code": "1011",
				"Name": "高堂镇"
			}],
			"sort": 4
		}],
		"sort": 8
	}, {
		"Code": "440009",
		"Name": "揭阳市",
		"level": [{
			"Code": "440009",
			"Name": "榕城区",
			"sort": 1
		}, {
			"Code": "440009",
			"Name": "渔湖经济开发试验区 ",
			"sort": 2
		}, {
			"Code": "440009",
			"Name": "东山区 ",
			"sort": 3
		}, {
			"Code": "440009",
			"Name": "揭东县",
			"level": [{
				"Code": "1014",
				"Name": "揭东县城"
			}, {
				"Code": "1025",
				"Name": "地都镇"
			}, {
				"Code": "1024",
				"Name": "埔田镇"
			}, {
				"Code": "1023",
				"Name": "桂岭镇"
			}, {
				"Code": "1022",
				"Name": "白塔镇"
			}, {
				"Code": "1021",
				"Name": "霖盘镇"
			}, {
				"Code": "1020",
				"Name": "月城镇"
			}, {
				"Code": "1019",
				"Name": "新亨镇"
			}, {
				"Code": "1018",
				"Name": "锡场镇"
			}, {
				"Code": "1017",
				"Name": "炮台镇"
			}, {
				"Code": "1016",
				"Name": "试验区"
			}, {
				"Code": "1015",
				"Name": "曲溪镇"
			}, {
				"Code": "1027",
				"Name": "云路镇"
			}],
			"sort": 4
		}, {
			"Code": "440009",
			"Name": "普宁市",
			"level": [{
				"Code": "1029",
				"Name": "流沙镇"
			}, {
				"Code": "1044",
				"Name": "南溪镇"
			}, {
				"Code": "1043",
				"Name": "普侨区"
			}, {
				"Code": "1042",
				"Name": "赤岗镇"
			}, {
				"Code": "1041",
				"Name": "洪阳镇"
			}, {
				"Code": "1040",
				"Name": "大坝镇"
			}, {
				"Code": "1039",
				"Name": "燎原镇"
			}, {
				"Code": "1038",
				"Name": "池尾镇"
			}, {
				"Code": "1037",
				"Name": "溪南镇"
			}, {
				"Code": "1036",
				"Name": "梅塘镇"
			}, {
				"Code": "1035",
				"Name": "里湖镇"
			}, {
				"Code": "1033",
				"Name": "大南山"
			}, {
				"Code": "1032",
				"Name": "军埠镇"
			}, {
				"Code": "1031",
				"Name": "下架山"
			}, {
				"Code": "1030",
				"Name": "占陇镇"
			}, {
				"Code": "1045",
				"Name": "广太镇"
			}],
			"sort": 5
		}, {
			"Code": "440009",
			"Name": "揭西县",
			"level": [{
				"Code": "1046",
				"Name": "揭西县城"
			}, {
				"Code": "1055",
				"Name": "京溪园镇"
			}, {
				"Code": "1054",
				"Name": "南山镇"
			}, {
				"Code": "1053",
				"Name": "灰寨镇"
			}, {
				"Code": "1052",
				"Name": "龙潭镇"
			}, {
				"Code": "1051",
				"Name": "凤江镇"
			}, {
				"Code": "1050",
				"Name": "棉湖镇"
			}, {
				"Code": "1049",
				"Name": "坪上镇"
			}, {
				"Code": "1048",
				"Name": "金和镇"
			}, {
				"Code": "1047",
				"Name": "河婆镇"
			}, {
				"Code": "1056",
				"Name": "五经富镇"
			}],
			"sort": 6
		}, {
			"Code": "440009",
			"Name": "惠来县",
			"level": [{
				"Code": "1057",
				"Name": "惠来县城"
			}, {
				"Code": "1058",
				"Name": "惠城镇"
			}, {
				"Code": "1059",
				"Name": "神泉镇"
			}, {
				"Code": "1060",
				"Name": "隆江镇"
			}, {
				"Code": "1061",
				"Name": "溪西镇"
			}, {
				"Code": "1062",
				"Name": "葵潭镇"
			}, {
				"Code": "1063",
				"Name": "华湖镇"
			}, {
				"Code": "1064",
				"Name": "东陇镇"
			}],
			"sort": 7
		}],
		"sort": 9
	}, {
		"Code": "440010",
		"Name": "云浮市",
		"level": [{
			"Code": "440010",
			"Name": "郁南县 ",
			"sort": 1
		}, {
			"Code": "440010",
			"Name": "云安县 ",
			"sort": 2
		}, {
			"Code": "440010",
			"Name": "市区",
			"level": [{
				"Code": "4945",
				"Name": "云城区"
			}, {
				"Code": "1212",
				"Name": "云城镇"
			}, {
				"Code": "1213",
				"Name": "高峰镇"
			}, {
				"Code": "1214",
				"Name": "河口镇"
			}, {
				"Code": "1215",
				"Name": "安塘镇"
			}],
			"sort": 3
		}, {
			"Code": "440010",
			"Name": "罗定市",
			"level": [{
				"Code": "1216",
				"Name": "罗城镇"
			}, {
				"Code": "1217",
				"Name": "附城镇"
			}, {
				"Code": "1218",
				"Name": "素龙镇"
			}, {
				"Code": "1219",
				"Name": "围底镇"
			}],
			"sort": 4
		}, {
			"Code": "440010",
			"Name": "新兴县",
			"level": [{
				"Code": "1220",
				"Name": "新城镇"
			}, {
				"Code": "1221",
				"Name": "车岗镇"
			}, {
				"Code": "1222",
				"Name": "东城镇"
			}],
			"sort": 5
		}],
		"sort": 10
	}, {
		"Code": "440011",
		"Name": "汕尾市",
		"level": [{
			"Code": "440011",
			"Name": "陆河县 ",
			"sort": 1
		}, {
			"Code": "440011",
			"Name": "市区",
			"level": [{
				"Code": "910",
				"Name": "马宫镇"
			}, {
				"Code": "911",
				"Name": "东涌镇"
			}, {
				"Code": "915",
				"Name": "捷胜镇"
			}, {
				"Code": "914",
				"Name": "红草镇"
			}, {
				"Code": "912",
				"Name": "田乾镇"
			}, {
				"Code": "913",
				"Name": "遮浪镇"
			}, {
				"Code": "916",
				"Name": "红海湾"
			}],
			"sort": 2
		}, {
			"Code": "440011",
			"Name": "海丰县",
			"level": [{
				"Code": "926",
				"Name": "海城镇"
			}, {
				"Code": "934",
				"Name": "陶河镇"
			}, {
				"Code": "933",
				"Name": "可塘镇"
			}, {
				"Code": "932",
				"Name": "赤坑镇"
			}, {
				"Code": "931",
				"Name": "公平镇"
			}, {
				"Code": "930",
				"Name": "后门镇"
			}, {
				"Code": "929",
				"Name": "梅陇镇"
			}, {
				"Code": "928",
				"Name": "附城镇"
			}, {
				"Code": "927",
				"Name": "城东镇"
			}, {
				"Code": "935",
				"Name": "莲花山镇"
			}],
			"sort": 3
		}, {
			"Code": "440011",
			"Name": "陆丰市",
			"level": [{
				"Code": "917",
				"Name": "东海镇"
			}, {
				"Code": "924",
				"Name": "河西镇"
			}, {
				"Code": "923",
				"Name": "河东镇"
			}, {
				"Code": "922",
				"Name": "南塘镇"
			}, {
				"Code": "921",
				"Name": "内湖镇"
			}, {
				"Code": "920",
				"Name": "城东镇"
			}, {
				"Code": "919",
				"Name": "甲子镇"
			}, {
				"Code": "908",
				"Name": "博美镇"
			}, {
				"Code": "918",
				"Name": "碣石镇"
			}, {
				"Code": "925",
				"Name": "潭西镇"
			}],
			"sort": 4
		}],
		"sort": 11
	}, {
		"Code": "440012",
		"Name": "梅州市",
		"level": [{
			"Code": "440012",
			"Name": "梅江区 ",
			"sort": 1
		}, {
			"Code": "440012",
			"Name": "大埔县 ",
			"sort": 2
		}, {
			"Code": "440012",
			"Name": "五华县 ",
			"sort": 3
		}, {
			"Code": "440012",
			"Name": "平远县 ",
			"sort": 4
		}, {
			"Code": "440012",
			"Name": "蕉岭县 ",
			"sort": 5
		}, {
			"Code": "440012",
			"Name": "兴宁市",
			"level": [{
				"Code": "4895",
				"Name": "叶塘镇 "
			}, {
				"Code": "1076",
				"Name": "永和镇"
			}, {
				"Code": "1075",
				"Name": "宁中镇"
			}, {
				"Code": "1074",
				"Name": "泥陂镇"
			}, {
				"Code": "1073",
				"Name": "坜陂镇"
			}, {
				"Code": "1072",
				"Name": "宁新镇"
			}, {
				"Code": "1071",
				"Name": "福兴镇"
			}, {
				"Code": "1070",
				"Name": "新陂镇"
			}, {
				"Code": "1069",
				"Name": "兴城镇"
			}, {
				"Code": "1068",
				"Name": "水口镇"
			}, {
				"Code": "1067",
				"Name": "新圩镇"
			}, {
				"Code": "1077",
				"Name": "刁坊镇"
			}],
			"sort": 6
		}, {
			"Code": "440012",
			"Name": "丰顺县",
			"level": [{
				"Code": "1078",
				"Name": "丰顺县城"
			}, {
				"Code": "1079",
				"Name": "汤坑镇"
			}, {
				"Code": "1080",
				"Name": "汤南镇"
			}, {
				"Code": "1081",
				"Name": "附城镇"
			}],
			"sort": 7
		}, {
			"Code": "440012",
			"Name": "梅县",
			"level": [{
				"Code": "4880",
				"Name": "新县城 "
			}, {
				"Code": "4884",
				"Name": "畲江镇 "
			}, {
				"Code": "4883",
				"Name": "程江镇 "
			}, {
				"Code": "4882",
				"Name": "扶大工业园区 "
			}, {
				"Code": "4881",
				"Name": "华侨城"
			}, {
				"Code": "4885",
				"Name": "城东镇 "
			}, {
				"Code": "4886",
				"Name": "水车镇 "
			}],
			"sort": 8
		}],
		"sort": 12
	}, {
		"Code": "440013",
		"Name": "惠州市",
		"level": [{
			"Code": "440013",
			"Name": "惠阳区",
			"sort": 1
		}, {
			"Code": "440013",
			"Name": "惠城区 ",
			"sort": 2
		}, {
			"Code": "440013",
			"Name": "博罗县",
			"level": [{
				"Code": "1083",
				"Name": "泰美镇"
			}, {
				"Code": "1093",
				"Name": "麻陂镇"
			}, {
				"Code": "1092",
				"Name": "杨侨镇"
			}, {
				"Code": "1091",
				"Name": "杨村镇"
			}, {
				"Code": "1090",
				"Name": "观音阁镇"
			}, {
				"Code": "1089",
				"Name": "平安镇"
			}, {
				"Code": "1088",
				"Name": "石坝镇"
			}, {
				"Code": "1087",
				"Name": "公庄镇"
			}, {
				"Code": "1085",
				"Name": "罗阳镇"
			}, {
				"Code": "1094",
				"Name": "柏塘镇"
			}],
			"sort": 3
		}, {
			"Code": "440013",
			"Name": "惠东县",
			"sort": 4
		}, {
			"Code": "440013",
			"Name": "龙门县",
			"level": [{
				"Code": "4879",
				"Name": "铁岗镇 "
			}, {
				"Code": "4878",
				"Name": "天堂山镇 "
			}, {
				"Code": "4877",
				"Name": "平陵镇 "
			}, {
				"Code": "4876",
				"Name": "王坪镇 "
			}, {
				"Code": "1108",
				"Name": "龙城镇"
			}],
			"sort": 5
		}],
		"sort": 13
	}, {
		"Code": "440014",
		"Name": "深圳市",
		"level": [{
			"Code": "440014",
			"Name": "罗湖区",
			"sort": 1
		}, {
			"Code": "440014",
			"Name": "福田区",
			"sort": 2
		}, {
			"Code": "440014",
			"Name": "盐田区",
			"sort": 3
		}, {
			"Code": "440014",
			"Name": "南山区",
			"sort": 4
		}, {
			"Code": "440014",
			"Name": "宝安区",
			"sort": 5
		}, {
			"Code": "440014",
			"Name": "龙岗区",
			"sort": 6
		}],
		"sort": 14
	}, {
		"Code": "440015",
		"Name": "珠海市",
		"level": [{
			"Code": "440015",
			"Name": "香州区",
			"sort": 1
		}, {
			"Code": "440015",
			"Name": "金湾区",
			"sort": 2
		}, {
			"Code": "440015",
			"Name": "斗门区",
			"sort": 3
		}],
		"sort": 15
	}, {
		"Code": "440016",
		"Name": "汕头市",
		"level": [{
			"Code": "440016",
			"Name": "南澳县 ",
			"sort": 1
		}, {
			"Code": "440016",
			"Name": "龙湖区",
			"sort": 2
		}, {
			"Code": "440016",
			"Name": "濠江区",
			"sort": 3
		}, {
			"Code": "440016",
			"Name": "金平区",
			"sort": 4
		}, {
			"Code": "440016",
			"Name": "澄海区",
			"sort": 5
		}, {
			"Code": "440016",
			"Name": "潮阳区",
			"sort": 6
		}, {
			"Code": "440016",
			"Name": "潮南区",
			"sort": 7
		}],
		"sort": 16
	}, {
		"Code": "440017",
		"Name": "韶关市",
		"level": [{
			"Code": "440017",
			"Name": "新丰县 ",
			"sort": 1
		}, {
			"Code": "440017",
			"Name": "南雄市",
			"level": [{
				"Code": "4887",
				"Name": "古市镇"
			}, {
				"Code": "1145",
				"Name": "雄洲镇"
			}, {
				"Code": "1146",
				"Name": "全安镇"
			}],
			"sort": 2
		}, {
			"Code": "440017",
			"Name": "翁源县",
			"level": [{
				"Code": "1143",
				"Name": "官渡镇"
			}],
			"sort": 3
		}, {
			"Code": "440017",
			"Name": "始兴县",
			"level": [{
				"Code": "4894",
				"Name": "顿岗镇 "
			}, {
				"Code": "4893",
				"Name": "城南镇 "
			}, {
				"Code": "4892",
				"Name": "太平镇 "
			}],
			"sort": 4
		}, {
			"Code": "440017",
			"Name": "仁化县",
			"level": [{
				"Code": "4891",
				"Name": "董塘镇 "
			}, {
				"Code": "4890",
				"Name": "凡口镇 "
			}, {
				"Code": "4889",
				"Name": "仁化镇 "
			}],
			"sort": 5
		}, {
			"Code": "440017",
			"Name": "乳源瑶族自治县",
			"level": [{
				"Code": "1136",
				"Name": "乳城镇"
			}, {
				"Code": "1137",
				"Name": "侯公渡镇"
			}, {
				"Code": "1138",
				"Name": "附城镇"
			}],
			"sort": 6
		}, {
			"Code": "440017",
			"Name": "乐昌市",
			"level": [{
				"Code": "1132",
				"Name": "乐城镇"
			}, {
				"Code": "1133",
				"Name": "河南镇"
			}, {
				"Code": "1134",
				"Name": "长来镇"
			}, {
				"Code": "1135",
				"Name": "北乡镇"
			}],
			"sort": 7
		}, {
			"Code": "440017",
			"Name": "曲江区",
			"sort": 8
		}, {
			"Code": "440017",
			"Name": "浈江区",
			"sort": 9
		}, {
			"Code": "440017",
			"Name": "武江区",
			"sort": 10
		}],
		"sort": 17
	}, {
		"Code": "440018",
		"Name": "佛山市",
		"level": [{
			"Code": "440018",
			"Name": "禅城区",
			"sort": 1
		}, {
			"Code": "440018",
			"Name": "南海区",
			"sort": 2
		}, {
			"Code": "440018",
			"Name": "高明区",
			"sort": 3
		}, {
			"Code": "440018",
			"Name": "三水区",
			"sort": 4
		}, {
			"Code": "440018",
			"Name": "顺德市",
			"sort": 5
		}],
		"sort": 18
	}, {
		"Code": "440019",
		"Name": "江门市",
		"level": [{
			"Code": "440019",
			"Name": "蓬江区",
			"sort": 1
		}, {
			"Code": "440019",
			"Name": "江海区",
			"sort": 2
		}, {
			"Code": "440019",
			"Name": "新会区",
			"sort": 3
		}, {
			"Code": "440019",
			"Name": "开平市",
			"level": [{
				"Code": "1147",
				"Name": "长沙区"
			}, {
				"Code": "1157",
				"Name": "苍城镇"
			}, {
				"Code": "1156",
				"Name": "龙胜镇"
			}, {
				"Code": "1155",
				"Name": "沙塘镇"
			}, {
				"Code": "1154",
				"Name": "塘口镇"
			}, {
				"Code": "1153",
				"Name": "赤坎镇"
			}, {
				"Code": "1152",
				"Name": "水井镇"
			}, {
				"Code": "1151",
				"Name": "月山镇"
			}, {
				"Code": "1150",
				"Name": "沙岗"
			}, {
				"Code": "1149",
				"Name": "水口镇"
			}, {
				"Code": "1148",
				"Name": "三埠区"
			}, {
				"Code": "1158",
				"Name": "百合镇"
			}],
			"sort": 4
		}, {
			"Code": "440019",
			"Name": "台山市",
			"level": [{
				"Code": "1160",
				"Name": "台城镇"
			}, {
				"Code": "1170",
				"Name": "大江镇"
			}, {
				"Code": "1169",
				"Name": "公益镇"
			}, {
				"Code": "1168",
				"Name": "斗山镇"
			}, {
				"Code": "1167",
				"Name": "三合镇"
			}, {
				"Code": "1166",
				"Name": "四九镇"
			}, {
				"Code": "1165",
				"Name": "冲蒌镇"
			}, {
				"Code": "1164",
				"Name": "广海镇"
			}, {
				"Code": "1163",
				"Name": "端芬镇"
			}, {
				"Code": "1162",
				"Name": "水步镇"
			}, {
				"Code": "1161",
				"Name": "附城镇"
			}, {
				"Code": "1171",
				"Name": "三八镇"
			}],
			"sort": 5
		}, {
			"Code": "440019",
			"Name": "恩平市",
			"level": [{
				"Code": "1172",
				"Name": "恩城镇"
			}, {
				"Code": "1173",
				"Name": "牛江镇"
			}, {
				"Code": "1174",
				"Name": "东成镇"
			}, {
				"Code": "1175",
				"Name": "君堂镇"
			}, {
				"Code": "1176",
				"Name": "圣堂镇"
			}, {
				"Code": "1177",
				"Name": "江洲镇"
			}, {
				"Code": "1178",
				"Name": "沙湖镇"
			}, {
				"Code": "1179",
				"Name": "大槐镇"
			}],
			"sort": 6
		}, {
			"Code": "440019",
			"Name": "鹤山市",
			"sort": 7
		}],
		"sort": 19
	}, {
		"Code": "440020",
		"Name": "湛江市",
		"level": [{
			"Code": "440020",
			"Name": "赤坎区",
			"sort": 1
		}, {
			"Code": "440020",
			"Name": "雷州市",
			"level": [{
				"Code": "1189",
				"Name": "雷城镇"
			}],
			"sort": 2
		}, {
			"Code": "440020",
			"Name": "廉江市",
			"level": [{
				"Code": "1185",
				"Name": "廉城镇"
			}, {
				"Code": "1186",
				"Name": "九洲江开发区"
			}, {
				"Code": "1187",
				"Name": "石城镇"
			}, {
				"Code": "1188",
				"Name": "河唇镇"
			}],
			"sort": 3
		}, {
			"Code": "440020",
			"Name": "吴川市",
			"level": [{
				"Code": "1181",
				"Name": "梅录镇"
			}, {
				"Code": "1182",
				"Name": "塘尾镇"
			}, {
				"Code": "1183",
				"Name": "博铺镇"
			}, {
				"Code": "1184",
				"Name": "大山江镇"
			}],
			"sort": 4
		}, {
			"Code": "440020",
			"Name": "遂溪县",
			"level": [{
				"Code": "1180",
				"Name": "遂城镇"
			}],
			"sort": 5
		}, {
			"Code": "440020",
			"Name": "湛江经济技术开发区",
			"sort": 6
		}, {
			"Code": "440020",
			"Name": "坡头区",
			"sort": 7
		}, {
			"Code": "440020",
			"Name": "麻章区",
			"sort": 8
		}, {
			"Code": "440020",
			"Name": "霞山区",
			"sort": 9
		}, {
			"Code": "440020",
			"Name": "徐闻县",
			"level": [{
				"Code": "1190",
				"Name": "徐城镇"
			}],
			"sort": 10
		}],
		"sort": 20
	}, {
		"Code": "440021",
		"Name": "茂名市",
		"level": [{
			"Code": "440021",
			"Name": "茂南区 ",
			"sort": 1
		}, {
			"Code": "440021",
			"Name": "茂港区 ",
			"sort": 2
		}, {
			"Code": "440021",
			"Name": "化州市",
			"level": [{
				"Code": "1194",
				"Name": "河东区"
			}, {
				"Code": "1195",
				"Name": "河西区"
			}, {
				"Code": "1196",
				"Name": "东山区"
			}, {
				"Code": "1197",
				"Name": "下郭开发区"
			}, {
				"Code": "1198",
				"Name": "鉴江开发区"
			}],
			"sort": 3
		}, {
			"Code": "440021",
			"Name": "高州市",
			"level": [{
				"Code": "4855",
				"Name": "石鼓镇 "
			}, {
				"Code": "4856",
				"Name": "低坡管理区 "
			}, {
				"Code": "1199",
				"Name": "中山区"
			}, {
				"Code": "1200",
				"Name": "南湖区"
			}, {
				"Code": "1201",
				"Name": "西岸区"
			}, {
				"Code": "1202",
				"Name": "山美区"
			}, {
				"Code": "1203",
				"Name": "石仔岭区"
			}, {
				"Code": "1204",
				"Name": "金山开发区"
			}],
			"sort": 4
		}, {
			"Code": "440021",
			"Name": "信宜市",
			"level": [{
				"Code": "1205",
				"Name": "东镇镇"
			}, {
				"Code": "1206",
				"Name": "池垌镇"
			}],
			"sort": 5
		}, {
			"Code": "440021",
			"Name": "电白县",
			"level": [{
				"Code": "1207",
				"Name": "水东镇"
			}, {
				"Code": "1208",
				"Name": "七迳镇"
			}, {
				"Code": "1209",
				"Name": "陈村镇"
			}, {
				"Code": "1210",
				"Name": "南海镇"
			}],
			"sort": 6
		}],
		"sort": 21
	}, {
		"Code": "440022",
		"Name": "肇庆市",
		"level": [{
			"Code": "440022",
			"Name": "端州区 ",
			"sort": 1
		}, {
			"Code": "440022",
			"Name": "鼎湖区 ",
			"sort": 2
		}, {
			"Code": "440022",
			"Name": "怀集县 ",
			"sort": 3
		}, {
			"Code": "440022",
			"Name": "封开县",
			"sort": 4
		}, {
			"Code": "440022",
			"Name": "大旺高新技术开发区 ",
			"sort": 5
		}, {
			"Code": "440022",
			"Name": "高要市",
			"level": [{
				"Code": "1114",
				"Name": "蚬岗镇"
			}, {
				"Code": "1126",
				"Name": "回龙"
			}, {
				"Code": "1125",
				"Name": "莲塘镇"
			}, {
				"Code": "1124",
				"Name": "蛟塘镇"
			}, {
				"Code": "1123",
				"Name": "白诸镇"
			}, {
				"Code": "1122",
				"Name": "小湘镇"
			}, {
				"Code": "1121",
				"Name": "白土镇"
			}, {
				"Code": "1120",
				"Name": "金利镇"
			}, {
				"Code": "1119",
				"Name": "金渡镇"
			}, {
				"Code": "1117",
				"Name": "新桥镇"
			}, {
				"Code": "1116",
				"Name": "马安镇"
			}, {
				"Code": "1115",
				"Name": "南岸镇"
			}, {
				"Code": "1127",
				"Name": "大湾镇"
			}],
			"sort": 6
		}, {
			"Code": "440022",
			"Name": "四会市",
			"sort": 7
		}, {
			"Code": "440022",
			"Name": "广宁县",
			"level": [{
				"Code": "1128",
				"Name": "南街镇"
			}, {
				"Code": "1129",
				"Name": "石涧镇"
			}],
			"sort": 8
		}, {
			"Code": "440022",
			"Name": "德庆县",
			"level": [{
				"Code": "1130",
				"Name": "德城镇"
			}, {
				"Code": "1131",
				"Name": "新圩镇"
			}],
			"sort": 9
		}],
		"sort": 22
	}, {
		"Code": "440023",
		"Name": "广州市",
		"level": [{
			"Code": "440023",
			"Name": "从化市",
			"sort": 1
		}, {
			"Code": "440023",
			"Name": "天河区",
			"sort": 2
		}, {
			"Code": "440023",
			"Name": "南沙区",
			"sort": 3
		}, {
			"Code": "440023",
			"Name": "萝岗区",
			"sort": 4
		}, {
			"Code": "440023",
			"Name": "番禺区",
			"sort": 5
		}, {
			"Code": "440023",
			"Name": "花都区",
			"sort": 6
		}, {
			"Code": "440023",
			"Name": "黄埔区",
			"sort": 7
		}, {
			"Code": "440023",
			"Name": "白云区",
			"sort": 8
		}, {
			"Code": "440023",
			"Name": "荔湾区",
			"sort": 9
		}, {
			"Code": "440023",
			"Name": "海珠区",
			"sort": 10
		}, {
			"Code": "440023",
			"Name": "越秀区",
			"sort": 11
		}, {
			"Code": "440023",
			"Name": "增城市",
			"sort": 12
		}],
		"sort": 23
	}]
}, {
	"Code": "450000",
	"Name": "广西壮族自治区",
	"level": [{
		"Code": "450001",
		"Name": "南宁市",
		"level": [{
			"Code": "450001",
			"Name": "五象新区",
			"sort": 1
		}, {
			"Code": "450001",
			"Name": "横县 ",
			"sort": 2
		}, {
			"Code": "450001",
			"Name": "宾阳县 ",
			"sort": 3
		}, {
			"Code": "450001",
			"Name": "上林县 ",
			"sort": 4
		}, {
			"Code": "450001",
			"Name": "马山县 ",
			"sort": 5
		}, {
			"Code": "450001",
			"Name": "隆安县 ",
			"sort": 6
		}, {
			"Code": "450001",
			"Name": "武鸣县 ",
			"sort": 7
		}, {
			"Code": "450001",
			"Name": "邕宁区  ",
			"sort": 8
		}, {
			"Code": "450001",
			"Name": "青秀区",
			"sort": 9
		}, {
			"Code": "450001",
			"Name": "良庆区",
			"sort": 10
		}, {
			"Code": "450001",
			"Name": "兴宁区",
			"sort": 11
		}, {
			"Code": "450001",
			"Name": "江南区",
			"sort": 12
		}, {
			"Code": "450001",
			"Name": "西乡塘区",
			"sort": 13
		}],
		"sort": 1
	}, {
		"Code": "450002",
		"Name": "来宾市",
		"level": [{
			"Code": "450002",
			"Name": "兴宾区 ",
			"sort": 1
		}, {
			"Code": "450002",
			"Name": "忻城县 ",
			"sort": 2
		}, {
			"Code": "450002",
			"Name": "象州县 ",
			"sort": 3
		}, {
			"Code": "450002",
			"Name": "武宣县 ",
			"sort": 4
		}, {
			"Code": "450002",
			"Name": "金秀瑶族自治县 ",
			"sort": 5
		}, {
			"Code": "450002",
			"Name": "合山市 ",
			"sort": 6
		}],
		"sort": 2
	}, {
		"Code": "450003",
		"Name": "河池市",
		"level": [{
			"Code": "450003",
			"Name": "金城江区  ",
			"sort": 1
		}, {
			"Code": "450003",
			"Name": "大化瑶族自治县 ",
			"sort": 2
		}, {
			"Code": "450003",
			"Name": "都安瑶族自治县 ",
			"sort": 3
		}, {
			"Code": "450003",
			"Name": "巴马瑶族自治县 ",
			"sort": 4
		}, {
			"Code": "450003",
			"Name": "环江毛南族自治县 ",
			"sort": 5
		}, {
			"Code": "450003",
			"Name": "罗城仫佬族自治县 ",
			"sort": 6
		}, {
			"Code": "450003",
			"Name": "东兰县 ",
			"sort": 7
		}, {
			"Code": "450003",
			"Name": "凤山县 ",
			"sort": 8
		}, {
			"Code": "450003",
			"Name": "天峨县 ",
			"sort": 9
		}, {
			"Code": "450003",
			"Name": "南丹县 ",
			"sort": 10
		}, {
			"Code": "450003",
			"Name": "宜州市 ",
			"sort": 11
		}],
		"sort": 3
	}, {
		"Code": "450004",
		"Name": "贺州市",
		"level": [{
			"Code": "450004",
			"Name": "八步区 ",
			"sort": 1
		}, {
			"Code": "450004",
			"Name": "昭平县 ",
			"sort": 2
		}, {
			"Code": "450004",
			"Name": "钟山县 ",
			"sort": 3
		}, {
			"Code": "450004",
			"Name": "富川瑶族自治县 ",
			"sort": 4
		}],
		"sort": 4
	}, {
		"Code": "450005",
		"Name": "百色市",
		"level": [{
			"Code": "450005",
			"Name": "右江区 ",
			"sort": 1
		}, {
			"Code": "450005",
			"Name": "西林县 ",
			"sort": 2
		}, {
			"Code": "450005",
			"Name": "田林县 ",
			"sort": 3
		}, {
			"Code": "450005",
			"Name": "乐业县 ",
			"sort": 4
		}, {
			"Code": "450005",
			"Name": "凌云县 ",
			"sort": 5
		}, {
			"Code": "450005",
			"Name": "那坡县 ",
			"sort": 6
		}, {
			"Code": "450005",
			"Name": "靖西县 ",
			"sort": 7
		}, {
			"Code": "450005",
			"Name": "德保县 ",
			"sort": 8
		}, {
			"Code": "450005",
			"Name": "平果县 ",
			"sort": 9
		}, {
			"Code": "450005",
			"Name": "田东县 ",
			"sort": 10
		}, {
			"Code": "450005",
			"Name": "田阳县  ",
			"sort": 11
		}, {
			"Code": "450005",
			"Name": "隆林各族自治县 ",
			"sort": 12
		}],
		"sort": 5
	}, {
		"Code": "450006",
		"Name": "玉林市",
		"level": [{
			"Code": "450006",
			"Name": "玉州区  ",
			"sort": 1
		}, {
			"Code": "450006",
			"Name": "容县 ",
			"sort": 2
		}, {
			"Code": "450006",
			"Name": "陆川县 ",
			"sort": 3
		}, {
			"Code": "450006",
			"Name": "博白县 ",
			"sort": 4
		}, {
			"Code": "450006",
			"Name": "兴业县 ",
			"sort": 5
		}, {
			"Code": "450006",
			"Name": "北流市 ",
			"sort": 6
		}, {
			"Code": "450006",
			"Name": "福绵区",
			"sort": 7
		}],
		"sort": 6
	}, {
		"Code": "450007",
		"Name": "贵港市",
		"level": [{
			"Code": "450007",
			"Name": "港北区 ",
			"sort": 1
		}, {
			"Code": "450007",
			"Name": "港南区  ",
			"sort": 2
		}, {
			"Code": "450007",
			"Name": "覃塘区 ",
			"sort": 3
		}, {
			"Code": "450007",
			"Name": "平南县 ",
			"sort": 4
		}, {
			"Code": "450007",
			"Name": "桂平市 ",
			"sort": 5
		}],
		"sort": 7
	}, {
		"Code": "450008",
		"Name": "钦州市",
		"level": [{
			"Code": "450008",
			"Name": "钦南区 ",
			"sort": 1
		}, {
			"Code": "450008",
			"Name": "钦北区 ",
			"sort": 2
		}, {
			"Code": "450008",
			"Name": "灵山县 ",
			"sort": 3
		}, {
			"Code": "450008",
			"Name": "浦北县 ",
			"sort": 4
		}],
		"sort": 8
	}, {
		"Code": "450009",
		"Name": "防城港市",
		"level": [{
			"Code": "450009",
			"Name": "港口区 ",
			"sort": 1
		}, {
			"Code": "450009",
			"Name": "防城区 ",
			"sort": 2
		}, {
			"Code": "450009",
			"Name": "上思县 ",
			"sort": 3
		}, {
			"Code": "450009",
			"Name": "东兴市 ",
			"sort": 4
		}],
		"sort": 9
	}, {
		"Code": "450010",
		"Name": "北海市",
		"level": [{
			"Code": "450010",
			"Name": "海城区 ",
			"sort": 1
		}, {
			"Code": "450010",
			"Name": "银海区 ",
			"sort": 2
		}, {
			"Code": "450010",
			"Name": "铁山港区 ",
			"sort": 3
		}, {
			"Code": "450010",
			"Name": "合浦县 ",
			"sort": 4
		}],
		"sort": 10
	}, {
		"Code": "450011",
		"Name": "梧州市",
		"level": [{
			"Code": "450011",
			"Name": "藤县 ",
			"sort": 1
		}, {
			"Code": "450011",
			"Name": "蒙山县 ",
			"sort": 2
		}, {
			"Code": "450011",
			"Name": "岑溪市 ",
			"sort": 3
		}, {
			"Code": "450011",
			"Name": "长洲区",
			"sort": 4
		}, {
			"Code": "450011",
			"Name": "万秀区",
			"sort": 5
		}, {
			"Code": "450011",
			"Name": "碟山区",
			"sort": 6
		}, {
			"Code": "450011",
			"Name": "苍梧县",
			"level": [{
				"Code": "1226",
				"Name": "县城中心"
			}, {
				"Code": "1227",
				"Name": "龙圩镇"
			}],
			"sort": 7
		}],
		"sort": 11
	}, {
		"Code": "450012",
		"Name": "桂林市",
		"level": [{
			"Code": "450012",
			"Name": "恭城瑶族自治县 ",
			"sort": 1
		}, {
			"Code": "450012",
			"Name": "荔浦县 ",
			"sort": 2
		}, {
			"Code": "450012",
			"Name": "平乐县 ",
			"sort": 3
		}, {
			"Code": "450012",
			"Name": "资源县 ",
			"sort": 4
		}, {
			"Code": "450012",
			"Name": "龙胜各族自治县 ",
			"sort": 5
		}, {
			"Code": "450012",
			"Name": "灌阳县 ",
			"sort": 6
		}, {
			"Code": "450012",
			"Name": "永福县 ",
			"sort": 7
		}, {
			"Code": "450012",
			"Name": "兴安县  ",
			"sort": 8
		}, {
			"Code": "450012",
			"Name": "全州县 ",
			"sort": 9
		}, {
			"Code": "450012",
			"Name": "阳朔县 ",
			"sort": 10
		}, {
			"Code": "450012",
			"Name": "临桂县",
			"level": [{
				"Code": "1224",
				"Name": "县城中心"
			}, {
				"Code": "1225",
				"Name": "临桂镇"
			}],
			"sort": 11
		}, {
			"Code": "450012",
			"Name": "灵川县",
			"level": [{
				"Code": "5913",
				"Name": "灵川镇"
			}, {
				"Code": "1223",
				"Name": "八里街经济开发区"
			}],
			"sort": 12
		}, {
			"Code": "450012",
			"Name": "雁山区",
			"sort": 13
		}, {
			"Code": "450012",
			"Name": "象山区",
			"sort": 14
		}, {
			"Code": "450012",
			"Name": "秀峰区",
			"sort": 15
		}, {
			"Code": "450012",
			"Name": "叠彩区",
			"sort": 16
		}, {
			"Code": "450012",
			"Name": "七星区",
			"sort": 17
		}],
		"sort": 12
	}, {
		"Code": "450013",
		"Name": "柳州市",
		"level": [{
			"Code": "450013",
			"Name": "三江侗族自治县 ",
			"sort": 1
		}, {
			"Code": "450013",
			"Name": "融水苗族自治县 ",
			"sort": 2
		}, {
			"Code": "450013",
			"Name": "融安县 ",
			"sort": 3
		}, {
			"Code": "450013",
			"Name": "鹿寨县 ",
			"sort": 4
		}, {
			"Code": "450013",
			"Name": "柳城县  ",
			"sort": 5
		}, {
			"Code": "450013",
			"Name": "柳江县 ",
			"level": [{
				"Code": "5911",
				"Name": "基隆开发区"
			}, {
				"Code": "5912",
				"Name": "开发区 "
			}],
			"sort": 6
		}, {
			"Code": "450013",
			"Name": "鱼峰区",
			"sort": 7
		}, {
			"Code": "450013",
			"Name": "柳南区",
			"sort": 8
		}, {
			"Code": "450013",
			"Name": "城中区",
			"sort": 9
		}, {
			"Code": "450013",
			"Name": "柳北区",
			"sort": 10
		}],
		"sort": 13
	}, {
		"Code": "450014",
		"Name": "崇左市",
		"level": [{
			"Code": "450014",
			"Name": "江洲区 ",
			"sort": 1
		}, {
			"Code": "450014",
			"Name": "扶绥县  ",
			"sort": 2
		}, {
			"Code": "450014",
			"Name": "宁明县 ",
			"sort": 3
		}, {
			"Code": "450014",
			"Name": "龙州县 ",
			"sort": 4
		}, {
			"Code": "450014",
			"Name": "大新县 ",
			"sort": 5
		}, {
			"Code": "450014",
			"Name": "天等县 ",
			"sort": 6
		}, {
			"Code": "450014",
			"Name": "凭祥市 ",
			"sort": 7
		}],
		"sort": 14
	}]
}, {
	"Code": "460000",
	"Name": "海南省",
	"level": [{
		"Code": "460001",
		"Name": "洋浦经济开发区",
		"sort": 1,
		"level": [{
			"Code": "460001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460002",
		"Name": "琼中黎族苗族自治县 ",
		"sort": 2,
		"level": [{
			"Code": "460002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460003",
		"Name": "保亭黎族苗族自治县 ",
		"sort": 3,
		"level": [{
			"Code": "460003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460004",
		"Name": "陵水黎族自治县 ",
		"sort": 4,
		"level": [{
			"Code": "460004",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460005",
		"Name": "临高县 ",
		"sort": 5,
		"level": [{
			"Code": "460005",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460006",
		"Name": "乐东黎族自治县 ",
		"sort": 6,
		"level": [{
			"Code": "460006",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460007",
		"Name": "定安县 ",
		"sort": 7,
		"level": [{
			"Code": "460007",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460008",
		"Name": "澄迈县 ",
		"sort": 8,
		"level": [{
			"Code": "460008",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460009",
		"Name": "昌江黎族自治县 ",
		"sort": 9,
		"level": [{
			"Code": "460009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460010",
		"Name": "屯昌县 ",
		"sort": 10,
		"level": [{
			"Code": "460010",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460011",
		"Name": "白沙黎族自治县  ",
		"sort": 11,
		"level": [{
			"Code": "460011",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460012",
		"Name": "五指山市",
		"sort": 12,
		"level": [{
			"Code": "460012",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460013",
		"Name": "东方市",
		"sort": 13,
		"level": [{
			"Code": "460013",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460014",
		"Name": "儋州市",
		"sort": 14,
		"level": [{
			"Code": "460014",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460015",
		"Name": "琼海市",
		"sort": 15,
		"level": [{
			"Code": "460015",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460016",
		"Name": "文昌市",
		"sort": 16,
		"level": [{
			"Code": "460016",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460017",
		"Name": "万宁市",
		"sort": 17,
		"level": [{
			"Code": "460017",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460018",
		"Name": "三亚市",
		"sort": 18,
		"level": [{
			"Code": "460018",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "460019",
		"Name": "海口市",
		"level": [{
			"Code": "460019",
			"Name": "龙华区",
			"sort": 1
		}, {
			"Code": "460019",
			"Name": "琼山区",
			"sort": 2
		}, {
			"Code": "460019",
			"Name": "美兰区",
			"sort": 3
		}, {
			"Code": "460019",
			"Name": "秀英区",
			"sort": 4
		}, {
			"Code": "460019",
			"Name": "港澳开发区",
			"sort": 5
		}],
		"sort": 19
	}]
}, {
	"Code": "500000",
	"Name": "重庆市",
	"level": [{
		"Code": "500001",
		"Name": "万州区",
		"sort": 1,
		"level": [{
			"Code": "500001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500002",
		"Name": "垫江县",
		"sort": 2,
		"level": [{
			"Code": "500002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500003",
		"Name": "丰都县",
		"sort": 3,
		"level": [{
			"Code": "500003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500004",
		"Name": "城口县 ",
		"sort": 4,
		"level": [{
			"Code": "500004",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500005",
		"Name": "梁平县",
		"sort": 5,
		"level": [{
			"Code": "500005",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500006",
		"Name": "璧山县",
		"level": [{
			"Code": "500006",
			"Name": "青杠镇",
			"sort": 1
		}],
		"sort": 6
	}, {
		"Code": "500007",
		"Name": "荣昌县",
		"sort": 7,
		"level": [{
			"Code": "500007",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500008",
		"Name": "大足县",
		"sort": 8,
		"level": [{
			"Code": "500008",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500009",
		"Name": "铜梁县",
		"sort": 9,
		"level": [{
			"Code": "500009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500010",
		"Name": "武隆县",
		"sort": 10,
		"level": [{
			"Code": "500010",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500011",
		"Name": "忠县",
		"sort": 11,
		"level": [{
			"Code": "500011",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500012",
		"Name": "酉阳土家族苗族自治县",
		"sort": 12,
		"level": [{
			"Code": "500012",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500013",
		"Name": "秀山土家族苗族自治县",
		"sort": 13,
		"level": [{
			"Code": "500013",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500014",
		"Name": "石柱土家族自治县",
		"sort": 14,
		"level": [{
			"Code": "500014",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500015",
		"Name": "巫溪县",
		"sort": 15,
		"level": [{
			"Code": "500015",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500016",
		"Name": "巫山县",
		"sort": 16,
		"level": [{
			"Code": "500016",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500017",
		"Name": "奉节县",
		"sort": 17,
		"level": [{
			"Code": "500017",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500018",
		"Name": "云阳县",
		"sort": 18,
		"level": [{
			"Code": "500018",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500019",
		"Name": "开县",
		"sort": 19,
		"level": [{
			"Code": "500019",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500020",
		"Name": "潼南县",
		"sort": 20,
		"level": [{
			"Code": "500020",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500021",
		"Name": "綦江县",
		"sort": 21,
		"level": [{
			"Code": "500021",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500022",
		"Name": "北碚区",
		"sort": 22,
		"level": [{
			"Code": "500022",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500023",
		"Name": "南岸区",
		"sort": 23,
		"level": [{
			"Code": "500023",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500024",
		"Name": "沙坪坝区",
		"sort": 24,
		"level": [{
			"Code": "500024",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500025",
		"Name": "江北区",
		"sort": 25,
		"level": [{
			"Code": "500025",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500026",
		"Name": "大渡口区",
		"sort": 26,
		"level": [{
			"Code": "500026",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500027",
		"Name": "渝中区",
		"sort": 27,
		"level": [{
			"Code": "500027",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500028",
		"Name": "九龙坡区",
		"sort": 28,
		"level": [{
			"Code": "500028",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500029",
		"Name": "涪陵区",
		"sort": 29,
		"level": [{
			"Code": "500029",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500030",
		"Name": "万盛区",
		"sort": 30,
		"level": [{
			"Code": "500030",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500031",
		"Name": "双桥区",
		"sort": 31,
		"level": [{
			"Code": "500031",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500032",
		"Name": "南川区",
		"sort": 32,
		"level": [{
			"Code": "500032",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500033",
		"Name": "永川区",
		"sort": 33,
		"level": [{
			"Code": "500033",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500034",
		"Name": "合川区",
		"sort": 34,
		"level": [{
			"Code": "500034",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500035",
		"Name": "江津区",
		"sort": 35,
		"level": [{
			"Code": "500035",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500036",
		"Name": "长寿区",
		"sort": 36,
		"level": [{
			"Code": "500036",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500037",
		"Name": "黔江区",
		"sort": 37,
		"level": [{
			"Code": "500037",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500038",
		"Name": "巴南区",
		"sort": 38,
		"level": [{
			"Code": "500038",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500039",
		"Name": "渝北区",
		"sort": 39,
		"level": [{
			"Code": "500039",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "500040",
		"Name": "彭水苗族土家族自治县",
		"sort": 40,
		"level": [{
			"Code": "500040",
			"Name": "--",
			"sort": 1
		}]
	}]
}, {
	"Code": "510000",
	"Name": "四川省",
	"level": [{
		"Code": "510001",
		"Name": "西昌市",
		"sort": 1,
		"level": [{
			"Code": "510001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "510002",
		"Name": "广安市",
		"sort": 2,
		"level": [{
			"Code": "510002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "510003",
		"Name": "达州市",
		"sort": 3,
		"level": [{
			"Code": "510003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "510004",
		"Name": "眉山市",
		"level": [{
			"Code": "510004",
			"Name": "洪雅县",
			"sort": 1
		}, {
			"Code": "510004",
			"Name": "彭山县",
			"sort": 2
		}, {
			"Code": "510004",
			"Name": "眉山市区",
			"sort": 3
		}, {
			"Code": "510004",
			"Name": "东坡区",
			"sort": 4
		}],
		"sort": 4
	}, {
		"Code": "510005",
		"Name": "雅安市",
		"level": [{
			"Code": "510005",
			"Name": "荥经县",
			"sort": 1
		}, {
			"Code": "510005",
			"Name": "石棉县",
			"sort": 2
		}, {
			"Code": "510005",
			"Name": "名山区",
			"sort": 3
		}, {
			"Code": "510005",
			"Name": "汉源县",
			"sort": 4
		}, {
			"Code": "510005",
			"Name": "雨城区",
			"sort": 5
		}],
		"sort": 5
	}, {
		"Code": "510006",
		"Name": "巴中市",
		"level": [{
			"Code": "510006",
			"Name": "南江县",
			"sort": 1
		}, {
			"Code": "510006",
			"Name": "巴州区",
			"sort": 2
		}],
		"sort": 6
	}, {
		"Code": "510007",
		"Name": "资阳市",
		"sort": 7,
		"level": [{
			"Code": "510007",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "510008",
		"Name": "阿坝藏族羌族自治州",
		"sort": 8,
		"level": [{
			"Code": "510008",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "510009",
		"Name": "甘孜藏族自治州",
		"sort": 9,
		"level": [{
			"Code": "510009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "510010",
		"Name": "凉山彝族自治州",
		"sort": 10,
		"level": [{
			"Code": "510010",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "510011",
		"Name": "宜宾市",
		"level": [{
			"Code": "510011",
			"Name": "南岸",
			"sort": 1
		}, {
			"Code": "510011",
			"Name": "屏山县 ",
			"sort": 2
		}, {
			"Code": "510011",
			"Name": "兴文县 ",
			"sort": 3
		}, {
			"Code": "510011",
			"Name": "筠连县 ",
			"sort": 4
		}, {
			"Code": "510011",
			"Name": "珙县 ",
			"sort": 5
		}, {
			"Code": "510011",
			"Name": "高县 ",
			"sort": 6
		}, {
			"Code": "510011",
			"Name": "长宁县 ",
			"sort": 7
		}, {
			"Code": "510011",
			"Name": "江安县 ",
			"sort": 8
		}, {
			"Code": "510011",
			"Name": "南溪县 ",
			"sort": 9
		}, {
			"Code": "510011",
			"Name": "宜宾县",
			"level": [{
				"Code": "1263",
				"Name": "柏溪镇"
			}],
			"sort": 10
		}, {
			"Code": "510011",
			"Name": "江北区",
			"sort": 11
		}, {
			"Code": "510011",
			"Name": "盐坪坝区",
			"sort": 12
		}, {
			"Code": "510011",
			"Name": "翠屏区",
			"sort": 13
		}],
		"sort": 11
	}, {
		"Code": "510012",
		"Name": "南充市",
		"level": [{
			"Code": "510012",
			"Name": "南部县  ",
			"sort": 1
		}, {
			"Code": "510012",
			"Name": "营山县 ",
			"sort": 2
		}, {
			"Code": "510012",
			"Name": "蓬安县 ",
			"sort": 3
		}, {
			"Code": "510012",
			"Name": "仪陇县 ",
			"sort": 4
		}, {
			"Code": "510012",
			"Name": "西充县 ",
			"sort": 5
		}, {
			"Code": "510012",
			"Name": "阆中市 ",
			"sort": 6
		}, {
			"Code": "510012",
			"Name": "顺庆区",
			"sort": 7
		}, {
			"Code": "510012",
			"Name": "高坪区",
			"sort": 8
		}, {
			"Code": "510012",
			"Name": "嘉陵区",
			"sort": 9
		}],
		"sort": 12
	}, {
		"Code": "510013",
		"Name": "自贡市",
		"level": [{
			"Code": "510013",
			"Name": "荣县 ",
			"sort": 1
		}, {
			"Code": "510013",
			"Name": "富顺县 ",
			"sort": 2
		}, {
			"Code": "510013",
			"Name": "汇东新区",
			"sort": 3
		}, {
			"Code": "510013",
			"Name": "自流井区",
			"sort": 4
		}, {
			"Code": "510013",
			"Name": "大安区",
			"sort": 5
		}, {
			"Code": "510013",
			"Name": "贡井区",
			"sort": 6
		}, {
			"Code": "510013",
			"Name": "沿滩区",
			"sort": 7
		}],
		"sort": 13
	}, {
		"Code": "510014",
		"Name": "攀枝花市",
		"level": [{
			"Code": "510014",
			"Name": "东区 ",
			"sort": 1
		}, {
			"Code": "510014",
			"Name": "西区 ",
			"sort": 2
		}, {
			"Code": "510014",
			"Name": "仁和区 ",
			"sort": 3
		}, {
			"Code": "510014",
			"Name": "米易县 ",
			"sort": 4
		}, {
			"Code": "510014",
			"Name": "盐边县 ",
			"sort": 5
		}],
		"sort": 14
	}, {
		"Code": "510015",
		"Name": "泸州市",
		"level": [{
			"Code": "510015",
			"Name": "合江县 ",
			"sort": 1
		}, {
			"Code": "510015",
			"Name": "叙永县 ",
			"sort": 2
		}, {
			"Code": "510015",
			"Name": "古蔺县 ",
			"sort": 3
		}, {
			"Code": "510015",
			"Name": "江阳区",
			"sort": 4
		}, {
			"Code": "510015",
			"Name": "泸县",
			"level": [{
				"Code": "1268",
				"Name": "福集镇"
			}],
			"sort": 5
		}, {
			"Code": "510015",
			"Name": "龙马潭区",
			"sort": 6
		}, {
			"Code": "510015",
			"Name": "纳溪区",
			"sort": 7
		}],
		"sort": 15
	}, {
		"Code": "510016",
		"Name": "德阳市",
		"level": [{
			"Code": "510016",
			"Name": "中江县",
			"sort": 1
		}, {
			"Code": "510016",
			"Name": "罗江县",
			"sort": 2
		}, {
			"Code": "510016",
			"Name": "天元开发区",
			"sort": 3
		}, {
			"Code": "510016",
			"Name": "旌湖经济技术开发区",
			"sort": 4
		}, {
			"Code": "510016",
			"Name": "旌阳区",
			"sort": 5
		}, {
			"Code": "510016",
			"Name": "广汉市",
			"level": [{
				"Code": "1273",
				"Name": "小汉镇"
			}, {
				"Code": "1274",
				"Name": "雒城镇"
			}, {
				"Code": "1275",
				"Name": "新丰镇"
			}, {
				"Code": "1276",
				"Name": "万福镇"
			}, {
				"Code": "1277",
				"Name": "北外乡"
			}, {
				"Code": "1278",
				"Name": "向阳镇"
			}, {
				"Code": "1279",
				"Name": "西外乡"
			}, {
				"Code": "1280",
				"Name": "东南乡"
			}],
			"sort": 6
		}, {
			"Code": "510016",
			"Name": "绵竹市",
			"level": [{
				"Code": "6077",
				"Name": "玉泉镇"
			}, {
				"Code": "1281",
				"Name": "剑南镇"
			}, {
				"Code": "1282",
				"Name": "清道镇"
			}, {
				"Code": "1283",
				"Name": "东北镇"
			}, {
				"Code": "1284",
				"Name": "西南镇"
			}],
			"sort": 7
		}, {
			"Code": "510016",
			"Name": "什邡市",
			"level": [{
				"Code": "1285",
				"Name": "方亭镇"
			}, {
				"Code": "1286",
				"Name": "回澜镇"
			}, {
				"Code": "1287",
				"Name": "皂角镇"
			}, {
				"Code": "1288",
				"Name": "元石镇"
			}],
			"sort": 8
		}],
		"sort": 16
	}, {
		"Code": "510017",
		"Name": "绵阳市",
		"level": [{
			"Code": "510017",
			"Name": "盐亭县 ",
			"sort": 1
		}, {
			"Code": "510017",
			"Name": "平武县",
			"sort": 2
		}, {
			"Code": "510017",
			"Name": "梓潼县 ",
			"sort": 3
		}, {
			"Code": "510017",
			"Name": "安县",
			"sort": 4
		}, {
			"Code": "510017",
			"Name": "北川县 ",
			"sort": 5
		}, {
			"Code": "510017",
			"Name": "高新区",
			"sort": 6
		}, {
			"Code": "510017",
			"Name": "江油市",
			"level": [{
				"Code": "1294",
				"Name": "江油市区"
			}],
			"sort": 7
		}, {
			"Code": "510017",
			"Name": "游仙区",
			"sort": 8
		}, {
			"Code": "510017",
			"Name": "涪城区",
			"sort": 9
		}, {
			"Code": "510017",
			"Name": "经开区",
			"sort": 10
		}, {
			"Code": "510017",
			"Name": "三台县",
			"level": [{
				"Code": "1295",
				"Name": "县城中心"
			}],
			"sort": 11
		}],
		"sort": 17
	}, {
		"Code": "510018",
		"Name": "广元市",
		"level": [{
			"Code": "510018",
			"Name": "市中区 ",
			"sort": 1
		}, {
			"Code": "510018",
			"Name": "元坝区 ",
			"sort": 2
		}, {
			"Code": "510018",
			"Name": "朝天区 ",
			"sort": 3
		}, {
			"Code": "510018",
			"Name": "旺苍县 ",
			"sort": 4
		}, {
			"Code": "510018",
			"Name": "青川县 ",
			"sort": 5
		}, {
			"Code": "510018",
			"Name": "剑阁县 ",
			"sort": 6
		}, {
			"Code": "510018",
			"Name": "苍溪县 ",
			"sort": 7
		}],
		"sort": 18
	}, {
		"Code": "510019",
		"Name": "遂宁市",
		"level": [{
			"Code": "510019",
			"Name": "安居区 ",
			"sort": 1
		}, {
			"Code": "510019",
			"Name": "蓬溪县 ",
			"sort": 2
		}, {
			"Code": "510019",
			"Name": "射洪县 ",
			"sort": 3
		}, {
			"Code": "510019",
			"Name": "大英县 ",
			"sort": 4
		}, {
			"Code": "510019",
			"Name": "船山区",
			"sort": 5
		}],
		"sort": 19
	}, {
		"Code": "510020",
		"Name": "内江市",
		"level": [{
			"Code": "510020",
			"Name": "威远县  ",
			"sort": 1
		}, {
			"Code": "510020",
			"Name": "资中县 ",
			"sort": 2
		}, {
			"Code": "510020",
			"Name": "市中区",
			"sort": 3
		}, {
			"Code": "510020",
			"Name": "东兴区",
			"sort": 4
		}, {
			"Code": "510020",
			"Name": "隆昌县",
			"level": [{
				"Code": "1297",
				"Name": "县城中心"
			}],
			"sort": 5
		}],
		"sort": 20
	}, {
		"Code": "510021",
		"Name": "乐山市",
		"level": [{
			"Code": "510021",
			"Name": "峨眉山市 ",
			"sort": 1
		}, {
			"Code": "510021",
			"Name": "马边彝族自治县 ",
			"sort": 2
		}, {
			"Code": "510021",
			"Name": "峨边彝族自治县 ",
			"sort": 3
		}, {
			"Code": "510021",
			"Name": "沐川县 ",
			"sort": 4
		}, {
			"Code": "510021",
			"Name": "夹江县  ",
			"sort": 5
		}, {
			"Code": "510021",
			"Name": "井研县 ",
			"sort": 6
		}, {
			"Code": "510021",
			"Name": "犍为县 ",
			"sort": 7
		}, {
			"Code": "510021",
			"Name": "金口河区 ",
			"sort": 8
		}, {
			"Code": "510021",
			"Name": "沙湾区  ",
			"sort": 9
		}, {
			"Code": "510021",
			"Name": "市中区",
			"sort": 10
		}, {
			"Code": "510021",
			"Name": "五通桥区",
			"sort": 11
		}, {
			"Code": "510021",
			"Name": "高新技术开发区",
			"sort": 12
		}],
		"sort": 21
	}, {
		"Code": "510022",
		"Name": "成都市",
		"level": [{
			"Code": "510022",
			"Name": "成都高新区",
			"sort": 1
		}, {
			"Code": "510022",
			"Name": "青白江区",
			"sort": 2
		}, {
			"Code": "510022",
			"Name": "金堂县",
			"level": [{
				"Code": "5917",
				"Name": "老城区"
			}, {
				"Code": "5918",
				"Name": "新城区"
			}],
			"sort": 3
		}, {
			"Code": "510022",
			"Name": "大邑县",
			"level": [{
				"Code": "5919",
				"Name": "晋原镇"
			}, {
				"Code": "5920",
				"Name": "王泗镇"
			}, {
				"Code": "5921",
				"Name": "安仁镇"
			}, {
				"Code": "5922",
				"Name": "苏家镇"
			}],
			"sort": 4
		}, {
			"Code": "510022",
			"Name": "浦江县",
			"sort": 5
		}, {
			"Code": "510022",
			"Name": "彭州市 ",
			"sort": 6
		}, {
			"Code": "510022",
			"Name": "邛崃市 ",
			"level": [{
				"Code": "5923",
				"Name": "县城"
			}, {
				"Code": "5924",
				"Name": "安宁镇中心 "
			}],
			"sort": 7
		}, {
			"Code": "510022",
			"Name": "新津县",
			"level": [{
				"Code": "6069",
				"Name": "五津镇"
			}, {
				"Code": "1257",
				"Name": "新平镇"
			}, {
				"Code": "1258",
				"Name": "邓双镇"
			}, {
				"Code": "1259",
				"Name": "花桥镇"
			}, {
				"Code": "1260",
				"Name": "兴乐镇"
			}, {
				"Code": "1261",
				"Name": "花源镇"
			}],
			"sort": 8
		}, {
			"Code": "510022",
			"Name": "崇州市",
			"level": [{
				"Code": "5916",
				"Name": "市区"
			}],
			"sort": 9
		}, {
			"Code": "510022",
			"Name": "都江堰市",
			"level": [{
				"Code": "1247",
				"Name": "灌口镇"
			}, {
				"Code": "1248",
				"Name": "幸福镇"
			}, {
				"Code": "1249",
				"Name": "胥家镇"
			}, {
				"Code": "1250",
				"Name": "蒲阳镇"
			}, {
				"Code": "1251",
				"Name": "玉堂镇"
			}, {
				"Code": "1252",
				"Name": "中兴镇"
			}, {
				"Code": "1253",
				"Name": "青城山镇"
			}, {
				"Code": "1254",
				"Name": "石羊镇"
			}, {
				"Code": "1255",
				"Name": "聚源镇"
			}],
			"sort": 10
		}, {
			"Code": "510022",
			"Name": "郫县",
			"level": [{
				"Code": "1241",
				"Name": "犀浦镇"
			}, {
				"Code": "1242",
				"Name": "红光镇"
			}, {
				"Code": "1243",
				"Name": "郫简镇"
			}, {
				"Code": "1244",
				"Name": "团结镇"
			}, {
				"Code": "1245",
				"Name": "安靖镇"
			}, {
				"Code": "1246",
				"Name": "德源镇"
			}],
			"sort": 11
		}, {
			"Code": "510022",
			"Name": "双流县",
			"level": [{
				"Code": "1231",
				"Name": "东升镇"
			}, {
				"Code": "1239",
				"Name": "黄水镇"
			}, {
				"Code": "1238",
				"Name": "彭镇"
			}, {
				"Code": "1237",
				"Name": "公兴镇"
			}, {
				"Code": "1236",
				"Name": "机场工业区"
			}, {
				"Code": "1235",
				"Name": "文星镇"
			}, {
				"Code": "1234",
				"Name": "华阳镇"
			}, {
				"Code": "1233",
				"Name": "中和镇"
			}, {
				"Code": "1232",
				"Name": "九江镇"
			}, {
				"Code": "1240",
				"Name": "黄甲镇"
			}],
			"sort": 12
		}, {
			"Code": "510022",
			"Name": "青羊区",
			"sort": 13
		}, {
			"Code": "510022",
			"Name": "金牛区",
			"sort": 14
		}, {
			"Code": "510022",
			"Name": "成华区",
			"sort": 15
		}, {
			"Code": "510022",
			"Name": "锦江区",
			"sort": 16
		}, {
			"Code": "510022",
			"Name": "温江区",
			"sort": 17
		}, {
			"Code": "510022",
			"Name": "新都区",
			"sort": 18
		}, {
			"Code": "510022",
			"Name": "龙泉驿区",
			"sort": 19
		}, {
			"Code": "510022",
			"Name": "成都高新西区",
			"sort": 20
		}, {
			"Code": "510022",
			"Name": "武候区",
			"sort": 21
		}],
		"sort": 22
	}]
}, {
	"Code": "520000",
	"Name": "贵州省",
	"level": [{
		"Code": "520001",
		"Name": "兴义市",
		"sort": 1,
		"level": [{
			"Code": "520001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "520002",
		"Name": "凯里市",
		"sort": 2,
		"level": [{
			"Code": "520002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "520003",
		"Name": "都匀市",
		"sort": 3,
		"level": [{
			"Code": "520003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "520004",
		"Name": "黔南布依族苗族自治州",
		"level": [{
			"Code": "520004",
			"Name": "都匀市  ",
			"sort": 1
		}, {
			"Code": "520004",
			"Name": "惠水县 ",
			"sort": 2
		}, {
			"Code": "520004",
			"Name": "龙里县 ",
			"sort": 3
		}, {
			"Code": "520004",
			"Name": "长顺县 ",
			"sort": 4
		}, {
			"Code": "520004",
			"Name": "罗甸县  ",
			"sort": 5
		}, {
			"Code": "520004",
			"Name": "平塘县 ",
			"sort": 6
		}, {
			"Code": "520004",
			"Name": "独山县 ",
			"sort": 7
		}, {
			"Code": "520004",
			"Name": "瓮安县 ",
			"sort": 8
		}, {
			"Code": "520004",
			"Name": "贵定县 ",
			"sort": 9
		}, {
			"Code": "520004",
			"Name": "荔波县 ",
			"sort": 10
		}, {
			"Code": "520004",
			"Name": "福泉市 ",
			"sort": 11
		}, {
			"Code": "520004",
			"Name": "三都水族自治县 ",
			"sort": 12
		}],
		"sort": 4
	}, {
		"Code": "520005",
		"Name": "黔东南苗族侗族自治州",
		"level": [{
			"Code": "520005",
			"Name": "凯里市 ",
			"sort": 1
		}, {
			"Code": "520005",
			"Name": "麻江县 ",
			"sort": 2
		}, {
			"Code": "520005",
			"Name": "雷山县 ",
			"sort": 3
		}, {
			"Code": "520005",
			"Name": "从江县 ",
			"sort": 4
		}, {
			"Code": "520005",
			"Name": "榕江县 ",
			"sort": 5
		}, {
			"Code": "520005",
			"Name": "黎平县 ",
			"sort": 6
		}, {
			"Code": "520005",
			"Name": "台江县 ",
			"sort": 7
		}, {
			"Code": "520005",
			"Name": "剑河县 ",
			"sort": 8
		}, {
			"Code": "520005",
			"Name": "锦屏县 ",
			"sort": 9
		}, {
			"Code": "520005",
			"Name": "天柱县 ",
			"sort": 10
		}, {
			"Code": "520005",
			"Name": "岑巩县 ",
			"sort": 11
		}, {
			"Code": "520005",
			"Name": "镇远县 ",
			"sort": 12
		}, {
			"Code": "520005",
			"Name": "三穗县 ",
			"sort": 13
		}, {
			"Code": "520005",
			"Name": "施秉县 ",
			"sort": 14
		}, {
			"Code": "520005",
			"Name": "黄平县 ",
			"sort": 15
		}, {
			"Code": "520005",
			"Name": "丹寨县 ",
			"sort": 16
		}],
		"sort": 5
	}, {
		"Code": "520006",
		"Name": "黔西南布依族苗族自治州",
		"level": [{
			"Code": "520006",
			"Name": "兴义市 ",
			"sort": 1
		}, {
			"Code": "520006",
			"Name": "兴仁县 ",
			"sort": 2
		}, {
			"Code": "520006",
			"Name": "普安县 ",
			"sort": 3
		}, {
			"Code": "520006",
			"Name": "晴隆县 ",
			"sort": 4
		}, {
			"Code": "520006",
			"Name": "贞丰县 ",
			"sort": 5
		}, {
			"Code": "520006",
			"Name": "望谟县 ",
			"sort": 6
		}, {
			"Code": "520006",
			"Name": "册亨县 ",
			"sort": 7
		}, {
			"Code": "520006",
			"Name": "安龙县 ",
			"sort": 8
		}],
		"sort": 6
	}, {
		"Code": "520007",
		"Name": "毕节地区",
		"level": [{
			"Code": "520007",
			"Name": "毕节市  ",
			"sort": 1
		}, {
			"Code": "520007",
			"Name": "大方县 ",
			"sort": 2
		}, {
			"Code": "520007",
			"Name": "黔西县 ",
			"sort": 3
		}, {
			"Code": "520007",
			"Name": "金沙县 ",
			"sort": 4
		}, {
			"Code": "520007",
			"Name": "织金县 ",
			"sort": 5
		}, {
			"Code": "520007",
			"Name": "纳雍县 ",
			"sort": 6
		}, {
			"Code": "520007",
			"Name": "威宁彝族回族苗族自治县 ",
			"sort": 7
		}, {
			"Code": "520007",
			"Name": "赫章县 ",
			"sort": 8
		}],
		"sort": 7
	}, {
		"Code": "520008",
		"Name": "铜仁地区",
		"level": [{
			"Code": "520008",
			"Name": "铜仁市  ",
			"sort": 1
		}, {
			"Code": "520008",
			"Name": "松桃苗族自治县 ",
			"sort": 2
		}, {
			"Code": "520008",
			"Name": "沿河土家族自治县 ",
			"sort": 3
		}, {
			"Code": "520008",
			"Name": "德江县 ",
			"sort": 4
		}, {
			"Code": "520008",
			"Name": "印江土家族苗族自治县 ",
			"sort": 5
		}, {
			"Code": "520008",
			"Name": "思南县 ",
			"sort": 6
		}, {
			"Code": "520008",
			"Name": "石阡县 ",
			"sort": 7
		}, {
			"Code": "520008",
			"Name": "玉屏侗族自治县 ",
			"sort": 8
		}, {
			"Code": "520008",
			"Name": "江口县 ",
			"sort": 9
		}, {
			"Code": "520008",
			"Name": "万山特区 ",
			"sort": 10
		}],
		"sort": 8
	}, {
		"Code": "520009",
		"Name": "安顺市",
		"level": [{
			"Code": "520009",
			"Name": "西秀区 ",
			"sort": 1
		}, {
			"Code": "520009",
			"Name": "平坝县 ",
			"sort": 2
		}, {
			"Code": "520009",
			"Name": "普定县 ",
			"sort": 3
		}, {
			"Code": "520009",
			"Name": "镇宁布依族苗族自治县 ",
			"sort": 4
		}, {
			"Code": "520009",
			"Name": "关岭布依族苗族自治县 ",
			"sort": 5
		}, {
			"Code": "520009",
			"Name": "紫云苗族布依族自治县 ",
			"sort": 6
		}],
		"sort": 9
	}, {
		"Code": "520010",
		"Name": "遵义市",
		"level": [{
			"Code": "520010",
			"Name": "红花岗区 ",
			"sort": 1
		}, {
			"Code": "520010",
			"Name": "赤水市 ",
			"sort": 2
		}, {
			"Code": "520010",
			"Name": "习水县 ",
			"sort": 3
		}, {
			"Code": "520010",
			"Name": "余庆县 ",
			"sort": 4
		}, {
			"Code": "520010",
			"Name": "湄潭县 ",
			"sort": 5
		}, {
			"Code": "520010",
			"Name": "凤冈县 ",
			"sort": 6
		}, {
			"Code": "520010",
			"Name": "务川仡佬族苗族自治县",
			"sort": 7
		}, {
			"Code": "520010",
			"Name": "道真仡佬族苗族自治县 ",
			"sort": 8
		}, {
			"Code": "520010",
			"Name": "正安县 ",
			"sort": 9
		}, {
			"Code": "520010",
			"Name": "绥阳县 ",
			"sort": 10
		}, {
			"Code": "520010",
			"Name": "桐梓县 ",
			"sort": 11
		}, {
			"Code": "520010",
			"Name": "遵义县 ",
			"sort": 12
		}, {
			"Code": "520010",
			"Name": "汇川区 ",
			"sort": 13
		}, {
			"Code": "520010",
			"Name": "仁怀市 ",
			"sort": 14
		}],
		"sort": 10
	}, {
		"Code": "520011",
		"Name": "六盘水市",
		"level": [{
			"Code": "520011",
			"Name": "钟山区 ",
			"sort": 1
		}, {
			"Code": "520011",
			"Name": "六枝特区 ",
			"sort": 2
		}, {
			"Code": "520011",
			"Name": "水城县 ",
			"sort": 3
		}, {
			"Code": "520011",
			"Name": "盘县 ",
			"sort": 4
		}],
		"sort": 11
	}, {
		"Code": "520012",
		"Name": "贵阳市",
		"level": [{
			"Code": "520012",
			"Name": "金阳国家高新技术产业开发区",
			"sort": 1
		}, {
			"Code": "520012",
			"Name": "金阳新区",
			"sort": 2
		}, {
			"Code": "520012",
			"Name": "清镇市 ",
			"sort": 3
		}, {
			"Code": "520012",
			"Name": "修文县 ",
			"sort": 4
		}, {
			"Code": "520012",
			"Name": "息烽县 ",
			"sort": 5
		}, {
			"Code": "520012",
			"Name": "开阳县 ",
			"sort": 6
		}, {
			"Code": "520012",
			"Name": "白云区 ",
			"sort": 7
		}, {
			"Code": "520012",
			"Name": "乌当区 ",
			"sort": 8
		}, {
			"Code": "520012",
			"Name": "花溪区  ",
			"sort": 9
		}, {
			"Code": "520012",
			"Name": "小河区",
			"sort": 10
		}, {
			"Code": "520012",
			"Name": "南明区",
			"sort": 11
		}, {
			"Code": "520012",
			"Name": "云岩区",
			"sort": 12
		}],
		"sort": 12
	}]
}, {
	"Code": "530000",
	"Name": "云南省",
	"level": [{
		"Code": "530001",
		"Name": "景洪市",
		"sort": 1,
		"level": [{
			"Code": "530001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "530002",
		"Name": "普洱市",
		"level": [{
			"Code": "530002",
			"Name": "思茅区 ",
			"sort": 1
		}, {
			"Code": "530002",
			"Name": "澜沧拉祜族自治县",
			"sort": 2
		}, {
			"Code": "530002",
			"Name": "孟连傣族拉祜族佤族自治县  ",
			"sort": 3
		}, {
			"Code": "530002",
			"Name": "江城哈尼族彝族自治县",
			"sort": 4
		}, {
			"Code": "530002",
			"Name": "镇沅彝族哈尼族拉祜族自治县  ",
			"sort": 5
		}, {
			"Code": "530002",
			"Name": "景谷傣族彝族自治县 ",
			"sort": 6
		}, {
			"Code": "530002",
			"Name": "景东彝族自治县 ",
			"sort": 7
		}, {
			"Code": "530002",
			"Name": "墨江哈尼族自治县 ",
			"sort": 8
		}, {
			"Code": "530002",
			"Name": "宁洱哈尼族彝族自治县 ",
			"sort": 9
		}, {
			"Code": "530002",
			"Name": "西盟佤族自治县",
			"sort": 10
		}],
		"sort": 2
	}, {
		"Code": "530003",
		"Name": "迪庆州",
		"level": [{
			"Code": "530003",
			"Name": "香格里拉县 ",
			"sort": 1
		}, {
			"Code": "530003",
			"Name": "德钦县 ",
			"sort": 2
		}, {
			"Code": "530003",
			"Name": "维西傈僳族自治县 ",
			"sort": 3
		}],
		"sort": 3
	}, {
		"Code": "530004",
		"Name": "怒江州",
		"level": [{
			"Code": "530004",
			"Name": "泸水县  ",
			"sort": 1
		}, {
			"Code": "530004",
			"Name": "福贡县 ",
			"sort": 2
		}, {
			"Code": "530004",
			"Name": "贡山独龙族怒族自治县 ",
			"sort": 3
		}, {
			"Code": "530004",
			"Name": "兰坪白族普米族自治县 ",
			"sort": 4
		}],
		"sort": 4
	}, {
		"Code": "530005",
		"Name": "德宏州",
		"level": [{
			"Code": "530005",
			"Name": "瑞丽市 ",
			"sort": 1
		}, {
			"Code": "530005",
			"Name": "潞西市 ",
			"sort": 2
		}, {
			"Code": "530005",
			"Name": "梁河县 ",
			"sort": 3
		}, {
			"Code": "530005",
			"Name": "盈江县 ",
			"sort": 4
		}, {
			"Code": "530005",
			"Name": "陇川县 ",
			"sort": 5
		}],
		"sort": 5
	}, {
		"Code": "530006",
		"Name": "大理州",
		"level": [{
			"Code": "530006",
			"Name": "大理市  ",
			"sort": 1
		}, {
			"Code": "530006",
			"Name": "剑川县 ",
			"sort": 2
		}, {
			"Code": "530006",
			"Name": "洱源县 ",
			"sort": 3
		}, {
			"Code": "530006",
			"Name": "云龙县 ",
			"sort": 4
		}, {
			"Code": "530006",
			"Name": "永平县 ",
			"sort": 5
		}, {
			"Code": "530006",
			"Name": "巍山彝族回族自治县 ",
			"sort": 6
		}, {
			"Code": "530006",
			"Name": "南涧彝族自治县 ",
			"sort": 7
		}, {
			"Code": "530006",
			"Name": "弥渡县 ",
			"sort": 8
		}, {
			"Code": "530006",
			"Name": "宾川县 ",
			"sort": 9
		}, {
			"Code": "530006",
			"Name": "祥云县 ",
			"sort": 10
		}, {
			"Code": "530006",
			"Name": "漾濞彝族自治县 ",
			"sort": 11
		}, {
			"Code": "530006",
			"Name": "鹤庆县 ",
			"sort": 12
		}],
		"sort": 6
	}, {
		"Code": "530007",
		"Name": "楚雄州",
		"level": [{
			"Code": "530007",
			"Name": "楚雄市 ",
			"sort": 1
		}, {
			"Code": "530007",
			"Name": "武定县 ",
			"sort": 2
		}, {
			"Code": "530007",
			"Name": "元谋县 ",
			"sort": 3
		}, {
			"Code": "530007",
			"Name": "永仁县 ",
			"sort": 4
		}, {
			"Code": "530007",
			"Name": "大姚县 ",
			"sort": 5
		}, {
			"Code": "530007",
			"Name": "姚安县 ",
			"sort": 6
		}, {
			"Code": "530007",
			"Name": "南华县 ",
			"sort": 7
		}, {
			"Code": "530007",
			"Name": "牟定县 ",
			"sort": 8
		}, {
			"Code": "530007",
			"Name": "双柏县  ",
			"sort": 9
		}, {
			"Code": "530007",
			"Name": "禄丰县 ",
			"sort": 10
		}],
		"sort": 7
	}, {
		"Code": "530008",
		"Name": "西双版纳州",
		"level": [{
			"Code": "530008",
			"Name": "景洪市 ",
			"sort": 1
		}, {
			"Code": "530008",
			"Name": "勐海县 ",
			"sort": 2
		}, {
			"Code": "530008",
			"Name": "勐腊县 ",
			"sort": 3
		}],
		"sort": 8
	}, {
		"Code": "530009",
		"Name": "红河州",
		"level": [{
			"Code": "530009",
			"Name": "个旧市  ",
			"sort": 1
		}, {
			"Code": "530009",
			"Name": "绿春县 ",
			"sort": 2
		}, {
			"Code": "530009",
			"Name": "金平苗族瑶族傣族自治县 ",
			"sort": 3
		}, {
			"Code": "530009",
			"Name": "红河县 ",
			"sort": 4
		}, {
			"Code": "530009",
			"Name": "元阳县 ",
			"sort": 5
		}, {
			"Code": "530009",
			"Name": "泸西县 ",
			"sort": 6
		}, {
			"Code": "530009",
			"Name": "弥勒县 ",
			"sort": 7
		}, {
			"Code": "530009",
			"Name": "石屏县 ",
			"sort": 8
		}, {
			"Code": "530009",
			"Name": "建水县 ",
			"sort": 9
		}, {
			"Code": "530009",
			"Name": "屏边苗族自治县 ",
			"sort": 10
		}, {
			"Code": "530009",
			"Name": "蒙自县 ",
			"sort": 11
		}, {
			"Code": "530009",
			"Name": "开远市 ",
			"sort": 12
		}, {
			"Code": "530009",
			"Name": "河口瑶族自治县 ",
			"sort": 13
		}],
		"sort": 9
	}, {
		"Code": "530010",
		"Name": "文山州",
		"level": [{
			"Code": "530010",
			"Name": "文山县  ",
			"sort": 1
		}, {
			"Code": "530010",
			"Name": "砚山县 ",
			"sort": 2
		}, {
			"Code": "530010",
			"Name": "西畴县 ",
			"sort": 3
		}, {
			"Code": "530010",
			"Name": "麻栗坡县 ",
			"sort": 4
		}, {
			"Code": "530010",
			"Name": "马关县 ",
			"sort": 5
		}, {
			"Code": "530010",
			"Name": "丘北县 ",
			"sort": 6
		}, {
			"Code": "530010",
			"Name": "广南县 ",
			"sort": 7
		}, {
			"Code": "530010",
			"Name": "富宁县 ",
			"sort": 8
		}],
		"sort": 10
	}, {
		"Code": "530011",
		"Name": "临沧市",
		"level": [{
			"Code": "530011",
			"Name": "临翔区 ",
			"sort": 1
		}, {
			"Code": "530011",
			"Name": "凤庆县  ",
			"sort": 2
		}, {
			"Code": "530011",
			"Name": "云县 ",
			"sort": 3
		}, {
			"Code": "530011",
			"Name": "永德县 ",
			"sort": 4
		}, {
			"Code": "530011",
			"Name": "镇康县 ",
			"sort": 5
		}, {
			"Code": "530011",
			"Name": "双江自治县 ",
			"sort": 6
		}, {
			"Code": "530011",
			"Name": "耿马傣族佤族自治县 ",
			"sort": 7
		}, {
			"Code": "530011",
			"Name": "沧源佤族自治县 ",
			"sort": 8
		}],
		"sort": 11
	}, {
		"Code": "530012",
		"Name": "丽江市",
		"level": [{
			"Code": "530012",
			"Name": "古城区  ",
			"sort": 1
		}, {
			"Code": "530012",
			"Name": "玉龙纳西族自治县 ",
			"sort": 2
		}, {
			"Code": "530012",
			"Name": "永胜县 ",
			"sort": 3
		}, {
			"Code": "530012",
			"Name": "华坪县 ",
			"sort": 4
		}, {
			"Code": "530012",
			"Name": "宁蒗彝族自治县",
			"sort": 5
		}],
		"sort": 12
	}, {
		"Code": "530013",
		"Name": "昭通市",
		"level": [{
			"Code": "530013",
			"Name": "昭阳区 ",
			"sort": 1
		}, {
			"Code": "530013",
			"Name": "威信县 ",
			"sort": 2
		}, {
			"Code": "530013",
			"Name": "彝良县 ",
			"sort": 3
		}, {
			"Code": "530013",
			"Name": "镇雄县 ",
			"sort": 4
		}, {
			"Code": "530013",
			"Name": "绥江县 ",
			"sort": 5
		}, {
			"Code": "530013",
			"Name": "永善县 ",
			"sort": 6
		}, {
			"Code": "530013",
			"Name": "大关县 ",
			"sort": 7
		}, {
			"Code": "530013",
			"Name": "盐津县 ",
			"sort": 8
		}, {
			"Code": "530013",
			"Name": "巧家县 ",
			"sort": 9
		}, {
			"Code": "530013",
			"Name": "鲁甸县 ",
			"sort": 10
		}, {
			"Code": "530013",
			"Name": "水富县 ",
			"sort": 11
		}],
		"sort": 13
	}, {
		"Code": "530014",
		"Name": "保山市",
		"level": [{
			"Code": "530014",
			"Name": "隆阳区 ",
			"sort": 1
		}, {
			"Code": "530014",
			"Name": "施甸县 ",
			"sort": 2
		}, {
			"Code": "530014",
			"Name": "腾冲县 ",
			"sort": 3
		}, {
			"Code": "530014",
			"Name": "龙陵县 ",
			"sort": 4
		}, {
			"Code": "530014",
			"Name": "昌宁县 ",
			"sort": 5
		}],
		"sort": 14
	}, {
		"Code": "530015",
		"Name": "玉溪市",
		"level": [{
			"Code": "530015",
			"Name": "江川县 ",
			"sort": 1
		}, {
			"Code": "530015",
			"Name": "红塔区  ",
			"sort": 2
		}, {
			"Code": "530015",
			"Name": "澄江县 ",
			"sort": 3
		}, {
			"Code": "530015",
			"Name": "通海县 ",
			"sort": 4
		}, {
			"Code": "530015",
			"Name": "华宁县 ",
			"sort": 5
		}, {
			"Code": "530015",
			"Name": "易门县 ",
			"sort": 6
		}, {
			"Code": "530015",
			"Name": "峨山彝族自治县  ",
			"sort": 7
		}, {
			"Code": "530015",
			"Name": "新平彝族傣族自治县 ",
			"sort": 8
		}, {
			"Code": "530015",
			"Name": "元江哈尼族彝族傣族自治县 ",
			"sort": 9
		}],
		"sort": 15
	}, {
		"Code": "530016",
		"Name": "曲靖市",
		"level": [{
			"Code": "530016",
			"Name": "麒麟区 ",
			"sort": 1
		}, {
			"Code": "530016",
			"Name": "马龙县 ",
			"sort": 2
		}, {
			"Code": "530016",
			"Name": "陆良县  ",
			"sort": 3
		}, {
			"Code": "530016",
			"Name": "师宗县 ",
			"sort": 4
		}, {
			"Code": "530016",
			"Name": "罗平县 ",
			"sort": 5
		}, {
			"Code": "530016",
			"Name": "富源县 ",
			"sort": 6
		}, {
			"Code": "530016",
			"Name": "会泽县 ",
			"sort": 7
		}, {
			"Code": "530016",
			"Name": "沾益县 ",
			"sort": 8
		}, {
			"Code": "530016",
			"Name": "宣威市 ",
			"sort": 9
		}],
		"sort": 16
	}, {
		"Code": "530017",
		"Name": "昆明市",
		"level": [{
			"Code": "530017",
			"Name": "安宁市 ",
			"sort": 1
		}, {
			"Code": "530017",
			"Name": "寻甸回族彝族自治县 ",
			"sort": 2
		}, {
			"Code": "530017",
			"Name": "禄劝彝族苗族自治县 ",
			"sort": 3
		}, {
			"Code": "530017",
			"Name": "嵩明县 ",
			"sort": 4
		}, {
			"Code": "530017",
			"Name": "石林彝族自治县 ",
			"sort": 5
		}, {
			"Code": "530017",
			"Name": "宜良县 ",
			"sort": 6
		}, {
			"Code": "530017",
			"Name": "富民县  ",
			"sort": 7
		}, {
			"Code": "530017",
			"Name": "晋宁县 ",
			"sort": 8
		}, {
			"Code": "530017",
			"Name": "呈贡县 ",
			"sort": 9
		}, {
			"Code": "530017",
			"Name": "东川区 ",
			"sort": 10
		}, {
			"Code": "530017",
			"Name": "昆明市高新技术开发区",
			"sort": 11
		}, {
			"Code": "530017",
			"Name": "昆明市经济技术开发区",
			"sort": 12
		}, {
			"Code": "530017",
			"Name": "西山区",
			"sort": 13
		}, {
			"Code": "530017",
			"Name": "官渡区",
			"sort": 14
		}, {
			"Code": "530017",
			"Name": "盘龙区",
			"sort": 15
		}, {
			"Code": "530017",
			"Name": "五华区",
			"sort": 16
		}],
		"sort": 17
	}]
}, {
	"Code": "540000",
	"Name": "西藏自治区",
	"level": [{
		"Code": "540001",
		"Name": "拉萨市",
		"level": [{
			"Code": "540001",
			"Name": "城关区 ",
			"sort": 1
		}, {
			"Code": "540001",
			"Name": "林周县 ",
			"sort": 2
		}, {
			"Code": "540001",
			"Name": "当雄县 ",
			"sort": 3
		}, {
			"Code": "540001",
			"Name": "尼木县 ",
			"sort": 4
		}, {
			"Code": "540001",
			"Name": "曲水县 ",
			"sort": 5
		}, {
			"Code": "540001",
			"Name": "堆龙德庆县 ",
			"sort": 6
		}, {
			"Code": "540001",
			"Name": "达孜县 ",
			"sort": 7
		}, {
			"Code": "540001",
			"Name": "墨竹工卡县 ",
			"sort": 8
		}],
		"sort": 1
	}, {
		"Code": "540002",
		"Name": "昌都地区",
		"level": [{
			"Code": "540002",
			"Name": "昌都县  ",
			"sort": 1
		}, {
			"Code": "540002",
			"Name": "洛隆县 ",
			"sort": 2
		}, {
			"Code": "540002",
			"Name": "芒康县 ",
			"sort": 3
		}, {
			"Code": "540002",
			"Name": "左贡县 ",
			"sort": 4
		}, {
			"Code": "540002",
			"Name": "八宿县 ",
			"sort": 5
		}, {
			"Code": "540002",
			"Name": "察雅县 ",
			"sort": 6
		}, {
			"Code": "540002",
			"Name": "丁青县 ",
			"sort": 7
		}, {
			"Code": "540002",
			"Name": "类乌齐县 ",
			"sort": 8
		}, {
			"Code": "540002",
			"Name": "贡觉县 ",
			"sort": 9
		}, {
			"Code": "540002",
			"Name": "江达县 ",
			"sort": 10
		}, {
			"Code": "540002",
			"Name": "边坝县 ",
			"sort": 11
		}],
		"sort": 2
	}, {
		"Code": "540003",
		"Name": "山南地区",
		"level": [{
			"Code": "540003",
			"Name": "乃东县 ",
			"sort": 1
		}, {
			"Code": "540003",
			"Name": "错那县 ",
			"sort": 2
		}, {
			"Code": "540003",
			"Name": "隆子县 ",
			"sort": 3
		}, {
			"Code": "540003",
			"Name": "加查县 ",
			"sort": 4
		}, {
			"Code": "540003",
			"Name": "洛扎县  ",
			"sort": 5
		}, {
			"Code": "540003",
			"Name": "措美县",
			"sort": 6
		}, {
			"Code": "540003",
			"Name": "曲松县 ",
			"sort": 7
		}, {
			"Code": "540003",
			"Name": "琼结县 ",
			"sort": 8
		}, {
			"Code": "540003",
			"Name": "桑日县 ",
			"sort": 9
		}, {
			"Code": "540003",
			"Name": "贡嘎县 ",
			"sort": 10
		}, {
			"Code": "540003",
			"Name": "扎囊县 ",
			"sort": 11
		}, {
			"Code": "540003",
			"Name": "浪卡子县 ",
			"sort": 12
		}],
		"sort": 3
	}, {
		"Code": "540004",
		"Name": "日喀则地区",
		"level": [{
			"Code": "540004",
			"Name": "日喀则市 ",
			"sort": 1
		}, {
			"Code": "540004",
			"Name": "萨嘎县 ",
			"sort": 2
		}, {
			"Code": "540004",
			"Name": "聂拉木县 ",
			"sort": 3
		}, {
			"Code": "540004",
			"Name": "吉隆县 ",
			"sort": 4
		}, {
			"Code": "540004",
			"Name": "亚东县 ",
			"sort": 5
		}, {
			"Code": "540004",
			"Name": "仲巴县 ",
			"sort": 6
		}, {
			"Code": "540004",
			"Name": "定结县 ",
			"sort": 7
		}, {
			"Code": "540004",
			"Name": "康马县 ",
			"sort": 8
		}, {
			"Code": "540004",
			"Name": "仁布县 ",
			"sort": 9
		}, {
			"Code": "540004",
			"Name": "白朗县 ",
			"sort": 10
		}, {
			"Code": "540004",
			"Name": "谢通门县 ",
			"sort": 11
		}, {
			"Code": "540004",
			"Name": "昂仁县  ",
			"sort": 12
		}, {
			"Code": "540004",
			"Name": "拉孜县 ",
			"sort": 13
		}, {
			"Code": "540004",
			"Name": "萨迦县 ",
			"sort": 14
		}, {
			"Code": "540004",
			"Name": "定日县 ",
			"sort": 15
		}, {
			"Code": "540004",
			"Name": "江孜县 ",
			"sort": 16
		}, {
			"Code": "540004",
			"Name": "南木林县 ",
			"sort": 17
		}, {
			"Code": "540004",
			"Name": "岗巴县 ",
			"sort": 18
		}],
		"sort": 4
	}, {
		"Code": "540005",
		"Name": "那曲地区",
		"level": [{
			"Code": "540005",
			"Name": "拉萨市 ",
			"sort": 1
		}, {
			"Code": "540005",
			"Name": "昌都地区 ",
			"sort": 2
		}, {
			"Code": "540005",
			"Name": "山南地区  ",
			"sort": 3
		}, {
			"Code": "540005",
			"Name": "日喀则地区 ",
			"sort": 4
		}, {
			"Code": "540005",
			"Name": "那曲地区 ",
			"sort": 5
		}, {
			"Code": "540005",
			"Name": "阿里地区 ",
			"sort": 6
		}, {
			"Code": "540005",
			"Name": "林芝地区 ",
			"sort": 7
		}],
		"sort": 5
	}, {
		"Code": "540006",
		"Name": "阿里地区",
		"level": [{
			"Code": "540006",
			"Name": "普兰县 ",
			"sort": 1
		}, {
			"Code": "540006",
			"Name": "札达县 ",
			"sort": 2
		}, {
			"Code": "540006",
			"Name": "噶尔县 ",
			"sort": 3
		}, {
			"Code": "540006",
			"Name": "日土县 ",
			"sort": 4
		}, {
			"Code": "540006",
			"Name": "革吉县 ",
			"sort": 5
		}, {
			"Code": "540006",
			"Name": "改则县 ",
			"sort": 6
		}, {
			"Code": "540006",
			"Name": "措勤县 ",
			"sort": 7
		}],
		"sort": 6
	}, {
		"Code": "540007",
		"Name": "林芝地区",
		"level": [{
			"Code": "540007",
			"Name": "林芝县 ",
			"sort": 1
		}, {
			"Code": "540007",
			"Name": "工布江达县 ",
			"sort": 2
		}, {
			"Code": "540007",
			"Name": "米林县 ",
			"sort": 3
		}, {
			"Code": "540007",
			"Name": "墨脱县 ",
			"sort": 4
		}, {
			"Code": "540007",
			"Name": "波密县 ",
			"sort": 5
		}, {
			"Code": "540007",
			"Name": "察隅县 ",
			"sort": 6
		}, {
			"Code": "540007",
			"Name": "朗县 ",
			"sort": 7
		}],
		"sort": 7
	}]
}, {
	"Code": "610000",
	"Name": "陕西省",
	"level": [{
		"Code": "610001",
		"Name": "西安市",
		"level": [{
			"Code": "610001",
			"Name": "户县 ",
			"sort": 1
		}, {
			"Code": "610001",
			"Name": "周至县 ",
			"sort": 2
		}, {
			"Code": "610001",
			"Name": "蓝田县 ",
			"sort": 3
		}, {
			"Code": "610001",
			"Name": "临潼区 ",
			"sort": 4
		}, {
			"Code": "610001",
			"Name": "阎良区",
			"sort": 5
		}, {
			"Code": "610001",
			"Name": "洪庆镇",
			"sort": 6
		}, {
			"Code": "610001",
			"Name": "田王镇",
			"sort": 7
		}, {
			"Code": "610001",
			"Name": "三桥镇",
			"sort": 8
		}, {
			"Code": "610001",
			"Name": "高陵县",
			"level": [{
				"Code": "1306",
				"Name": "县城中心"
			}, {
				"Code": "1307",
				"Name": "临潼区"
			}],
			"sort": 9
		}, {
			"Code": "610001",
			"Name": "长安区",
			"sort": 10
		}, {
			"Code": "610001",
			"Name": "西安经济技术开发区",
			"sort": 11
		}, {
			"Code": "610001",
			"Name": "雁塔区",
			"sort": 12
		}, {
			"Code": "610001",
			"Name": "未央区",
			"sort": 13
		}, {
			"Code": "610001",
			"Name": "灞桥区",
			"sort": 14
		}, {
			"Code": "610001",
			"Name": "高新技术产业开发区",
			"sort": 15
		}, {
			"Code": "610001",
			"Name": "莲湖区",
			"sort": 16
		}, {
			"Code": "610001",
			"Name": "碑林区",
			"sort": 17
		}, {
			"Code": "610001",
			"Name": "新城区",
			"sort": 18
		}],
		"sort": 1
	}, {
		"Code": "610002",
		"Name": "安康市",
		"level": [{
			"Code": "610002",
			"Name": "汉滨区 ",
			"sort": 1
		}, {
			"Code": "610002",
			"Name": "旬阳县 ",
			"sort": 2
		}, {
			"Code": "610002",
			"Name": "镇坪县 ",
			"sort": 3
		}, {
			"Code": "610002",
			"Name": "平利县 ",
			"sort": 4
		}, {
			"Code": "610002",
			"Name": "岚皋县 ",
			"sort": 5
		}, {
			"Code": "610002",
			"Name": "紫阳县 ",
			"sort": 6
		}, {
			"Code": "610002",
			"Name": "宁陕县 ",
			"sort": 7
		}, {
			"Code": "610002",
			"Name": "石泉县 ",
			"sort": 8
		}, {
			"Code": "610002",
			"Name": "汉阴县 ",
			"sort": 9
		}, {
			"Code": "610002",
			"Name": "白河县 ",
			"sort": 10
		}],
		"sort": 2
	}, {
		"Code": "610003",
		"Name": "榆林市",
		"level": [{
			"Code": "610003",
			"Name": "榆阳区  ",
			"sort": 1
		}, {
			"Code": "610003",
			"Name": "清涧县 ",
			"sort": 2
		}, {
			"Code": "610003",
			"Name": "吴堡县 ",
			"sort": 3
		}, {
			"Code": "610003",
			"Name": "佳县 ",
			"sort": 4
		}, {
			"Code": "610003",
			"Name": "米脂县",
			"sort": 5
		}, {
			"Code": "610003",
			"Name": "绥德县 ",
			"sort": 6
		}, {
			"Code": "610003",
			"Name": "定边县 ",
			"sort": 7
		}, {
			"Code": "610003",
			"Name": "靖边县 ",
			"sort": 8
		}, {
			"Code": "610003",
			"Name": "横山县 ",
			"sort": 9
		}, {
			"Code": "610003",
			"Name": "府谷县 ",
			"sort": 10
		}, {
			"Code": "610003",
			"Name": "神木县 ",
			"sort": 11
		}, {
			"Code": "610003",
			"Name": "子洲县 ",
			"sort": 12
		}],
		"sort": 3
	}, {
		"Code": "610004",
		"Name": "汉中市",
		"level": [{
			"Code": "610004",
			"Name": "汉台区 ",
			"sort": 1
		}, {
			"Code": "610004",
			"Name": "留坝县 ",
			"sort": 2
		}, {
			"Code": "610004",
			"Name": "镇巴县 ",
			"sort": 3
		}, {
			"Code": "610004",
			"Name": "略阳县 ",
			"sort": 4
		}, {
			"Code": "610004",
			"Name": "宁强县 ",
			"sort": 5
		}, {
			"Code": "610004",
			"Name": "勉县 ",
			"sort": 6
		}, {
			"Code": "610004",
			"Name": "西乡县 ",
			"sort": 7
		}, {
			"Code": "610004",
			"Name": "洋县 ",
			"sort": 8
		}, {
			"Code": "610004",
			"Name": "城固县 ",
			"sort": 9
		}, {
			"Code": "610004",
			"Name": "南郑县 ",
			"sort": 10
		}, {
			"Code": "610004",
			"Name": "佛坪县 ",
			"sort": 11
		}],
		"sort": 4
	}, {
		"Code": "610005",
		"Name": "延安市",
		"level": [{
			"Code": "610005",
			"Name": "宝塔区 ",
			"sort": 1
		}, {
			"Code": "610005",
			"Name": "黄龙县 ",
			"sort": 2
		}, {
			"Code": "610005",
			"Name": "宜川县 ",
			"sort": 3
		}, {
			"Code": "610005",
			"Name": "洛川县 ",
			"sort": 4
		}, {
			"Code": "610005",
			"Name": "富县 ",
			"sort": 5
		}, {
			"Code": "610005",
			"Name": "甘泉县  ",
			"sort": 6
		}, {
			"Code": "610005",
			"Name": "吴起县",
			"sort": 7
		}, {
			"Code": "610005",
			"Name": "志丹县 ",
			"sort": 8
		}, {
			"Code": "610005",
			"Name": "安塞县 ",
			"sort": 9
		}, {
			"Code": "610005",
			"Name": "子长县 ",
			"sort": 10
		}, {
			"Code": "610005",
			"Name": "延川县 ",
			"sort": 11
		}, {
			"Code": "610005",
			"Name": "延长县 ",
			"sort": 12
		}, {
			"Code": "610005",
			"Name": "黄陵县 ",
			"sort": 13
		}],
		"sort": 5
	}, {
		"Code": "610006",
		"Name": "渭南市",
		"level": [{
			"Code": "610006",
			"Name": "临渭区 ",
			"sort": 1
		}, {
			"Code": "610006",
			"Name": "韩城市 ",
			"sort": 2
		}, {
			"Code": "610006",
			"Name": "富平县 ",
			"sort": 3
		}, {
			"Code": "610006",
			"Name": "白水县 ",
			"sort": 4
		}, {
			"Code": "610006",
			"Name": "蒲城县 ",
			"sort": 5
		}, {
			"Code": "610006",
			"Name": "澄城县 ",
			"sort": 6
		}, {
			"Code": "610006",
			"Name": "合阳县 ",
			"sort": 7
		}, {
			"Code": "610006",
			"Name": "大荔县 ",
			"sort": 8
		}, {
			"Code": "610006",
			"Name": "潼关县 ",
			"sort": 9
		}, {
			"Code": "610006",
			"Name": "华县 ",
			"sort": 10
		}, {
			"Code": "610006",
			"Name": "华阴市 ",
			"sort": 11
		}],
		"sort": 6
	}, {
		"Code": "610007",
		"Name": "咸阳市",
		"level": [{
			"Code": "610007",
			"Name": "兴平市 ",
			"sort": 1
		}, {
			"Code": "610007",
			"Name": "武功县 ",
			"sort": 2
		}, {
			"Code": "610007",
			"Name": "淳化县 ",
			"sort": 3
		}, {
			"Code": "610007",
			"Name": "旬邑县 ",
			"sort": 4
		}, {
			"Code": "610007",
			"Name": "长武县 ",
			"sort": 5
		}, {
			"Code": "610007",
			"Name": "彬县 ",
			"sort": 6
		}, {
			"Code": "610007",
			"Name": "永寿县  ",
			"sort": 7
		}, {
			"Code": "610007",
			"Name": "礼泉县 ",
			"sort": 8
		}, {
			"Code": "610007",
			"Name": "乾县 ",
			"sort": 9
		}, {
			"Code": "610007",
			"Name": "泾阳县 ",
			"sort": 10
		}, {
			"Code": "610007",
			"Name": "三原县 ",
			"sort": 11
		}, {
			"Code": "610007",
			"Name": "杨凌区 ",
			"sort": 12
		}, {
			"Code": "610007",
			"Name": "秦都区",
			"sort": 13
		}, {
			"Code": "610007",
			"Name": "渭城区",
			"sort": 14
		}],
		"sort": 7
	}, {
		"Code": "610008",
		"Name": "宝鸡市",
		"level": [{
			"Code": "610008",
			"Name": "太白县 ",
			"sort": 1
		}, {
			"Code": "610008",
			"Name": "凤县 ",
			"sort": 2
		}, {
			"Code": "610008",
			"Name": "扶风县 ",
			"sort": 3
		}, {
			"Code": "610008",
			"Name": "眉县 ",
			"sort": 4
		}, {
			"Code": "610008",
			"Name": "凤翔县 ",
			"sort": 5
		}, {
			"Code": "610008",
			"Name": "千阳县 ",
			"sort": 6
		}, {
			"Code": "610008",
			"Name": "麟游县 ",
			"sort": 7
		}, {
			"Code": "610008",
			"Name": "陇县 ",
			"sort": 8
		}, {
			"Code": "610008",
			"Name": "七一新区",
			"sort": 9
		}, {
			"Code": "610008",
			"Name": "岐山县",
			"level": [{
				"Code": "1308",
				"Name": "蔡家坡镇"
			}],
			"sort": 10
		}, {
			"Code": "610008",
			"Name": "西高新技术产业开发展区",
			"sort": 11
		}, {
			"Code": "610008",
			"Name": "陈仓区",
			"sort": 12
		}, {
			"Code": "610008",
			"Name": "金台区",
			"sort": 13
		}, {
			"Code": "610008",
			"Name": "渭滨区",
			"sort": 14
		}],
		"sort": 8
	}, {
		"Code": "610009",
		"Name": "铜川市",
		"level": [{
			"Code": "610009",
			"Name": "王益区 ",
			"sort": 1
		}, {
			"Code": "610009",
			"Name": "印台区 ",
			"sort": 2
		}, {
			"Code": "610009",
			"Name": "耀州区 ",
			"sort": 3
		}, {
			"Code": "610009",
			"Name": "宜君县 ",
			"sort": 4
		}],
		"sort": 9
	}, {
		"Code": "610010",
		"Name": "商洛市",
		"level": [{
			"Code": "610010",
			"Name": "商州区 ",
			"sort": 1
		}, {
			"Code": "610010",
			"Name": "洛南县 ",
			"sort": 2
		}, {
			"Code": "610010",
			"Name": "丹凤县 ",
			"sort": 3
		}, {
			"Code": "610010",
			"Name": "商南县 ",
			"sort": 4
		}, {
			"Code": "610010",
			"Name": "山阳县 ",
			"sort": 5
		}, {
			"Code": "610010",
			"Name": "镇安县 ",
			"sort": 6
		}, {
			"Code": "610010",
			"Name": "柞水县 ",
			"sort": 7
		}],
		"sort": 10
	}]
}, {
	"Code": "620000",
	"Name": "甘肃省",
	"level": [{
		"Code": "620001",
		"Name": "兰州市",
		"level": [{
			"Code": "620001",
			"Name": "红古区 ",
			"sort": 1
		}, {
			"Code": "620001",
			"Name": "永登县 ",
			"sort": 2
		}, {
			"Code": "620001",
			"Name": "皋兰县 ",
			"sort": 3
		}, {
			"Code": "620001",
			"Name": "榆中县 ",
			"sort": 4
		}, {
			"Code": "620001",
			"Name": "城关区",
			"sort": 5
		}, {
			"Code": "620001",
			"Name": "七里河区",
			"sort": 6
		}, {
			"Code": "620001",
			"Name": "安宁区",
			"sort": 7
		}, {
			"Code": "620001",
			"Name": "西固区",
			"sort": 8
		}],
		"sort": 1
	}, {
		"Code": "620002",
		"Name": "临夏自治州",
		"level": [{
			"Code": "620002",
			"Name": "临夏县 ",
			"sort": 1
		}, {
			"Code": "620002",
			"Name": "康乐县 ",
			"sort": 2
		}, {
			"Code": "620002",
			"Name": "永靖县  ",
			"sort": 3
		}, {
			"Code": "620002",
			"Name": "广河县 ",
			"sort": 4
		}, {
			"Code": "620002",
			"Name": "和政县 ",
			"sort": 5
		}, {
			"Code": "620002",
			"Name": "东乡族自治县",
			"sort": 6
		}, {
			"Code": "620002",
			"Name": "积石山自治县",
			"sort": 7
		}],
		"sort": 2
	}, {
		"Code": "620003",
		"Name": "陇南市",
		"level": [{
			"Code": "620003",
			"Name": "武都区  ",
			"sort": 1
		}, {
			"Code": "620003",
			"Name": "成县 ",
			"sort": 2
		}, {
			"Code": "620003",
			"Name": "文县 ",
			"sort": 3
		}, {
			"Code": "620003",
			"Name": "宕昌县 ",
			"sort": 4
		}, {
			"Code": "620003",
			"Name": "康县 ",
			"sort": 5
		}, {
			"Code": "620003",
			"Name": "西和县 ",
			"sort": 6
		}, {
			"Code": "620003",
			"Name": "礼县 ",
			"sort": 7
		}, {
			"Code": "620003",
			"Name": "徽县 ",
			"sort": 8
		}, {
			"Code": "620003",
			"Name": "两当县 ",
			"sort": 9
		}],
		"sort": 3
	}, {
		"Code": "620004",
		"Name": "定西市",
		"level": [{
			"Code": "620004",
			"Name": "安定区  ",
			"sort": 1
		}, {
			"Code": "620004",
			"Name": "通渭县 ",
			"sort": 2
		}, {
			"Code": "620004",
			"Name": "陇西县 ",
			"sort": 3
		}, {
			"Code": "620004",
			"Name": "渭源县 ",
			"sort": 4
		}, {
			"Code": "620004",
			"Name": "临洮县 ",
			"sort": 5
		}, {
			"Code": "620004",
			"Name": "漳县 ",
			"sort": 6
		}, {
			"Code": "620004",
			"Name": "岷县 ",
			"sort": 7
		}],
		"sort": 4
	}, {
		"Code": "620005",
		"Name": "庆阳市",
		"level": [{
			"Code": "620005",
			"Name": "西峰区 ",
			"sort": 1
		}, {
			"Code": "620005",
			"Name": "庆城县 ",
			"sort": 2
		}, {
			"Code": "620005",
			"Name": "环县 ",
			"sort": 3
		}, {
			"Code": "620005",
			"Name": "华池县 ",
			"sort": 4
		}, {
			"Code": "620005",
			"Name": "合水县 ",
			"sort": 5
		}, {
			"Code": "620005",
			"Name": "正宁县 ",
			"sort": 6
		}, {
			"Code": "620005",
			"Name": "宁县 ",
			"sort": 7
		}, {
			"Code": "620005",
			"Name": "镇原县 ",
			"sort": 8
		}],
		"sort": 5
	}, {
		"Code": "620006",
		"Name": "酒泉市",
		"level": [{
			"Code": "620006",
			"Name": "肃州区  ",
			"sort": 1
		}, {
			"Code": "620006",
			"Name": "金塔县 ",
			"sort": 2
		}, {
			"Code": "620006",
			"Name": "瓜州县 ",
			"sort": 3
		}, {
			"Code": "620006",
			"Name": "肃北蒙古族自治县 ",
			"sort": 4
		}, {
			"Code": "620006",
			"Name": "阿克塞哈萨克族自治县 ",
			"sort": 5
		}, {
			"Code": "620006",
			"Name": "玉门市 ",
			"sort": 6
		}, {
			"Code": "620006",
			"Name": "敦煌市 ",
			"sort": 7
		}],
		"sort": 6
	}, {
		"Code": "620007",
		"Name": "平凉市",
		"level": [{
			"Code": "620007",
			"Name": "崆峒区 ",
			"sort": 1
		}, {
			"Code": "620007",
			"Name": "泾川县 ",
			"sort": 2
		}, {
			"Code": "620007",
			"Name": "灵台县 ",
			"sort": 3
		}, {
			"Code": "620007",
			"Name": "崇信县 ",
			"sort": 4
		}, {
			"Code": "620007",
			"Name": "华亭县 ",
			"sort": 5
		}, {
			"Code": "620007",
			"Name": "庄浪县 ",
			"sort": 6
		}, {
			"Code": "620007",
			"Name": "静宁县 ",
			"sort": 7
		}],
		"sort": 7
	}, {
		"Code": "620008",
		"Name": "张掖市",
		"level": [{
			"Code": "620008",
			"Name": "甘州区 ",
			"sort": 1
		}, {
			"Code": "620008",
			"Name": "肃南裕固族自治县 ",
			"sort": 2
		}, {
			"Code": "620008",
			"Name": "民乐县 ",
			"sort": 3
		}, {
			"Code": "620008",
			"Name": "临泽县  ",
			"sort": 4
		}, {
			"Code": "620008",
			"Name": "高台县 ",
			"sort": 5
		}, {
			"Code": "620008",
			"Name": "山丹县 ",
			"sort": 6
		}],
		"sort": 8
	}, {
		"Code": "620009",
		"Name": "武威市",
		"level": [{
			"Code": "620009",
			"Name": "凉州区 ",
			"sort": 1
		}, {
			"Code": "620009",
			"Name": "民勤县 ",
			"sort": 2
		}, {
			"Code": "620009",
			"Name": "古浪县 ",
			"sort": 3
		}, {
			"Code": "620009",
			"Name": "天祝藏族自治县 ",
			"sort": 4
		}],
		"sort": 9
	}, {
		"Code": "620010",
		"Name": "天水市",
		"level": [{
			"Code": "620010",
			"Name": "秦州区 ",
			"sort": 1
		}, {
			"Code": "620010",
			"Name": "麦积区 ",
			"sort": 2
		}, {
			"Code": "620010",
			"Name": "清水县 ",
			"sort": 3
		}, {
			"Code": "620010",
			"Name": "秦安县 ",
			"sort": 4
		}, {
			"Code": "620010",
			"Name": "甘谷县 ",
			"sort": 5
		}, {
			"Code": "620010",
			"Name": "武山县 ",
			"sort": 6
		}, {
			"Code": "620010",
			"Name": "张家川回族自治县 ",
			"sort": 7
		}],
		"sort": 10
	}, {
		"Code": "620011",
		"Name": "白银市",
		"level": [{
			"Code": "620011",
			"Name": "白银区 ",
			"sort": 1
		}, {
			"Code": "620011",
			"Name": "平川区 ",
			"sort": 2
		}, {
			"Code": "620011",
			"Name": "靖远县 ",
			"sort": 3
		}, {
			"Code": "620011",
			"Name": "会宁县 ",
			"sort": 4
		}, {
			"Code": "620011",
			"Name": "景泰县",
			"sort": 5
		}],
		"sort": 11
	}, {
		"Code": "620012",
		"Name": "金昌市",
		"level": [{
			"Code": "620012",
			"Name": "金川区 ",
			"sort": 1
		}, {
			"Code": "620012",
			"Name": "永昌县 ",
			"sort": 2
		}],
		"sort": 12
	}, {
		"Code": "620013",
		"Name": "嘉峪关市",
		"sort": 13,
		"level": [{
			"Code": "620013",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "620014",
		"Name": "甘南自治州",
		"level": [{
			"Code": "620014",
			"Name": "合作市 ",
			"sort": 1
		}, {
			"Code": "620014",
			"Name": "临潭县  ",
			"sort": 2
		}, {
			"Code": "620014",
			"Name": "卓尼县 ",
			"sort": 3
		}, {
			"Code": "620014",
			"Name": "舟曲县 ",
			"sort": 4
		}, {
			"Code": "620014",
			"Name": "迭部县 ",
			"sort": 5
		}, {
			"Code": "620014",
			"Name": "玛曲县 ",
			"sort": 6
		}, {
			"Code": "620014",
			"Name": "碌曲县 ",
			"sort": 7
		}, {
			"Code": "620014",
			"Name": "夏河县 ",
			"sort": 8
		}],
		"sort": 14
	}]
}, {
	"Code": "630000",
	"Name": "青海省",
	"level": [{
		"Code": "630001",
		"Name": "西宁市",
		"level": [{
			"Code": "630001",
			"Name": "城东区 ",
			"sort": 1
		}, {
			"Code": "630001",
			"Name": "城中区 ",
			"sort": 2
		}, {
			"Code": "630001",
			"Name": "城西区 ",
			"sort": 3
		}, {
			"Code": "630001",
			"Name": "城北区 ",
			"sort": 4
		}, {
			"Code": "630001",
			"Name": "大通回族土族自治县 ",
			"sort": 5
		}, {
			"Code": "630001",
			"Name": "湟中县 ",
			"sort": 6
		}, {
			"Code": "630001",
			"Name": "湟源县 ",
			"sort": 7
		}],
		"sort": 1
	}, {
		"Code": "630002",
		"Name": "海东地区",
		"level": [{
			"Code": "630002",
			"Name": "平安县  ",
			"sort": 1
		}, {
			"Code": "630002",
			"Name": "民和回族土族自治县 ",
			"sort": 2
		}, {
			"Code": "630002",
			"Name": "乐都县 ",
			"sort": 3
		}, {
			"Code": "630002",
			"Name": "互助土族自治县 ",
			"sort": 4
		}, {
			"Code": "630002",
			"Name": "化隆回族自治县 ",
			"sort": 5
		}, {
			"Code": "630002",
			"Name": "循化撒拉族自治县 ",
			"sort": 6
		}],
		"sort": 2
	}, {
		"Code": "630003",
		"Name": "海北自治州",
		"level": [{
			"Code": "630003",
			"Name": "门源回族自治县 ",
			"sort": 1
		}, {
			"Code": "630003",
			"Name": "祁连县 ",
			"sort": 2
		}, {
			"Code": "630003",
			"Name": "海晏县 ",
			"sort": 3
		}, {
			"Code": "630003",
			"Name": "刚察县 ",
			"sort": 4
		}],
		"sort": 3
	}, {
		"Code": "630004",
		"Name": "黄南自治州",
		"level": [{
			"Code": "630004",
			"Name": "同仁县 ",
			"sort": 1
		}, {
			"Code": "630004",
			"Name": "尖扎县 ",
			"sort": 2
		}, {
			"Code": "630004",
			"Name": "泽库县 ",
			"sort": 3
		}, {
			"Code": "630004",
			"Name": "河南蒙古族自治县 ",
			"sort": 4
		}],
		"sort": 4
	}, {
		"Code": "630005",
		"Name": "海南自治州",
		"level": [{
			"Code": "630005",
			"Name": "同仁县 ",
			"sort": 1
		}, {
			"Code": "630005",
			"Name": "尖扎县 ",
			"sort": 2
		}, {
			"Code": "630005",
			"Name": "泽库县 ",
			"sort": 3
		}, {
			"Code": "630005",
			"Name": "河南蒙古族自治县 ",
			"sort": 4
		}, {
			"Code": "630005",
			"Name": "共和县",
			"sort": 5
		}, {
			"Code": "630005",
			"Name": "贵德县",
			"sort": 6
		}, {
			"Code": "630005",
			"Name": "贵南县",
			"sort": 7
		}, {
			"Code": "630005",
			"Name": "同德县",
			"sort": 8
		}, {
			"Code": "630005",
			"Name": "兴海县",
			"sort": 9
		}],
		"sort": 5
	}, {
		"Code": "630006",
		"Name": "果洛自治州",
		"level": [{
			"Code": "630006",
			"Name": "玛沁县 ",
			"sort": 1
		}, {
			"Code": "630006",
			"Name": "班玛县 ",
			"sort": 2
		}, {
			"Code": "630006",
			"Name": "甘德县 ",
			"sort": 3
		}, {
			"Code": "630006",
			"Name": "达日县 ",
			"sort": 4
		}, {
			"Code": "630006",
			"Name": "久治县 ",
			"sort": 5
		}, {
			"Code": "630006",
			"Name": "玛多县 ",
			"sort": 6
		}],
		"sort": 6
	}, {
		"Code": "630007",
		"Name": "玉树自治州",
		"level": [{
			"Code": "630007",
			"Name": "玉树县 ",
			"sort": 1
		}, {
			"Code": "630007",
			"Name": "杂多县  ",
			"sort": 2
		}, {
			"Code": "630007",
			"Name": "称多县 ",
			"sort": 3
		}, {
			"Code": "630007",
			"Name": "治多县 ",
			"sort": 4
		}, {
			"Code": "630007",
			"Name": "囊谦县 ",
			"sort": 5
		}, {
			"Code": "630007",
			"Name": "曲麻莱县 ",
			"sort": 6
		}],
		"sort": 7
	}, {
		"Code": "630008",
		"Name": "海西自治州",
		"level": [{
			"Code": "630008",
			"Name": "海西蒙古族藏族自治州直辖 ",
			"sort": 1
		}, {
			"Code": "630008",
			"Name": "格尔木市 ",
			"sort": 2
		}, {
			"Code": "630008",
			"Name": "德令哈市 ",
			"sort": 3
		}, {
			"Code": "630008",
			"Name": "乌兰县 ",
			"sort": 4
		}, {
			"Code": "630008",
			"Name": "都兰县 ",
			"sort": 5
		}, {
			"Code": "630008",
			"Name": "天峻县 ",
			"sort": 6
		}],
		"sort": 8
	}]
}, {
	"Code": "640000",
	"Name": "宁夏回族自治区",
	"level": [{
		"Code": "640001",
		"Name": "中卫市",
		"level": [{
			"Code": "640001",
			"Name": "沙坡头区 ",
			"sort": 1
		}, {
			"Code": "640001",
			"Name": "中宁县 ",
			"sort": 2
		}, {
			"Code": "640001",
			"Name": "海原县 ",
			"sort": 3
		}],
		"sort": 1
	}, {
		"Code": "640002",
		"Name": "银川市",
		"level": [{
			"Code": "640002",
			"Name": "兴庆区 ",
			"sort": 1
		}, {
			"Code": "640002",
			"Name": "西夏区 ",
			"sort": 2
		}, {
			"Code": "640002",
			"Name": "金凤区 ",
			"sort": 3
		}, {
			"Code": "640002",
			"Name": "永宁县 ",
			"sort": 4
		}, {
			"Code": "640002",
			"Name": "贺兰县 ",
			"sort": 5
		}, {
			"Code": "640002",
			"Name": "灵武市 ",
			"sort": 6
		}],
		"sort": 2
	}, {
		"Code": "640003",
		"Name": "石嘴山市",
		"level": [{
			"Code": "640003",
			"Name": "大武口区 ",
			"sort": 1
		}, {
			"Code": "640003",
			"Name": "惠农区 ",
			"sort": 2
		}, {
			"Code": "640003",
			"Name": "平罗县 ",
			"sort": 3
		}],
		"sort": 3
	}, {
		"Code": "640004",
		"Name": "吴忠市",
		"level": [{
			"Code": "640004",
			"Name": "利通区 ",
			"sort": 1
		}, {
			"Code": "640004",
			"Name": "盐池县 ",
			"sort": 2
		}, {
			"Code": "640004",
			"Name": "同心县 ",
			"sort": 3
		}, {
			"Code": "640004",
			"Name": "青铜峡市 ",
			"sort": 4
		}, {
			"Code": "640004",
			"Name": "红寺堡区",
			"sort": 5
		}],
		"sort": 4
	}, {
		"Code": "640005",
		"Name": "固原市",
		"level": [{
			"Code": "640005",
			"Name": "原州区 ",
			"sort": 1
		}, {
			"Code": "640005",
			"Name": "西吉县 ",
			"sort": 2
		}, {
			"Code": "640005",
			"Name": "隆德县 ",
			"sort": 3
		}, {
			"Code": "640005",
			"Name": "泾源县 ",
			"sort": 4
		}, {
			"Code": "640005",
			"Name": "彭阳县 ",
			"sort": 5
		}],
		"sort": 5
	}]
}, {
	"Code": "650000",
	"Name": "新疆维吾尔自治区 ",
	"level": [{
		"Code": "650001",
		"Name": "伊宁市",
		"level": [{
			"Code": "650001",
			"Name": "霍城县",
			"level": [{
				"Code": "5996",
				"Name": "霍尔果斯口岸"
			}],
			"sort": 1
		}],
		"sort": 1
	}, {
		"Code": "650002",
		"Name": "石河子市 ",
		"sort": 2,
		"level": [{
			"Code": "650002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "650003",
		"Name": "阿拉尔市",
		"sort": 3,
		"level": [{
			"Code": "650003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "650004",
		"Name": "图木舒克市",
		"sort": 4,
		"level": [{
			"Code": "650004",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "650005",
		"Name": "五家渠市",
		"sort": 5,
		"level": [{
			"Code": "650005",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "650006",
		"Name": "库尔勒市",
		"sort": 6,
		"level": [{
			"Code": "650006",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "650007",
		"Name": "阿勒泰地区",
		"level": [{
			"Code": "650007",
			"Name": "阿勒泰市 ",
			"sort": 1
		}, {
			"Code": "650007",
			"Name": "布尔津县 ",
			"sort": 2
		}, {
			"Code": "650007",
			"Name": "富蕴县 ",
			"sort": 3
		}, {
			"Code": "650007",
			"Name": "福海县 ",
			"sort": 4
		}, {
			"Code": "650007",
			"Name": "哈巴河县 ",
			"sort": 5
		}, {
			"Code": "650007",
			"Name": "青河县 ",
			"sort": 6
		}, {
			"Code": "650007",
			"Name": "吉木乃县 ",
			"sort": 7
		}],
		"sort": 7
	}, {
		"Code": "650008",
		"Name": "塔城地区",
		"level": [{
			"Code": "650008",
			"Name": "塔城市 ",
			"sort": 1
		}, {
			"Code": "650008",
			"Name": "乌苏市 ",
			"sort": 2
		}, {
			"Code": "650008",
			"Name": "额敏县  ",
			"sort": 3
		}, {
			"Code": "650008",
			"Name": "沙湾县 ",
			"sort": 4
		}, {
			"Code": "650008",
			"Name": "托里县 ",
			"sort": 5
		}, {
			"Code": "650008",
			"Name": "裕民县 ",
			"sort": 6
		}, {
			"Code": "650008",
			"Name": "和布克赛尔蒙古自治县 ",
			"sort": 7
		}],
		"sort": 8
	}, {
		"Code": "650009",
		"Name": "伊犁哈萨克自治州",
		"level": [{
			"Code": "650009",
			"Name": "奎屯市  ",
			"sort": 1
		}, {
			"Code": "650009",
			"Name": "伊宁县 ",
			"sort": 2
		}, {
			"Code": "650009",
			"Name": "察布查尔锡伯自治县 ",
			"sort": 3
		}, {
			"Code": "650009",
			"Name": "霍城县 ",
			"sort": 4
		}, {
			"Code": "650009",
			"Name": "巩留县 ",
			"sort": 5
		}, {
			"Code": "650009",
			"Name": "新源县 ",
			"sort": 6
		}, {
			"Code": "650009",
			"Name": "昭苏县 ",
			"sort": 7
		}, {
			"Code": "650009",
			"Name": "特克斯县 ",
			"sort": 8
		}, {
			"Code": "650009",
			"Name": "尼勒克县 ",
			"sort": 9
		}],
		"sort": 9
	}, {
		"Code": "650010",
		"Name": "博尔塔拉自治州",
		"level": [{
			"Code": "650010",
			"Name": "博乐市 ",
			"sort": 1
		}, {
			"Code": "650010",
			"Name": "精河县 ",
			"sort": 2
		}, {
			"Code": "650010",
			"Name": "温泉县 ",
			"sort": 3
		}],
		"sort": 10
	}, {
		"Code": "650011",
		"Name": "昌吉自治州",
		"level": [{
			"Code": "650011",
			"Name": "昌吉市 ",
			"sort": 1
		}, {
			"Code": "650011",
			"Name": "阜康市 ",
			"sort": 2
		}, {
			"Code": "650011",
			"Name": "呼图壁县 ",
			"sort": 3
		}, {
			"Code": "650011",
			"Name": "玛纳斯县 ",
			"sort": 4
		}, {
			"Code": "650011",
			"Name": "奇台县 ",
			"sort": 5
		}, {
			"Code": "650011",
			"Name": "吉木萨尔县 ",
			"sort": 6
		}, {
			"Code": "650011",
			"Name": "木垒哈萨克自治县  ",
			"sort": 7
		}],
		"sort": 11
	}, {
		"Code": "650012",
		"Name": "克拉玛依市",
		"level": [{
			"Code": "650012",
			"Name": "独山子区 ",
			"sort": 1
		}, {
			"Code": "650012",
			"Name": "克拉玛依区 ",
			"sort": 2
		}, {
			"Code": "650012",
			"Name": "白碱滩区 ",
			"sort": 3
		}, {
			"Code": "650012",
			"Name": "乌尔禾区 ",
			"sort": 4
		}],
		"sort": 12
	}, {
		"Code": "650013",
		"Name": "吐鲁番地区",
		"level": [{
			"Code": "650013",
			"Name": "吐鲁番市 ",
			"sort": 1
		}, {
			"Code": "650013",
			"Name": "鄯善县 ",
			"sort": 2
		}, {
			"Code": "650013",
			"Name": "托克逊县 ",
			"sort": 3
		}],
		"sort": 13
	}, {
		"Code": "650014",
		"Name": "哈密地区",
		"level": [{
			"Code": "650014",
			"Name": "哈密市 ",
			"sort": 1
		}, {
			"Code": "650014",
			"Name": "巴里坤哈萨克自治县 ",
			"sort": 2
		}, {
			"Code": "650014",
			"Name": "伊吾县 ",
			"sort": 3
		}],
		"sort": 14
	}, {
		"Code": "650015",
		"Name": "和田地区",
		"level": [{
			"Code": "650015",
			"Name": "和田县 ",
			"sort": 1
		}, {
			"Code": "650015",
			"Name": "墨玉县 ",
			"sort": 2
		}, {
			"Code": "650015",
			"Name": "皮山县 ",
			"sort": 3
		}, {
			"Code": "650015",
			"Name": "洛浦县 ",
			"sort": 4
		}, {
			"Code": "650015",
			"Name": "策勒县 ",
			"sort": 5
		}, {
			"Code": "650015",
			"Name": "于田县 ",
			"sort": 6
		}, {
			"Code": "650015",
			"Name": "民丰县 ",
			"sort": 7
		}],
		"sort": 15
	}, {
		"Code": "650016",
		"Name": "阿克苏地区",
		"level": [{
			"Code": "650016",
			"Name": "阿克苏市  ",
			"sort": 1
		}, {
			"Code": "650016",
			"Name": "温宿县 ",
			"sort": 2
		}, {
			"Code": "650016",
			"Name": "库车县 ",
			"sort": 3
		}, {
			"Code": "650016",
			"Name": "沙雅县 ",
			"sort": 4
		}, {
			"Code": "650016",
			"Name": "新和县 ",
			"sort": 5
		}, {
			"Code": "650016",
			"Name": "拜城县 ",
			"sort": 6
		}, {
			"Code": "650016",
			"Name": "乌什县 ",
			"sort": 7
		}, {
			"Code": "650016",
			"Name": "阿瓦提县 ",
			"sort": 8
		}, {
			"Code": "650016",
			"Name": "柯坪县 ",
			"sort": 9
		}],
		"sort": 16
	}, {
		"Code": "650017",
		"Name": "喀什市",
		"level": [{
			"Code": "650017",
			"Name": "喀什市  ",
			"sort": 1
		}, {
			"Code": "650017",
			"Name": "巴楚县 ",
			"sort": 2
		}, {
			"Code": "650017",
			"Name": "伽师县 ",
			"sort": 3
		}, {
			"Code": "650017",
			"Name": "岳普湖县 ",
			"sort": 4
		}, {
			"Code": "650017",
			"Name": "麦盖提县 ",
			"sort": 5
		}, {
			"Code": "650017",
			"Name": "叶城县 ",
			"sort": 6
		}, {
			"Code": "650017",
			"Name": "莎车县 ",
			"sort": 7
		}, {
			"Code": "650017",
			"Name": "泽普县 ",
			"sort": 8
		}, {
			"Code": "650017",
			"Name": "英吉沙县 ",
			"sort": 9
		}, {
			"Code": "650017",
			"Name": "疏勒县 ",
			"sort": 10
		}, {
			"Code": "650017",
			"Name": "疏附县 ",
			"sort": 11
		}, {
			"Code": "650017",
			"Name": "塔什库尔干塔吉克自治县 ",
			"sort": 12
		}],
		"sort": 17
	}, {
		"Code": "650018",
		"Name": "克孜勒苏柯尔克孜自治州",
		"level": [{
			"Code": "650018",
			"Name": "阿图什市 ",
			"sort": 1
		}, {
			"Code": "650018",
			"Name": "阿克陶县 ",
			"sort": 2
		}, {
			"Code": "650018",
			"Name": "阿合奇县 ",
			"sort": 3
		}, {
			"Code": "650018",
			"Name": "乌恰县 ",
			"sort": 4
		}],
		"sort": 18
	}, {
		"Code": "650019",
		"Name": "巴音郭楞自治州",
		"level": [{
			"Code": "650019",
			"Name": "库尔勒市 ",
			"sort": 1
		}, {
			"Code": "650019",
			"Name": "轮台县 ",
			"sort": 2
		}, {
			"Code": "650019",
			"Name": "尉犁县 ",
			"sort": 3
		}, {
			"Code": "650019",
			"Name": "若羌县 ",
			"sort": 4
		}, {
			"Code": "650019",
			"Name": "且末县 ",
			"sort": 5
		}, {
			"Code": "650019",
			"Name": "焉耆回族自治县 ",
			"sort": 6
		}, {
			"Code": "650019",
			"Name": "和静县 ",
			"sort": 7
		}, {
			"Code": "650019",
			"Name": "和硕县 ",
			"sort": 8
		}, {
			"Code": "650019",
			"Name": "博湖县 ",
			"sort": 9
		}],
		"sort": 19
	}, {
		"Code": "650020",
		"Name": "乌鲁木齐市",
		"level": [{
			"Code": "650020",
			"Name": "头屯河区 ",
			"sort": 1
		}, {
			"Code": "650020",
			"Name": "达坂城区 ",
			"sort": 2
		}, {
			"Code": "650020",
			"Name": "米东区 ",
			"sort": 3
		}, {
			"Code": "650020",
			"Name": "乌鲁木齐县 ",
			"sort": 4
		}, {
			"Code": "650020",
			"Name": "天山区",
			"sort": 5
		}, {
			"Code": "650020",
			"Name": "沙依巴克区",
			"sort": 6
		}, {
			"Code": "650020",
			"Name": "新市区",
			"sort": 7
		}, {
			"Code": "650020",
			"Name": "水磨沟区",
			"sort": 8
		}],
		"sort": 20
	}]
}, {
	"Code": "910000",
	"Name": "香港特别行政区",
	"level": [{
		"Code": "910001",
		"Name": "新界",
		"level": [{
			"Code": "910001",
			"Name": "沙田区",
			"sort": 1
		}, {
			"Code": "910001",
			"Name": "西贡区",
			"sort": 2
		}, {
			"Code": "910001",
			"Name": "北区",
			"sort": 3
		}, {
			"Code": "910001",
			"Name": "大埔区",
			"sort": 4
		}, {
			"Code": "910001",
			"Name": "离岛区",
			"level": [{
				"Code": "5936",
				"Name": "大屿山香港国际机场"
			}, {
				"Code": "5937",
				"Name": "东涌"
			}, {
				"Code": "5939",
				"Name": "愉景湾"
			}],
			"sort": 5
		}, {
			"Code": "910001",
			"Name": "葵青区",
			"sort": 6
		}, {
			"Code": "910001",
			"Name": "荃湾区",
			"sort": 7
		}, {
			"Code": "910001",
			"Name": "屯门区",
			"sort": 8
		}, {
			"Code": "910001",
			"Name": "元朗区",
			"sort": 9
		}],
		"sort": 1
	}, {
		"Code": "910002",
		"Name": "九龙",
		"level": [{
			"Code": "910002",
			"Name": "观塘区",
			"sort": 1
		}, {
			"Code": "910002",
			"Name": "黄大仙区",
			"sort": 2
		}, {
			"Code": "910002",
			"Name": "深水埗区",
			"sort": 3
		}, {
			"Code": "910002",
			"Name": "油尖旺区",
			"sort": 4
		}, {
			"Code": "910002",
			"Name": "九龙城区",
			"sort": 5
		}],
		"sort": 2
	}, {
		"Code": "910003",
		"Name": "香港岛",
		"level": [{
			"Code": "910003",
			"Name": "湾仔区",
			"sort": 1
		}, {
			"Code": "910003",
			"Name": "南区",
			"sort": 2
		}, {
			"Code": "910003",
			"Name": "东区",
			"sort": 3
		}, {
			"Code": "910003",
			"Name": "中西区 ",
			"sort": 4
		}],
		"sort": 3
	}]
}, {
	"Code": "920000",
	"Name": "台湾省",
	"level": [{
		"Code": "920001",
		"Name": "台北市",
		"sort": 1,
		"level": [{
			"Code": "920001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920002",
		"Name": "彰化县",
		"level": [{
			"Code": "920002",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 2
	}, {
		"Code": "920003",
		"Name": "南投县",
		"level": [{
			"Code": "920003",
			"Name": "草屯",
			"sort": 1
		}],
		"sort": 3
	}, {
		"Code": "920004",
		"Name": "云林县",
		"level": [{
			"Code": "920004",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 4
	}, {
		"Code": "920005",
		"Name": "嘉义县",
		"level": [{
			"Code": "920005",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 5
	}, {
		"Code": "920006",
		"Name": "台南县",
		"level": [{
			"Code": "920006",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 6
	}, {
		"Code": "920007",
		"Name": "高雄县",
		"level": [{
			"Code": "920007",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 7
	}, {
		"Code": "920008",
		"Name": "屏东县",
		"sort": 8,
		"level": [{
			"Code": "920008",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920009",
		"Name": "澎湖县",
		"sort": 9,
		"level": [{
			"Code": "920009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920010",
		"Name": "台东县",
		"sort": 10,
		"level": [{
			"Code": "920010",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920011",
		"Name": "台中县",
		"level": [{
			"Code": "920011",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 11
	}, {
		"Code": "920012",
		"Name": "苗栗县",
		"level": [{
			"Code": "920012",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 12
	}, {
		"Code": "920013",
		"Name": "新竹县",
		"level": [{
			"Code": "920013",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 13
	}, {
		"Code": "920014",
		"Name": "高雄市",
		"sort": 14,
		"level": [{
			"Code": "920014",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920015",
		"Name": "基隆市",
		"sort": 15,
		"level": [{
			"Code": "920015",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920016",
		"Name": "台中市",
		"sort": 16,
		"level": [{
			"Code": "920016",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920017",
		"Name": "台南市",
		"sort": 17,
		"level": [{
			"Code": "920017",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920018",
		"Name": "新竹市",
		"sort": 18,
		"level": [{
			"Code": "920018",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920019",
		"Name": "嘉义市",
		"sort": 19,
		"level": [{
			"Code": "920019",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920020",
		"Name": "台北县",
		"level": [{
			"Code": "920020",
			"Name": "县中心",
			"sort": 1
		}],
		"sort": 20
	}, {
		"Code": "920021",
		"Name": "宜兰县",
		"sort": 21,
		"level": [{
			"Code": "920021",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920022",
		"Name": "桃园县",
		"sort": 22,
		"level": [{
			"Code": "920022",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "920023",
		"Name": "花莲县",
		"sort": 23,
		"level": [{
			"Code": "920023",
			"Name": "--",
			"sort": 1
		}]
	}]
}, {
	"Code": "430000",
	"Name": "湖南省",
	"level": [{
		"Code": "430001",
		"Name": "长沙市",
		"level": [{
			"Code": "430001",
			"Name": "岳麓区",
			"sort": 1
		}, {
			"Code": "430001",
			"Name": "开福区",
			"sort": 2
		}, {
			"Code": "430001",
			"Name": "天心区",
			"sort": 3
		}, {
			"Code": "430001",
			"Name": "芙蓉区",
			"sort": 4
		}, {
			"Code": "430001",
			"Name": "雨花区",
			"sort": 5
		}, {
			"Code": "430001",
			"Name": "浏阳市",
			"level": [{
				"Code": "1311",
				"Name": "市中心"
			}, {
				"Code": "1312",
				"Name": "淮川办事处"
			}, {
				"Code": "1313",
				"Name": "集里办事处"
			}, {
				"Code": "1314",
				"Name": "荷花办事处"
			}, {
				"Code": "1315",
				"Name": "关口办事处"
			}, {
				"Code": "1316",
				"Name": "永安镇"
			}, {
				"Code": "1317",
				"Name": "北盛镇"
			}, {
				"Code": "1318",
				"Name": "江背镇"
			}],
			"sort": 6
		}, {
			"Code": "430001",
			"Name": "宁乡县",
			"level": [{
				"Code": "5900",
				"Name": "玉潭镇"
			}, {
				"Code": "5901",
				"Name": "宁乡经济技术开发区"
			}, {
				"Code": "5902",
				"Name": "回龙铺镇"
			}, {
				"Code": "5903",
				"Name": "夏铎铺镇"
			}, {
				"Code": "5904",
				"Name": "金州新区"
			}],
			"sort": 7
		}, {
			"Code": "430001",
			"Name": "望城县",
			"level": [{
				"Code": "1320",
				"Name": "城关镇"
			}, {
				"Code": "1321",
				"Name": "高岭塘镇"
			}, {
				"Code": "1322",
				"Name": "黄金乡"
			}, {
				"Code": "1323",
				"Name": "雷锋镇"
			}],
			"sort": 8
		}, {
			"Code": "430001",
			"Name": "长沙县",
			"level": [{
				"Code": "5905",
				"Name": "星沙镇"
			}, {
				"Code": "1324",
				"Name": "榔梨镇"
			}, {
				"Code": "1325",
				"Name": "暮云镇"
			}, {
				"Code": "1326",
				"Name": "安沙镇"
			}],
			"sort": 9
		}],
		"sort": 1
	}, {
		"Code": "430002",
		"Name": "娄底市",
		"level": [{
			"Code": "430002",
			"Name": "冷水江市 ",
			"sort": 1
		}, {
			"Code": "430002",
			"Name": "双峰县 ",
			"sort": 2
		}, {
			"Code": "430002",
			"Name": "新化县 ",
			"sort": 3
		}, {
			"Code": "430002",
			"Name": "涟源市 ",
			"sort": 4
		}, {
			"Code": "430002",
			"Name": "经济开发区 ",
			"sort": 5
		}, {
			"Code": "430002",
			"Name": "娄星区",
			"sort": 6
		}],
		"sort": 2
	}, {
		"Code": "430003",
		"Name": "怀化市",
		"level": [{
			"Code": "430003",
			"Name": "城东新区",
			"sort": 1
		}, {
			"Code": "430003",
			"Name": "洪江市 ",
			"sort": 2
		}, {
			"Code": "430003",
			"Name": "通道侗族自治县 ",
			"sort": 3
		}, {
			"Code": "430003",
			"Name": "靖州苗族侗族自治县 ",
			"sort": 4
		}, {
			"Code": "430003",
			"Name": "芷江侗族自治县 ",
			"sort": 5
		}, {
			"Code": "430003",
			"Name": "新晃侗族自治县 ",
			"sort": 6
		}, {
			"Code": "430003",
			"Name": "麻阳苗族自治县 ",
			"sort": 7
		}, {
			"Code": "430003",
			"Name": "会同县 ",
			"sort": 8
		}, {
			"Code": "430003",
			"Name": "溆浦县 ",
			"sort": 9
		}, {
			"Code": "430003",
			"Name": "辰溪县 ",
			"sort": 10
		}, {
			"Code": "430003",
			"Name": "沅陵县  ",
			"sort": 11
		}, {
			"Code": "430003",
			"Name": "中方县 ",
			"sort": 12
		}, {
			"Code": "430003",
			"Name": "湖天开发区",
			"sort": 13
		}, {
			"Code": "430003",
			"Name": "河西开发区",
			"sort": 14
		}, {
			"Code": "430003",
			"Name": "鹤城区",
			"sort": 15
		}],
		"sort": 3
	}, {
		"Code": "430004",
		"Name": "永州市",
		"level": [{
			"Code": "430004",
			"Name": "江华瑶族自治县 ",
			"sort": 1
		}, {
			"Code": "430004",
			"Name": "新田县 ",
			"sort": 2
		}, {
			"Code": "430004",
			"Name": "蓝山县 ",
			"sort": 3
		}, {
			"Code": "430004",
			"Name": "宁远县 ",
			"sort": 4
		}, {
			"Code": "430004",
			"Name": "江永县 ",
			"sort": 5
		}, {
			"Code": "430004",
			"Name": "道县 ",
			"sort": 6
		}, {
			"Code": "430004",
			"Name": "双牌县 ",
			"sort": 7
		}, {
			"Code": "430004",
			"Name": "东安县 ",
			"sort": 8
		}, {
			"Code": "430004",
			"Name": "祁阳县 ",
			"sort": 9
		}, {
			"Code": "430004",
			"Name": "零陵区",
			"sort": 10
		}, {
			"Code": "430004",
			"Name": "冷水滩区",
			"sort": 11
		}],
		"sort": 4
	}, {
		"Code": "430005",
		"Name": "郴州市",
		"level": [{
			"Code": "430005",
			"Name": "安仁县 ",
			"sort": 1
		}, {
			"Code": "430005",
			"Name": "桂东县 ",
			"sort": 2
		}, {
			"Code": "430005",
			"Name": "汝城县 ",
			"sort": 3
		}, {
			"Code": "430005",
			"Name": "临武县 ",
			"sort": 4
		}, {
			"Code": "430005",
			"Name": "嘉禾县 ",
			"sort": 5
		}, {
			"Code": "430005",
			"Name": "永兴县 ",
			"sort": 6
		}, {
			"Code": "430005",
			"Name": "桂阳县 ",
			"sort": 7
		}, {
			"Code": "430005",
			"Name": "宜章县 ",
			"sort": 8
		}, {
			"Code": "430005",
			"Name": "资兴市",
			"level": [{
				"Code": "1327",
				"Name": "资兴市区"
			}, {
				"Code": "1328",
				"Name": "鲤鱼江镇"
			}, {
				"Code": "1329",
				"Name": "东江镇"
			}],
			"sort": 9
		}, {
			"Code": "430005",
			"Name": "苏仙区",
			"sort": 10
		}, {
			"Code": "430005",
			"Name": "北湖区",
			"sort": 11
		}],
		"sort": 5
	}, {
		"Code": "430006",
		"Name": "益阳市",
		"level": [{
			"Code": "430006",
			"Name": "南县 ",
			"sort": 1
		}, {
			"Code": "430006",
			"Name": "桃江县 ",
			"sort": 2
		}, {
			"Code": "430006",
			"Name": "安化县 ",
			"sort": 3
		}, {
			"Code": "430006",
			"Name": "沅江市 ",
			"sort": 4
		}, {
			"Code": "430006",
			"Name": "朝阳经济开发区",
			"sort": 5
		}, {
			"Code": "430006",
			"Name": "龙岭工业区 ",
			"sort": 6
		}, {
			"Code": "430006",
			"Name": "赫山区",
			"sort": 7
		}, {
			"Code": "430006",
			"Name": "资阳区",
			"sort": 8
		}, {
			"Code": "430006",
			"Name": "高新区",
			"sort": 9
		}],
		"sort": 6
	}, {
		"Code": "430007",
		"Name": "张家界市",
		"level": [{
			"Code": "430007",
			"Name": "永定区 ",
			"sort": 1
		}, {
			"Code": "430007",
			"Name": "武陵源区 ",
			"sort": 2
		}, {
			"Code": "430007",
			"Name": "慈利县 ",
			"sort": 3
		}, {
			"Code": "430007",
			"Name": "桑植县 ",
			"sort": 4
		}],
		"sort": 7
	}, {
		"Code": "430008",
		"Name": "常德市",
		"level": [{
			"Code": "430008",
			"Name": "津市市 ",
			"sort": 1
		}, {
			"Code": "430008",
			"Name": "石门县 ",
			"sort": 2
		}, {
			"Code": "430008",
			"Name": "临澧县 ",
			"sort": 3
		}, {
			"Code": "430008",
			"Name": "澧县 ",
			"sort": 4
		}, {
			"Code": "430008",
			"Name": "汉寿县  ",
			"sort": 5
		}, {
			"Code": "430008",
			"Name": "安乡县 ",
			"sort": 6
		}, {
			"Code": "430008",
			"Name": "桃源县",
			"level": [{
				"Code": "5906",
				"Name": "河伏镇"
			}, {
				"Code": "1333",
				"Name": "漳江镇"
			}],
			"sort": 7
		}, {
			"Code": "430008",
			"Name": "德山经济技术开发区",
			"sort": 8
		}, {
			"Code": "430008",
			"Name": "鼎城区",
			"sort": 9
		}, {
			"Code": "430008",
			"Name": "武陵区",
			"sort": 10
		}],
		"sort": 8
	}, {
		"Code": "430009",
		"Name": "岳阳市",
		"level": [{
			"Code": "430009",
			"Name": "临湘市 ",
			"sort": 1
		}, {
			"Code": "430009",
			"Name": "汨罗市 ",
			"sort": 2
		}, {
			"Code": "430009",
			"Name": "平江县 ",
			"sort": 3
		}, {
			"Code": "430009",
			"Name": "湘阴县 ",
			"sort": 4
		}, {
			"Code": "430009",
			"Name": "岳阳县 ",
			"sort": 5
		}, {
			"Code": "430009",
			"Name": "华容县 ",
			"sort": 6
		}, {
			"Code": "430009",
			"Name": "岳阳经济技术开发区",
			"sort": 7
		}, {
			"Code": "430009",
			"Name": "君山区",
			"sort": 8
		}, {
			"Code": "430009",
			"Name": "云溪区",
			"sort": 9
		}, {
			"Code": "430009",
			"Name": "岳阳楼区",
			"sort": 10
		}],
		"sort": 9
	}, {
		"Code": "430010",
		"Name": "邵阳市",
		"level": [{
			"Code": "430010",
			"Name": "北塔区 ",
			"sort": 1
		}, {
			"Code": "430010",
			"Name": "武冈市 ",
			"sort": 2
		}, {
			"Code": "430010",
			"Name": "城步苗族自治县 ",
			"sort": 3
		}, {
			"Code": "430010",
			"Name": "新宁县 ",
			"sort": 4
		}, {
			"Code": "430010",
			"Name": "绥宁县 ",
			"sort": 5
		}, {
			"Code": "430010",
			"Name": "洞口县 ",
			"sort": 6
		}, {
			"Code": "430010",
			"Name": "隆回县 ",
			"sort": 7
		}, {
			"Code": "430010",
			"Name": "邵阳县  ",
			"sort": 8
		}, {
			"Code": "430010",
			"Name": "新邵县 ",
			"sort": 9
		}, {
			"Code": "430010",
			"Name": "邵东县",
			"level": [{
				"Code": "1338",
				"Name": "县城中心"
			}],
			"sort": 10
		}, {
			"Code": "430010",
			"Name": "双清区",
			"sort": 11
		}, {
			"Code": "430010",
			"Name": "大祥区",
			"sort": 12
		}],
		"sort": 10
	}, {
		"Code": "430011",
		"Name": "衡阳市",
		"level": [{
			"Code": "430011",
			"Name": "常宁市 ",
			"sort": 1
		}, {
			"Code": "430011",
			"Name": "耒阳市 ",
			"sort": 2
		}, {
			"Code": "430011",
			"Name": "祁东县 ",
			"sort": 3
		}, {
			"Code": "430011",
			"Name": "衡山县 ",
			"sort": 4
		}, {
			"Code": "430011",
			"Name": "衡南县 ",
			"sort": 5
		}, {
			"Code": "430011",
			"Name": "衡东县 ",
			"sort": 6
		}, {
			"Code": "430011",
			"Name": "南岳区 ",
			"sort": 7
		}, {
			"Code": "430011",
			"Name": "衡阳县",
			"level": [{
				"Code": "1340",
				"Name": "西渡镇"
			}],
			"sort": 8
		}, {
			"Code": "430011",
			"Name": "蒸湘区",
			"sort": 9
		}, {
			"Code": "430011",
			"Name": "石鼓区",
			"sort": 10
		}, {
			"Code": "430011",
			"Name": "珠晖区",
			"sort": 11
		}, {
			"Code": "430011",
			"Name": "雁峰区",
			"sort": 12
		}],
		"sort": 11
	}, {
		"Code": "430012",
		"Name": "湘潭市",
		"level": [{
			"Code": "430012",
			"Name": "韶山市 ",
			"sort": 1
		}, {
			"Code": "430012",
			"Name": "雨湖区",
			"sort": 2
		}, {
			"Code": "430012",
			"Name": "岳塘区",
			"sort": 3
		}, {
			"Code": "430012",
			"Name": "湘乡市",
			"level": [{
				"Code": "1341",
				"Name": "市区"
			}],
			"sort": 4
		}, {
			"Code": "430012",
			"Name": "湘潭县",
			"level": [{
				"Code": "1342",
				"Name": "天易工业园"
			}, {
				"Code": "1343",
				"Name": "易俗河镇"
			}],
			"sort": 5
		}],
		"sort": 12
	}, {
		"Code": "430013",
		"Name": "株洲市",
		"level": [{
			"Code": "430013",
			"Name": "攸县 ",
			"sort": 1
		}, {
			"Code": "430013",
			"Name": "茶陵县 ",
			"sort": 2
		}, {
			"Code": "430013",
			"Name": "炎陵县 ",
			"sort": 3
		}, {
			"Code": "430013",
			"Name": "天元区",
			"sort": 4
		}, {
			"Code": "430013",
			"Name": "石峰区",
			"sort": 5
		}, {
			"Code": "430013",
			"Name": "芦松区",
			"sort": 6
		}, {
			"Code": "430013",
			"Name": "荷塘区",
			"sort": 7
		}, {
			"Code": "430013",
			"Name": "醴陵市",
			"level": [{
				"Code": "1345",
				"Name": "市中心"
			}, {
				"Code": "1346",
				"Name": "嘉树乡"
			}, {
				"Code": "1347",
				"Name": "王仙镇"
			}, {
				"Code": "1348",
				"Name": "浦口镇"
			}, {
				"Code": "1349",
				"Name": "东富镇"
			}, {
				"Code": "1350",
				"Name": "泗汾镇"
			}, {
				"Code": "1351",
				"Name": "孙家湾乡"
			}],
			"sort": 8
		}, {
			"Code": "430013",
			"Name": "株洲县",
			"level": [{
				"Code": "1352",
				"Name": "县城中心"
			}, {
				"Code": "1353",
				"Name": "渌口镇"
			}],
			"sort": 9
		}],
		"sort": 13
	}, {
		"Code": "430014",
		"Name": "湘西自治州",
		"level": [{
			"Code": "430014",
			"Name": "吉首市  ",
			"sort": 1
		}, {
			"Code": "430014",
			"Name": "泸溪县 ",
			"sort": 2
		}, {
			"Code": "430014",
			"Name": "凤凰县 ",
			"sort": 3
		}, {
			"Code": "430014",
			"Name": "花垣县 ",
			"sort": 4
		}, {
			"Code": "430014",
			"Name": "保靖县 ",
			"sort": 5
		}, {
			"Code": "430014",
			"Name": "古丈县 ",
			"sort": 6
		}, {
			"Code": "430014",
			"Name": "永顺县 ",
			"sort": 7
		}, {
			"Code": "430014",
			"Name": "龙山县 ",
			"sort": 8
		}],
		"sort": 14
	}]
}, {
	"Code": "420000",
	"Name": "湖北省",
	"level": [{
		"Code": "420001",
		"Name": "十堰市",
		"level": [{
			"Code": "420001",
			"Name": "张湾区",
			"sort": 1
		}, {
			"Code": "420001",
			"Name": "茅箭区",
			"sort": 2
		}, {
			"Code": "420001",
			"Name": "郧县 ‎  ",
			"sort": 3
		}, {
			"Code": "420001",
			"Name": "郧西县 ",
			"sort": 4
		}, {
			"Code": "420001",
			"Name": "‎竹山县 ‎ ",
			"sort": 5
		}, {
			"Code": "420001",
			"Name": "竹溪县 ‎ ",
			"sort": 6
		}, {
			"Code": "420001",
			"Name": "房县 ‎",
			"sort": 7
		}, {
			"Code": "420001",
			"Name": "丹江口市 ‎ ",
			"sort": 8
		}],
		"sort": 1
	}, {
		"Code": "420002",
		"Name": "天门市 ",
		"sort": 2,
		"level": [{
			"Code": "420002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "420003",
		"Name": "恩施土家族苗族自治州",
		"level": [{
			"Code": "420003",
			"Name": "恩施市  ",
			"sort": 1
		}, {
			"Code": "420003",
			"Name": "利川市 ",
			"sort": 2
		}, {
			"Code": "420003",
			"Name": "建始县 ",
			"sort": 3
		}, {
			"Code": "420003",
			"Name": "巴东县 ",
			"sort": 4
		}, {
			"Code": "420003",
			"Name": "宣恩县 ",
			"sort": 5
		}, {
			"Code": "420003",
			"Name": "咸丰县 ",
			"sort": 6
		}, {
			"Code": "420003",
			"Name": "来凤县 ",
			"sort": 7
		}, {
			"Code": "420003",
			"Name": "鹤峰县 ",
			"sort": 8
		}],
		"sort": 3
	}, {
		"Code": "420004",
		"Name": "潜江市 ",
		"sort": 4,
		"level": [{
			"Code": "420004",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "420005",
		"Name": "仙桃市",
		"level": [{
			"Code": "420005",
			"Name": "仙桃城区",
			"sort": 1
		}, {
			"Code": "420005",
			"Name": "仙桃经济技术开发区",
			"sort": 2
		}, {
			"Code": "420005",
			"Name": "仙桃高新技术开发区",
			"sort": 3
		}, {
			"Code": "420005",
			"Name": "彭场镇",
			"sort": 4
		}],
		"sort": 5
	}, {
		"Code": "420006",
		"Name": "神农架林区",
		"sort": 6,
		"level": [{
			"Code": "420006",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "420007",
		"Name": "随州市",
		"level": [{
			"Code": "420007",
			"Name": "广水市 ",
			"sort": 1
		}, {
			"Code": "420007",
			"Name": "曾都区",
			"sort": 2
		}],
		"sort": 7
	}, {
		"Code": "420008",
		"Name": "咸宁市",
		"level": [{
			"Code": "420008",
			"Name": "嘉鱼县 ",
			"sort": 1
		}, {
			"Code": "420008",
			"Name": "通城县 ",
			"sort": 2
		}, {
			"Code": "420008",
			"Name": "崇阳县 ",
			"sort": 3
		}, {
			"Code": "420008",
			"Name": "通山县 ",
			"sort": 4
		}, {
			"Code": "420008",
			"Name": "赤壁市 ",
			"sort": 5
		}, {
			"Code": "420008",
			"Name": "咸安区",
			"sort": 6
		}],
		"sort": 8
	}, {
		"Code": "420009",
		"Name": "黄冈市",
		"level": [{
			"Code": "420009",
			"Name": "武穴市 ",
			"sort": 1
		}, {
			"Code": "420009",
			"Name": "麻城市 ",
			"sort": 2
		}, {
			"Code": "420009",
			"Name": "黄梅县 ",
			"sort": 3
		}, {
			"Code": "420009",
			"Name": "蕲春县 ",
			"sort": 4
		}, {
			"Code": "420009",
			"Name": "浠水县 ",
			"sort": 5
		}, {
			"Code": "420009",
			"Name": "英山县 ",
			"sort": 6
		}, {
			"Code": "420009",
			"Name": "罗田县  ",
			"sort": 7
		}, {
			"Code": "420009",
			"Name": "红安县 ",
			"sort": 8
		}, {
			"Code": "420009",
			"Name": "团风县 ",
			"sort": 9
		}, {
			"Code": "420009",
			"Name": "黄州区",
			"sort": 10
		}],
		"sort": 9
	}, {
		"Code": "420010",
		"Name": "孝感市",
		"level": [{
			"Code": "420010",
			"Name": "汉川市 ",
			"sort": 1
		}, {
			"Code": "420010",
			"Name": "安陆市 ",
			"sort": 2
		}, {
			"Code": "420010",
			"Name": "应城市 ",
			"sort": 3
		}, {
			"Code": "420010",
			"Name": "孝昌县 ",
			"sort": 4
		}, {
			"Code": "420010",
			"Name": "大悟县 ",
			"sort": 5
		}, {
			"Code": "420010",
			"Name": "云梦县 ",
			"sort": 6
		}, {
			"Code": "420010",
			"Name": "孝感开发区",
			"sort": 7
		}, {
			"Code": "420010",
			"Name": "孝南开发区",
			"sort": 8
		}, {
			"Code": "420010",
			"Name": "南大开发区",
			"sort": 9
		}, {
			"Code": "420010",
			"Name": "孝南区",
			"sort": 10
		}],
		"sort": 10
	}, {
		"Code": "420011",
		"Name": "鄂州市",
		"level": [{
			"Code": "420011",
			"Name": "梁子湖区 ",
			"sort": 1
		}, {
			"Code": "420011",
			"Name": "华容区 ",
			"sort": 2
		}, {
			"Code": "420011",
			"Name": "鄂城区",
			"sort": 3
		}],
		"sort": 11
	}, {
		"Code": "420012",
		"Name": "荆门市",
		"level": [{
			"Code": "420012",
			"Name": "京山县 ",
			"sort": 1
		}, {
			"Code": "420012",
			"Name": "沙洋县 ",
			"sort": 2
		}, {
			"Code": "420012",
			"Name": "东宝区",
			"sort": 3
		}, {
			"Code": "420012",
			"Name": "掇刀区",
			"sort": 4
		}, {
			"Code": "420012",
			"Name": "钟祥市",
			"level": [{
				"Code": "1360",
				"Name": "郢中镇"
			}],
			"sort": 5
		}],
		"sort": 12
	}, {
		"Code": "420013",
		"Name": "宜昌市",
		"level": [{
			"Code": "420013",
			"Name": "五峰土家族自治县 ",
			"sort": 1
		}, {
			"Code": "420013",
			"Name": "长阳土家族自治县 ",
			"sort": 2
		}, {
			"Code": "420013",
			"Name": "秭归县 ",
			"sort": 3
		}, {
			"Code": "420013",
			"Name": "兴山县  ",
			"sort": 4
		}, {
			"Code": "420013",
			"Name": "远安县 ",
			"sort": 5
		}, {
			"Code": "420013",
			"Name": "当阳市",
			"sort": 6
		}, {
			"Code": "420013",
			"Name": "夷陵区",
			"sort": 7
		}, {
			"Code": "420013",
			"Name": "西陵经济发展园区",
			"sort": 8
		}, {
			"Code": "420013",
			"Name": "点军区",
			"sort": 9
		}, {
			"Code": "420013",
			"Name": "枝江市",
			"level": [{
				"Code": "1367",
				"Name": "马店镇"
			}, {
				"Code": "1366",
				"Name": "市中心"
			}, {
				"Code": "1368",
				"Name": "江口镇"
			}, {
				"Code": "1369",
				"Name": "董市镇"
			}, {
				"Code": "1370",
				"Name": "问安镇"
			}, {
				"Code": "1371",
				"Name": "姚港镇"
			}, {
				"Code": "1372",
				"Name": "仙女镇"
			}, {
				"Code": "1373",
				"Name": "七星台镇"
			}],
			"sort": 10
		}, {
			"Code": "420013",
			"Name": "宜都市",
			"level": [{
				"Code": "1374",
				"Name": "陆城镇"
			}],
			"sort": 11
		}, {
			"Code": "420013",
			"Name": "宜昌开发区",
			"sort": 12
		}, {
			"Code": "420013",
			"Name": "猇亭区",
			"sort": 13
		}, {
			"Code": "420013",
			"Name": "西陵区",
			"sort": 14
		}, {
			"Code": "420013",
			"Name": "伍家岗区",
			"sort": 15
		}],
		"sort": 13
	}, {
		"Code": "420014",
		"Name": "荆州市",
		"level": [{
			"Code": "420014",
			"Name": "监利县 ",
			"sort": 1
		}, {
			"Code": "420014",
			"Name": "公安县 ",
			"sort": 2
		}, {
			"Code": "420014",
			"Name": "松滋市 ",
			"sort": 3
		}, {
			"Code": "420014",
			"Name": "江陵县 ",
			"sort": 4
		}, {
			"Code": "420014",
			"Name": "石首市 ",
			"sort": 5
		}, {
			"Code": "420014",
			"Name": "洪湖市 ",
			"sort": 6
		}, {
			"Code": "420014",
			"Name": "荆州区",
			"sort": 7
		}, {
			"Code": "420014",
			"Name": "沙市区",
			"sort": 8
		}],
		"sort": 14
	}, {
		"Code": "420015",
		"Name": "襄阳市",
		"level": [{
			"Code": "420015",
			"Name": "老河口市 ",
			"sort": 1
		}, {
			"Code": "420015",
			"Name": "宜城市 ",
			"sort": 2
		}, {
			"Code": "420015",
			"Name": "保康县 ",
			"sort": 3
		}, {
			"Code": "420015",
			"Name": "谷城县 ",
			"sort": 4
		}, {
			"Code": "420015",
			"Name": "南漳县  ",
			"sort": 5
		}, {
			"Code": "420015",
			"Name": "樊城区",
			"sort": 6
		}, {
			"Code": "420015",
			"Name": "襄城区",
			"sort": 7
		}, {
			"Code": "420015",
			"Name": "枣阳市",
			"level": [{
				"Code": "1383",
				"Name": "市中心"
			}],
			"sort": 8
		}, {
			"Code": "420015",
			"Name": "襄州区",
			"sort": 9
		}],
		"sort": 15
	}, {
		"Code": "420016",
		"Name": "黄石市",
		"level": [{
			"Code": "420016",
			"Name": "阳新县 ",
			"sort": 1
		}, {
			"Code": "420016",
			"Name": "黄金山开发区",
			"sort": 2
		}, {
			"Code": "420016",
			"Name": "黄石港区",
			"sort": 3
		}, {
			"Code": "420016",
			"Name": "西塞山区",
			"sort": 4
		}, {
			"Code": "420016",
			"Name": "铁山区",
			"sort": 5
		}, {
			"Code": "420016",
			"Name": "下陆区",
			"sort": 6
		}, {
			"Code": "420016",
			"Name": "大冶市",
			"level": [{
				"Code": "1384",
				"Name": "市中心"
			}],
			"sort": 7
		}],
		"sort": 16
	}, {
		"Code": "420017",
		"Name": "武汉市",
		"level": [{
			"Code": "420017",
			"Name": "东湖高新技术开发区",
			"sort": 1
		}, {
			"Code": "420017",
			"Name": "新洲区 ",
			"sort": 2
		}, {
			"Code": "420017",
			"Name": "汉南区",
			"sort": 3
		}, {
			"Code": "420017",
			"Name": "东西湖区",
			"sort": 4
		}, {
			"Code": "420017",
			"Name": "黄陂区",
			"sort": 5
		}, {
			"Code": "420017",
			"Name": "蔡甸区",
			"sort": 6
		}, {
			"Code": "420017",
			"Name": "江夏区",
			"sort": 7
		}, {
			"Code": "420017",
			"Name": "汉阳区",
			"sort": 8
		}, {
			"Code": "420017",
			"Name": "青山区",
			"sort": 9
		}, {
			"Code": "420017",
			"Name": "洪山区",
			"sort": 10
		}, {
			"Code": "420017",
			"Name": "武昌区",
			"sort": 11
		}, {
			"Code": "420017",
			"Name": "硚口区",
			"sort": 12
		}, {
			"Code": "420017",
			"Name": "江岸区",
			"sort": 13
		}, {
			"Code": "420017",
			"Name": "江汉区",
			"sort": 14
		}],
		"sort": 17
	}]
}, {
	"Code": "120000",
	"Name": "天津市",
	"level": [{
		"Code": "120001",
		"Name": "和平区",
		"sort": 1,
		"level": [{
			"Code": "120001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120002",
		"Name": "蓟县",
		"level": [{
			"Code": "120002",
			"Name": "蓟县开发区",
			"sort": 1
		}, {
			"Code": "120002",
			"Name": "礼明庄乡",
			"sort": 2
		}, {
			"Code": "120002",
			"Name": "别山镇",
			"sort": 3
		}, {
			"Code": "120002",
			"Name": "邦均镇",
			"sort": 4
		}, {
			"Code": "120002",
			"Name": "官庄镇",
			"sort": 5
		}, {
			"Code": "120002",
			"Name": "出头岭镇",
			"sort": 6
		}, {
			"Code": "120002",
			"Name": "下窝头镇",
			"sort": 7
		}, {
			"Code": "120002",
			"Name": "穿芳峪乡",
			"sort": 8
		}, {
			"Code": "120002",
			"Name": "东赵各庄乡",
			"sort": 9
		}, {
			"Code": "120002",
			"Name": "杨津庄镇",
			"sort": 10
		}, {
			"Code": "120002",
			"Name": "上仓镇",
			"sort": 11
		}, {
			"Code": "120002",
			"Name": "马伸桥镇",
			"sort": 12
		}, {
			"Code": "120002",
			"Name": "城关镇",
			"sort": 13
		}, {
			"Code": "120002",
			"Name": "下仓镇",
			"sort": 14
		}],
		"sort": 2
	}, {
		"Code": "120003",
		"Name": "静海县",
		"level": [{
			"Code": "120003",
			"Name": "静海经济开发区",
			"sort": 1
		}, {
			"Code": "120003",
			"Name": "杨成庄镇 ",
			"sort": 2
		}, {
			"Code": "120003",
			"Name": "子牙镇 ",
			"sort": 3
		}, {
			"Code": "120003",
			"Name": "团泊镇 ",
			"sort": 4
		}, {
			"Code": "120003",
			"Name": "陈官屯镇 ",
			"sort": 5
		}, {
			"Code": "120003",
			"Name": "双塘镇 ",
			"sort": 6
		}, {
			"Code": "120003",
			"Name": "梁头镇 ",
			"sort": 7
		}, {
			"Code": "120003",
			"Name": "独流镇 ",
			"sort": 8
		}, {
			"Code": "120003",
			"Name": "大邱庄镇 ",
			"sort": 9
		}, {
			"Code": "120003",
			"Name": "大丰堆镇 ",
			"sort": 10
		}, {
			"Code": "120003",
			"Name": "沿庄镇 ",
			"sort": 11
		}, {
			"Code": "120003",
			"Name": "静海镇 ",
			"sort": 12
		}, {
			"Code": "120003",
			"Name": "唐官屯镇 ",
			"sort": 13
		}],
		"sort": 3
	}, {
		"Code": "120004",
		"Name": "宁河县",
		"level": [{
			"Code": "120004",
			"Name": "宁河经济技术开发区",
			"sort": 1
		}, {
			"Code": "120004",
			"Name": "芦台镇",
			"sort": 2
		}],
		"sort": 4
	}, {
		"Code": "120005",
		"Name": "宝坻区",
		"sort": 5,
		"level": [{
			"Code": "120005",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120006",
		"Name": "武清区",
		"sort": 6,
		"level": [{
			"Code": "120006",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120007",
		"Name": "北辰区",
		"sort": 7,
		"level": [{
			"Code": "120007",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120008",
		"Name": "津南区",
		"sort": 8,
		"level": [{
			"Code": "120008",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120009",
		"Name": "西青区",
		"sort": 9,
		"level": [{
			"Code": "120009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120010",
		"Name": "东丽区",
		"sort": 10,
		"level": [{
			"Code": "120010",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120011",
		"Name": "大港区",
		"sort": 11,
		"level": [{
			"Code": "120011",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120012",
		"Name": "汉沽区",
		"sort": 12,
		"level": [{
			"Code": "120012",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120013",
		"Name": "塘沽区",
		"sort": 13,
		"level": [{
			"Code": "120013",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120014",
		"Name": "红桥区",
		"sort": 14,
		"level": [{
			"Code": "120014",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120015",
		"Name": "河北区",
		"sort": 15,
		"level": [{
			"Code": "120015",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120016",
		"Name": "南开区",
		"sort": 16,
		"level": [{
			"Code": "120016",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120017",
		"Name": "河西区",
		"sort": 17,
		"level": [{
			"Code": "120017",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120018",
		"Name": "河东区",
		"sort": 18,
		"level": [{
			"Code": "120018",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "120019",
		"Name": "滨海新区",
		"sort": 19,
		"level": [{
			"Code": "120019",
			"Name": "--",
			"sort": 1
		}]
	}]
}, {
	"Code": "130000",
	"Name": "河北省",
	"level": [{
		"Code": "130001",
		"Name": "遵化市",
		"sort": 1,
		"level": [{
			"Code": "130001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "130002",
		"Name": "张家口市",
		"level": [{
			"Code": "130002",
			"Name": "桥东区",
			"sort": 1
		}, {
			"Code": "130002",
			"Name": "崇礼县",
			"sort": 2
		}, {
			"Code": "130002",
			"Name": "赤城县",
			"sort": 3
		}, {
			"Code": "130002",
			"Name": "涿鹿县",
			"sort": 4
		}, {
			"Code": "130002",
			"Name": "怀来县",
			"sort": 5
		}, {
			"Code": "130002",
			"Name": "万全县",
			"sort": 6
		}, {
			"Code": "130002",
			"Name": "怀安县",
			"sort": 7
		}, {
			"Code": "130002",
			"Name": "阳原县",
			"sort": 8
		}, {
			"Code": "130002",
			"Name": "蔚县",
			"sort": 9
		}, {
			"Code": "130002",
			"Name": "尚义县",
			"sort": 10
		}, {
			"Code": "130002",
			"Name": "沽源县",
			"sort": 11
		}, {
			"Code": "130002",
			"Name": "康保县",
			"sort": 12
		}, {
			"Code": "130002",
			"Name": "张北县",
			"sort": 13
		}, {
			"Code": "130002",
			"Name": "宣化县",
			"sort": 14
		}, {
			"Code": "130002",
			"Name": "下花园区",
			"sort": 15
		}, {
			"Code": "130002",
			"Name": "桥西区",
			"sort": 16
		}, {
			"Code": "130002",
			"Name": "宣化区",
			"sort": 17
		}],
		"sort": 2
	}, {
		"Code": "130003",
		"Name": "承德市",
		"level": [{
			"Code": "130003",
			"Name": "双桥区",
			"sort": 1
		}, {
			"Code": "130003",
			"Name": "宽城满族自治县",
			"sort": 2
		}, {
			"Code": "130003",
			"Name": "丰宁满族自治县",
			"sort": 3
		}, {
			"Code": "130003",
			"Name": "隆化县",
			"sort": 4
		}, {
			"Code": "130003",
			"Name": "滦平县",
			"sort": 5
		}, {
			"Code": "130003",
			"Name": "平泉县",
			"sort": 6
		}, {
			"Code": "130003",
			"Name": "兴隆县",
			"sort": 7
		}, {
			"Code": "130003",
			"Name": "承德县",
			"sort": 8
		}, {
			"Code": "130003",
			"Name": "鹰手营子矿区",
			"sort": 9
		}, {
			"Code": "130003",
			"Name": "双滦区",
			"sort": 10
		}, {
			"Code": "130003",
			"Name": " 围场满族蒙古族自治县 ",
			"sort": 11
		}],
		"sort": 3
	}, {
		"Code": "130004",
		"Name": "衡水市",
		"level": [{
			"Code": "130004",
			"Name": "衡水高新技术开发区",
			"sort": 1
		}, {
			"Code": "130004",
			"Name": "冀州市",
			"sort": 2
		}, {
			"Code": "130004",
			"Name": "阜城县",
			"sort": 3
		}, {
			"Code": "130004",
			"Name": "景县",
			"sort": 4
		}, {
			"Code": "130004",
			"Name": "故城县",
			"sort": 5
		}, {
			"Code": "130004",
			"Name": "饶阳县",
			"sort": 6
		}, {
			"Code": "130004",
			"Name": "武强县",
			"sort": 7
		}, {
			"Code": "130004",
			"Name": "武邑县",
			"sort": 8
		}, {
			"Code": "130004",
			"Name": "枣强县",
			"sort": 9
		}, {
			"Code": "130004",
			"Name": "桃城区",
			"sort": 10
		}, {
			"Code": "130004",
			"Name": "深州市",
			"sort": 11
		}, {
			"Code": "130004",
			"Name": "安平县",
			"level": [{
				"Code": "1816",
				"Name": "县城中心"
			}],
			"sort": 12
		}],
		"sort": 4
	}, {
		"Code": "130005",
		"Name": "廊坊市",
		"level": [{
			"Code": "130005",
			"Name": "永清县",
			"sort": 1
		}, {
			"Code": "130005",
			"Name": "安次区",
			"sort": 2
		}, {
			"Code": "130005",
			"Name": "广阳区",
			"sort": 3
		}, {
			"Code": "130005",
			"Name": "大厂回族自治县",
			"level": [{
				"Code": "1696",
				"Name": "县城中心"
			}],
			"sort": 4
		}, {
			"Code": "130005",
			"Name": "三河市",
			"level": [{
				"Code": "1694",
				"Name": "市区"
			}],
			"sort": 5
		}, {
			"Code": "130005",
			"Name": "固安县",
			"level": [{
				"Code": "1692",
				"Name": "牛驼镇"
			}],
			"sort": 6
		}, {
			"Code": "130005",
			"Name": "大城县",
			"level": [{
				"Code": "2124",
				"Name": "县城中心"
			}, {
				"Code": "1690",
				"Name": "东阜摩配工业园区"
			}],
			"sort": 7
		}, {
			"Code": "130005",
			"Name": "文安县",
			"level": [{
				"Code": "1687",
				"Name": "县城中心"
			}, {
				"Code": "1688",
				"Name": "新镇"
			}],
			"sort": 8
		}, {
			"Code": "130005",
			"Name": "香河县",
			"level": [{
				"Code": "1684",
				"Name": "县城中心"
			}, {
				"Code": "1685",
				"Name": "淑阳镇"
			}],
			"sort": 9
		}, {
			"Code": "130005",
			"Name": "霸州市",
			"level": [{
				"Code": "1667",
				"Name": "北城区"
			}, {
				"Code": "1681",
				"Name": "胜芳开发区"
			}, {
				"Code": "1680",
				"Name": "胜芳镇"
			}, {
				"Code": "1679",
				"Name": "东段开发区"
			}, {
				"Code": "1678",
				"Name": "东段"
			}, {
				"Code": "1677",
				"Name": "堂二里镇"
			}, {
				"Code": "1676",
				"Name": "辛章乡"
			}, {
				"Code": "1675",
				"Name": "岔河集乡"
			}, {
				"Code": "1674",
				"Name": "南孟镇"
			}, {
				"Code": "1673",
				"Name": "东杨庄乡"
			}, {
				"Code": "1672",
				"Name": "煎荼铺镇"
			}, {
				"Code": "1671",
				"Name": "康仙庄乡"
			}, {
				"Code": "1670",
				"Name": "霸州镇"
			}, {
				"Code": "1669",
				"Name": "信安镇"
			}, {
				"Code": "1668",
				"Name": "南城区"
			}, {
				"Code": "1682",
				"Name": "中口乡"
			}],
			"sort": 10
		}],
		"sort": 5
	}, {
		"Code": "130006",
		"Name": "沧州市",
		"level": [{
			"Code": "130006",
			"Name": "新华区",
			"sort": 1
		}, {
			"Code": "130006",
			"Name": "任丘市",
			"sort": 2
		}, {
			"Code": "130006",
			"Name": "孟村回族自治县",
			"sort": 3
		}, {
			"Code": "130006",
			"Name": "献县",
			"sort": 4
		}, {
			"Code": "130006",
			"Name": "吴桥县",
			"sort": 5
		}, {
			"Code": "130006",
			"Name": "南皮县",
			"level": [{
				"Code": "4972",
				"Name": "刘八里乡"
			}, {
				"Code": "4973",
				"Name": "冯家口镇"
			}, {
				"Code": "4974",
				"Name": "城关镇"
			}, {
				"Code": "4975",
				"Name": "县城中心"
			}],
			"sort": 6
		}, {
			"Code": "130006",
			"Name": "肃宁县",
			"sort": 7
		}, {
			"Code": "130006",
			"Name": "盐山县",
			"sort": 8
		}, {
			"Code": "130006",
			"Name": "海兴县",
			"sort": 9
		}, {
			"Code": "130006",
			"Name": "东光县",
			"sort": 10
		}, {
			"Code": "130006",
			"Name": "运河区",
			"sort": 11
		}, {
			"Code": "130006",
			"Name": "沧州市经济技术开发区 ",
			"sort": 12
		}, {
			"Code": "130006",
			"Name": "河间市 ",
			"sort": 13
		}, {
			"Code": "130006",
			"Name": "泊头市",
			"level": [{
				"Code": "1712",
				"Name": "市中心"
			}, {
				"Code": "1713",
				"Name": "泊头工业园"
			}],
			"sort": 14
		}, {
			"Code": "130006",
			"Name": "沧县",
			"level": [{
				"Code": "1709",
				"Name": "纸房头工业区"
			}, {
				"Code": "1710",
				"Name": "薛官屯乡"
			}],
			"sort": 15
		}, {
			"Code": "130006",
			"Name": "青县",
			"level": [{
				"Code": "2122",
				"Name": "盘古镇"
			}, {
				"Code": "1704",
				"Name": "县城中心"
			}, {
				"Code": "1705",
				"Name": "马厂镇"
			}, {
				"Code": "1706",
				"Name": "兴济镇"
			}],
			"sort": 16
		}, {
			"Code": "130006",
			"Name": "黄骅市",
			"level": [{
				"Code": "1702",
				"Name": "市中心"
			}],
			"sort": 17
		}],
		"sort": 6
	}, {
		"Code": "130007",
		"Name": "保定市 ",
		"level": [{
			"Code": "130007",
			"Name": "新市区",
			"sort": 1
		}, {
			"Code": "130007",
			"Name": "南市区",
			"sort": 2
		}, {
			"Code": "130007",
			"Name": "涞水县",
			"sort": 3
		}, {
			"Code": "130007",
			"Name": "阜平县",
			"sort": 4
		}, {
			"Code": "130007",
			"Name": "唐县",
			"sort": 5
		}, {
			"Code": "130007",
			"Name": "涞源县",
			"sort": 6
		}, {
			"Code": "130007",
			"Name": "望都县",
			"sort": 7
		}, {
			"Code": "130007",
			"Name": "易县",
			"sort": 8
		}, {
			"Code": "130007",
			"Name": "曲阳县",
			"sort": 9
		}, {
			"Code": "130007",
			"Name": "顺平县",
			"sort": 10
		}, {
			"Code": "130007",
			"Name": "博野县",
			"sort": 11
		}, {
			"Code": "130007",
			"Name": "白沟县",
			"sort": 12
		}, {
			"Code": "130007",
			"Name": "北市区",
			"sort": 13
		}, {
			"Code": "130007",
			"Name": "高开区",
			"sort": 14
		}, {
			"Code": "130007",
			"Name": "安国市",
			"level": [{
				"Code": "1758",
				"Name": "市区"
			}],
			"sort": 15
		}, {
			"Code": "130007",
			"Name": "蠡县(里县)",
			"level": [{
				"Code": "2119",
				"Name": "城关镇(蠡吾镇)"
			}, {
				"Code": "2120",
				"Name": "百尺镇"
			}, {
				"Code": "1719",
				"Name": "留史镇"
			}, {
				"Code": "1720",
				"Name": "辛兴镇"
			}, {
				"Code": "1721",
				"Name": "晋庄乡"
			}, {
				"Code": "1722",
				"Name": "邢南乡"
			}],
			"sort": 16
		}, {
			"Code": "130007",
			"Name": "高阳县",
			"level": [{
				"Code": "4968",
				"Name": "城南开发区 "
			}, {
				"Code": "4969",
				"Name": "南沙工业区 "
			}, {
				"Code": "4970",
				"Name": "北沙工业区 "
			}, {
				"Code": "1725",
				"Name": "曲提乡"
			}, {
				"Code": "1726",
				"Name": "晋庄乡"
			}, {
				"Code": "1727",
				"Name": "邢南乡"
			}],
			"sort": 17
		}, {
			"Code": "130007",
			"Name": "雄县",
			"level": [{
				"Code": "1729",
				"Name": "县城中心"
			}, {
				"Code": "1730",
				"Name": "城关镇"
			}, {
				"Code": "1731",
				"Name": "龙湾乡"
			}, {
				"Code": "1732",
				"Name": "昝岗镇"
			}, {
				"Code": "1733",
				"Name": "朱各庄乡"
			}, {
				"Code": "1734",
				"Name": "雄州镇"
			}, {
				"Code": "1735",
				"Name": "龙湾镇"
			}, {
				"Code": "1736",
				"Name": "大营镇"
			}],
			"sort": 18
		}, {
			"Code": "130007",
			"Name": "高碑店市",
			"level": [{
				"Code": "1738",
				"Name": "市区"
			}, {
				"Code": "1739",
				"Name": "白沟镇"
			}],
			"sort": 19
		}, {
			"Code": "130007",
			"Name": "容城县",
			"level": [{
				"Code": "1741",
				"Name": "县城中心"
			}],
			"sort": 20
		}, {
			"Code": "130007",
			"Name": "安新县",
			"level": [{
				"Code": "1743",
				"Name": "县城中心"
			}, {
				"Code": "1744",
				"Name": "三台镇"
			}, {
				"Code": "1745",
				"Name": "小里镇"
			}],
			"sort": 21
		}, {
			"Code": "130007",
			"Name": "徐水县",
			"level": [{
				"Code": "1747",
				"Name": "县城中心"
			}],
			"sort": 22
		}, {
			"Code": "130007",
			"Name": "定州市",
			"level": [{
				"Code": "1749",
				"Name": "市区"
			}],
			"sort": 23
		}, {
			"Code": "130007",
			"Name": "满城县",
			"level": [{
				"Code": "1751",
				"Name": "县城中心"
			}],
			"sort": 24
		}, {
			"Code": "130007",
			"Name": "定兴县",
			"level": [{
				"Code": "1754",
				"Name": "县城中心"
			}],
			"sort": 25
		}, {
			"Code": "130007",
			"Name": "涿州市",
			"level": [{
				"Code": "1756",
				"Name": "市区"
			}],
			"sort": 26
		}, {
			"Code": "130007",
			"Name": "清苑县",
			"level": [{
				"Code": "1760",
				"Name": "闫庄乡"
			}],
			"sort": 27
		}],
		"sort": 7
	}, {
		"Code": "130008",
		"Name": "邢台市 ",
		"level": [{
			"Code": "130008",
			"Name": "桥东区",
			"sort": 1
		}, {
			"Code": "130008",
			"Name": "临西县",
			"sort": 2
		}, {
			"Code": "130008",
			"Name": "威县",
			"sort": 3
		}, {
			"Code": "130008",
			"Name": "平乡县",
			"sort": 4
		}, {
			"Code": "130008",
			"Name": "广宗县",
			"sort": 5
		}, {
			"Code": "130008",
			"Name": "巨鹿县",
			"sort": 6
		}, {
			"Code": "130008",
			"Name": "南和县",
			"sort": 7
		}, {
			"Code": "130008",
			"Name": "任县",
			"sort": 8
		}, {
			"Code": "130008",
			"Name": "隆尧县",
			"sort": 9
		}, {
			"Code": "130008",
			"Name": "柏乡县",
			"sort": 10
		}, {
			"Code": "130008",
			"Name": "内丘县",
			"sort": 11
		}, {
			"Code": "130008",
			"Name": "临城县",
			"sort": 12
		}, {
			"Code": "130008",
			"Name": "邢台县",
			"sort": 13
		}, {
			"Code": "130008",
			"Name": "桥西区",
			"sort": 14
		}, {
			"Code": "130008",
			"Name": "沙河市 ",
			"sort": 15
		}, {
			"Code": "130008",
			"Name": "新河县",
			"level": [{
				"Code": "1773",
				"Name": "县城中心"
			}],
			"sort": 16
		}, {
			"Code": "130008",
			"Name": "南宫市",
			"level": [{
				"Code": "1771",
				"Name": "段芦头工业区"
			}],
			"sort": 17
		}, {
			"Code": "130008",
			"Name": "清河县",
			"level": [{
				"Code": "1768",
				"Name": "县城中心"
			}, {
				"Code": "1769",
				"Name": "王官庄乡"
			}],
			"sort": 18
		}, {
			"Code": "130008",
			"Name": "宁晋县",
			"level": [{
				"Code": "1766",
				"Name": "西城开发区"
			}],
			"sort": 19
		}],
		"sort": 8
	}, {
		"Code": "130009",
		"Name": "邯郸市 ",
		"level": [{
			"Code": "130009",
			"Name": "邯山区",
			"sort": 1
		}, {
			"Code": "130009",
			"Name": "广平县",
			"sort": 2
		}, {
			"Code": "130009",
			"Name": "邱县",
			"sort": 3
		}, {
			"Code": "130009",
			"Name": "鸡泽县",
			"sort": 4
		}, {
			"Code": "130009",
			"Name": "馆陶县",
			"sort": 5
		}, {
			"Code": "130009",
			"Name": "魏县",
			"sort": 6
		}, {
			"Code": "130009",
			"Name": "曲周县",
			"sort": 7
		}, {
			"Code": "130009",
			"Name": "武安市",
			"sort": 8
		}, {
			"Code": "130009",
			"Name": "邯郸市经济技术开发区 ",
			"sort": 9
		}, {
			"Code": "130009",
			"Name": "肥乡县",
			"sort": 10
		}, {
			"Code": "130009",
			"Name": "磁县",
			"sort": 11
		}, {
			"Code": "130009",
			"Name": "涉县",
			"sort": 12
		}, {
			"Code": "130009",
			"Name": "丛台区",
			"sort": 13
		}, {
			"Code": "130009",
			"Name": "复兴区",
			"sort": 14
		}, {
			"Code": "130009",
			"Name": "峰峰矿区",
			"sort": 15
		}, {
			"Code": "130009",
			"Name": "邯郸县",
			"sort": 16
		}, {
			"Code": "130009",
			"Name": "临漳县",
			"sort": 17
		}, {
			"Code": "130009",
			"Name": "大名县",
			"sort": 18
		}, {
			"Code": "130009",
			"Name": "马庄工业区 ",
			"sort": 19
		}, {
			"Code": "130009",
			"Name": "永年县",
			"level": [{
				"Code": "1783",
				"Name": "县城中心"
			}, {
				"Code": "1784",
				"Name": "临洺关镇"
			}],
			"sort": 20
		}, {
			"Code": "130009",
			"Name": "成安县",
			"level": [{
				"Code": "1781",
				"Name": "县城中心"
			}],
			"sort": 21
		}],
		"sort": 9
	}, {
		"Code": "130010",
		"Name": "秦皇岛市 ",
		"level": [{
			"Code": "130010",
			"Name": "秦皇岛经济技术开发区",
			"sort": 1
		}, {
			"Code": "130010",
			"Name": "海港区",
			"sort": 2
		}, {
			"Code": "130010",
			"Name": "山海关区",
			"sort": 3
		}, {
			"Code": "130010",
			"Name": "北戴河区",
			"sort": 4
		}, {
			"Code": "130010",
			"Name": "卢龙县",
			"sort": 5
		}, {
			"Code": "130010",
			"Name": "青龙满族自治县",
			"sort": 6
		}, {
			"Code": "130010",
			"Name": "昌黎县",
			"level": [{
				"Code": "1791",
				"Name": "县城中心"
			}],
			"sort": 7
		}, {
			"Code": "130010",
			"Name": "抚宁县",
			"level": [{
				"Code": "2118",
				"Name": "留守营镇"
			}, {
				"Code": "1793",
				"Name": "县城中心"
			}, {
				"Code": "1794",
				"Name": "榆关镇"
			}],
			"sort": 8
		}],
		"sort": 10
	}, {
		"Code": "130011",
		"Name": "唐山市",
		"level": [{
			"Code": "130011",
			"Name": "高新技术开发区",
			"sort": 1
		}, {
			"Code": "130011",
			"Name": "遵化市",
			"sort": 2
		}, {
			"Code": "130011",
			"Name": "唐海县",
			"sort": 3
		}, {
			"Code": "130011",
			"Name": "迁西县",
			"sort": 4
		}, {
			"Code": "130011",
			"Name": "乐亭县",
			"sort": 5
		}, {
			"Code": "130011",
			"Name": "滦南县",
			"sort": 6
		}, {
			"Code": "130011",
			"Name": "滦县",
			"sort": 7
		}, {
			"Code": "130011",
			"Name": "丰润区",
			"sort": 8
		}, {
			"Code": "130011",
			"Name": "丰南区",
			"sort": 9
		}, {
			"Code": "130011",
			"Name": "开平区",
			"sort": 10
		}, {
			"Code": "130011",
			"Name": "古冶区",
			"sort": 11
		}, {
			"Code": "130011",
			"Name": "路北区",
			"sort": 12
		}, {
			"Code": "130011",
			"Name": "路南区",
			"sort": 13
		}, {
			"Code": "130011",
			"Name": "迁安市",
			"sort": 14
		}, {
			"Code": "130011",
			"Name": "玉田县",
			"level": [{
				"Code": "4963",
				"Name": "石臼窝镇"
			}, {
				"Code": "1803",
				"Name": "县城中心"
			}, {
				"Code": "1804",
				"Name": "林南仓镇"
			}, {
				"Code": "1806",
				"Name": "鸦鸿桥镇"
			}, {
				"Code": "1807",
				"Name": "杨家板桥镇"
			}, {
				"Code": "1808",
				"Name": "红桥镇"
			}],
			"sort": 15
		}],
		"sort": 11
	}, {
		"Code": "130012",
		"Name": "石家庄市",
		"level": [{
			"Code": "130012",
			"Name": "桥东区",
			"sort": 1
		}, {
			"Code": "130012",
			"Name": "新华区",
			"sort": 2
		}, {
			"Code": "130012",
			"Name": "裕华区",
			"sort": 3
		}, {
			"Code": "130012",
			"Name": "长安区",
			"sort": 4
		}, {
			"Code": "130012",
			"Name": "井陉县",
			"sort": 5
		}, {
			"Code": "130012",
			"Name": "行唐县",
			"sort": 6
		}, {
			"Code": "130012",
			"Name": "高邑县",
			"sort": 7
		}, {
			"Code": "130012",
			"Name": "深泽县",
			"sort": 8
		}, {
			"Code": "130012",
			"Name": "赞皇县",
			"sort": 9
		}, {
			"Code": "130012",
			"Name": "平山县",
			"sort": 10
		}, {
			"Code": "130012",
			"Name": "桥西区",
			"sort": 11
		}, {
			"Code": "130012",
			"Name": "石家庄经济技术开发区 ",
			"sort": 12
		}, {
			"Code": "130012",
			"Name": "元氏县",
			"level": [{
				"Code": "1653",
				"Name": "县城中心"
			}],
			"sort": 13
		}, {
			"Code": "130012",
			"Name": "鹿泉市",
			"level": [{
				"Code": "2108",
				"Name": "鹿泉市经济技术开发区"
			}, {
				"Code": "1615",
				"Name": "上庄镇"
			}, {
				"Code": "1616",
				"Name": "铜冶镇"
			}, {
				"Code": "1617",
				"Name": "寺家庄镇"
			}],
			"sort": 14
		}, {
			"Code": "130012",
			"Name": "辛集市",
			"level": [{
				"Code": "2109",
				"Name": "田庄乡"
			}, {
				"Code": "2110",
				"Name": "锚营制革工业区"
			}],
			"sort": 15
		}, {
			"Code": "130012",
			"Name": "晋州市",
			"level": [{
				"Code": "1622",
				"Name": "马于镇"
			}, {
				"Code": "1623",
				"Name": "东卓宿乡"
			}, {
				"Code": "1624",
				"Name": "东寺吕乡"
			}, {
				"Code": "1625",
				"Name": "总十庄镇"
			}, {
				"Code": "1626",
				"Name": "东里庄乡"
			}, {
				"Code": "1627",
				"Name": "槐树镇"
			}, {
				"Code": "1628",
				"Name": "祁底镇"
			}],
			"sort": 16
		}, {
			"Code": "130012",
			"Name": "新乐市",
			"level": [{
				"Code": "1631",
				"Name": "长寿镇"
			}, {
				"Code": "1632",
				"Name": "承安铺镇"
			}],
			"sort": 17
		}, {
			"Code": "130012",
			"Name": "正定县",
			"level": [{
				"Code": "1635",
				"Name": "诸福屯镇"
			}, {
				"Code": "1636",
				"Name": "新城铺镇"
			}, {
				"Code": "1637",
				"Name": "南牛镇"
			}],
			"sort": 18
		}, {
			"Code": "130012",
			"Name": "无极县",
			"level": [{
				"Code": "1639",
				"Name": "无极镇(城关镇)"
			}, {
				"Code": "1640",
				"Name": "张段固镇"
			}, {
				"Code": "1641",
				"Name": "郝庄镇"
			}, {
				"Code": "1642",
				"Name": "东候坊镇"
			}],
			"sort": 19
		}, {
			"Code": "130012",
			"Name": "藁城市",
			"level": [{
				"Code": "1644",
				"Name": "市区"
			}, {
				"Code": "1645",
				"Name": "良村经济技术开发区"
			}],
			"sort": 20
		}, {
			"Code": "130012",
			"Name": "栾城县",
			"level": [{
				"Code": "1648",
				"Name": "楼底镇"
			}, {
				"Code": "1649",
				"Name": "窦妪镇"
			}],
			"sort": 21
		}, {
			"Code": "130012",
			"Name": "灵寿县",
			"level": [{
				"Code": "1651",
				"Name": "县城中心"
			}],
			"sort": 22
		}, {
			"Code": "130012",
			"Name": "赵县",
			"level": [{
				"Code": "1655",
				"Name": "县城中心"
			}, {
				"Code": "1656",
				"Name": "新寨店工业区"
			}, {
				"Code": "1657",
				"Name": "固城工业区"
			}],
			"sort": 23
		}],
		"sort": 12
	}]
}, {
	"Code": "140000",
	"Name": "山西省",
	"level": [{
		"Code": "140001",
		"Name": "临汾市",
		"level": [{
			"Code": "140001",
			"Name": "尧都区 ",
			"sort": 1
		}, {
			"Code": "140001",
			"Name": "侯马市",
			"sort": 2
		}, {
			"Code": "140001",
			"Name": "汾西县",
			"sort": 3
		}, {
			"Code": "140001",
			"Name": "蒲县",
			"sort": 4
		}, {
			"Code": "140001",
			"Name": "永和县",
			"sort": 5
		}, {
			"Code": "140001",
			"Name": "隰县",
			"sort": 6
		}, {
			"Code": "140001",
			"Name": "大宁县",
			"sort": 7
		}, {
			"Code": "140001",
			"Name": "乡宁县",
			"sort": 8
		}, {
			"Code": "140001",
			"Name": "吉县",
			"sort": 9
		}, {
			"Code": "140001",
			"Name": "浮山县",
			"sort": 10
		}, {
			"Code": "140001",
			"Name": "安泽县",
			"sort": 11
		}, {
			"Code": "140001",
			"Name": "古县",
			"sort": 12
		}, {
			"Code": "140001",
			"Name": "洪洞县",
			"sort": 13
		}, {
			"Code": "140001",
			"Name": "襄汾县",
			"sort": 14
		}, {
			"Code": "140001",
			"Name": "翼城县",
			"sort": 15
		}, {
			"Code": "140001",
			"Name": "曲沃县",
			"sort": 16
		}, {
			"Code": "140001",
			"Name": "霍州市",
			"sort": 17
		}],
		"sort": 1
	}, {
		"Code": "140002",
		"Name": "吕梁市",
		"level": [{
			"Code": "140002",
			"Name": "离石区",
			"sort": 1
		}, {
			"Code": "140002",
			"Name": "孝义市",
			"sort": 2
		}, {
			"Code": "140002",
			"Name": "交口县",
			"sort": 3
		}, {
			"Code": "140002",
			"Name": "中阳县",
			"sort": 4
		}, {
			"Code": "140002",
			"Name": "方山县",
			"sort": 5
		}, {
			"Code": "140002",
			"Name": "岚县",
			"sort": 6
		}, {
			"Code": "140002",
			"Name": "石楼县",
			"sort": 7
		}, {
			"Code": "140002",
			"Name": "柳林县",
			"sort": 8
		}, {
			"Code": "140002",
			"Name": "临县",
			"sort": 9
		}, {
			"Code": "140002",
			"Name": "兴县",
			"sort": 10
		}, {
			"Code": "140002",
			"Name": "交城县",
			"sort": 11
		}, {
			"Code": "140002",
			"Name": "文水县",
			"sort": 12
		}, {
			"Code": "140002",
			"Name": "汾阳市",
			"sort": 13
		}],
		"sort": 2
	}, {
		"Code": "140003",
		"Name": "忻州市",
		"level": [{
			"Code": "140003",
			"Name": "忻府区",
			"sort": 1
		}, {
			"Code": "140003",
			"Name": "偏关县",
			"sort": 2
		}, {
			"Code": "140003",
			"Name": "保德县",
			"sort": 3
		}, {
			"Code": "140003",
			"Name": "河曲县",
			"sort": 4
		}, {
			"Code": "140003",
			"Name": "岢岚县",
			"sort": 5
		}, {
			"Code": "140003",
			"Name": "五寨县",
			"sort": 6
		}, {
			"Code": "140003",
			"Name": "神池县",
			"sort": 7
		}, {
			"Code": "140003",
			"Name": "静乐县",
			"sort": 8
		}, {
			"Code": "140003",
			"Name": "宁武县",
			"sort": 9
		}, {
			"Code": "140003",
			"Name": "繁峙县",
			"sort": 10
		}, {
			"Code": "140003",
			"Name": "代县",
			"sort": 11
		}, {
			"Code": "140003",
			"Name": "五台县",
			"sort": 12
		}, {
			"Code": "140003",
			"Name": "定襄县",
			"sort": 13
		}, {
			"Code": "140003",
			"Name": "原平市",
			"sort": 14
		}],
		"sort": 3
	}, {
		"Code": "140004",
		"Name": "运城市",
		"level": [{
			"Code": "140004",
			"Name": "盐湖区",
			"sort": 1
		}, {
			"Code": "140004",
			"Name": "永济市",
			"sort": 2
		}, {
			"Code": "140004",
			"Name": "芮城县",
			"sort": 3
		}, {
			"Code": "140004",
			"Name": "平陆县",
			"sort": 4
		}, {
			"Code": "140004",
			"Name": "夏县",
			"sort": 5
		}, {
			"Code": "140004",
			"Name": "垣曲县",
			"sort": 6
		}, {
			"Code": "140004",
			"Name": "绛县",
			"sort": 7
		}, {
			"Code": "140004",
			"Name": "新绛县",
			"sort": 8
		}, {
			"Code": "140004",
			"Name": "稷山县",
			"sort": 9
		}, {
			"Code": "140004",
			"Name": "闻喜县",
			"sort": 10
		}, {
			"Code": "140004",
			"Name": "万荣县",
			"sort": 11
		}, {
			"Code": "140004",
			"Name": "临猗县",
			"sort": 12
		}, {
			"Code": "140004",
			"Name": "河津市",
			"sort": 13
		}],
		"sort": 4
	}, {
		"Code": "140005",
		"Name": "朔州市",
		"level": [{
			"Code": "140005",
			"Name": "朔城区",
			"sort": 1
		}, {
			"Code": "140005",
			"Name": "平鲁区",
			"sort": 2
		}, {
			"Code": "140005",
			"Name": "山阴县",
			"sort": 3
		}, {
			"Code": "140005",
			"Name": "应县",
			"sort": 4
		}, {
			"Code": "140005",
			"Name": "右玉县",
			"sort": 5
		}, {
			"Code": "140005",
			"Name": "怀仁县",
			"sort": 6
		}],
		"sort": 5
	}, {
		"Code": "140006",
		"Name": "晋城市",
		"level": [{
			"Code": "140006",
			"Name": "城区",
			"sort": 1
		}, {
			"Code": "140006",
			"Name": "沁水县",
			"sort": 2
		}, {
			"Code": "140006",
			"Name": "阳城县",
			"sort": 3
		}, {
			"Code": "140006",
			"Name": "陵川县",
			"sort": 4
		}, {
			"Code": "140006",
			"Name": "泽州县",
			"sort": 5
		}, {
			"Code": "140006",
			"Name": "高平市",
			"sort": 6
		}],
		"sort": 6
	}, {
		"Code": "140007",
		"Name": "长治市",
		"level": [{
			"Code": "140007",
			"Name": "长治县",
			"sort": 1
		}, {
			"Code": "140007",
			"Name": "潞城市",
			"sort": 2
		}, {
			"Code": "140007",
			"Name": "沁源县",
			"sort": 3
		}, {
			"Code": "140007",
			"Name": "沁县",
			"sort": 4
		}, {
			"Code": "140007",
			"Name": "武乡县",
			"sort": 5
		}, {
			"Code": "140007",
			"Name": "长子县",
			"sort": 6
		}, {
			"Code": "140007",
			"Name": "壶关县",
			"sort": 7
		}, {
			"Code": "140007",
			"Name": "黎城县",
			"sort": 8
		}, {
			"Code": "140007",
			"Name": "平顺县",
			"sort": 9
		}, {
			"Code": "140007",
			"Name": "屯留县",
			"sort": 10
		}, {
			"Code": "140007",
			"Name": "襄垣县",
			"sort": 11
		}, {
			"Code": "140007",
			"Name": "城区",
			"sort": 12
		}],
		"sort": 7
	}, {
		"Code": "140008",
		"Name": "阳泉市",
		"level": [{
			"Code": "140008",
			"Name": "矿区",
			"sort": 1
		}, {
			"Code": "140008",
			"Name": "平定县",
			"sort": 2
		}, {
			"Code": "140008",
			"Name": "盂县",
			"sort": 3
		}],
		"sort": 8
	}, {
		"Code": "140009",
		"Name": "大同市",
		"level": [{
			"Code": "140009",
			"Name": "矿区",
			"sort": 1
		}, {
			"Code": "140009",
			"Name": "大同县",
			"sort": 2
		}, {
			"Code": "140009",
			"Name": "左云县",
			"sort": 3
		}, {
			"Code": "140009",
			"Name": "浑源县",
			"sort": 4
		}, {
			"Code": "140009",
			"Name": "灵丘县",
			"sort": 5
		}, {
			"Code": "140009",
			"Name": "广灵县",
			"sort": 6
		}, {
			"Code": "140009",
			"Name": "天镇县",
			"sort": 7
		}, {
			"Code": "140009",
			"Name": "阳高县",
			"sort": 8
		}, {
			"Code": "140009",
			"Name": "新荣区",
			"sort": 9
		}, {
			"Code": "140009",
			"Name": "南郊区",
			"sort": 10
		}, {
			"Code": "140009",
			"Name": "城区",
			"sort": 11
		}],
		"sort": 9
	}, {
		"Code": "140010",
		"Name": "晋中市",
		"level": [{
			"Code": "140010",
			"Name": "介休市",
			"sort": 1
		}, {
			"Code": "140010",
			"Name": "灵石县",
			"sort": 2
		}, {
			"Code": "140010",
			"Name": "平遥县",
			"sort": 3
		}, {
			"Code": "140010",
			"Name": "祁县",
			"sort": 4
		}, {
			"Code": "140010",
			"Name": "太谷县",
			"sort": 5
		}, {
			"Code": "140010",
			"Name": "寿阳县",
			"sort": 6
		}, {
			"Code": "140010",
			"Name": "昔阳县",
			"sort": 7
		}, {
			"Code": "140010",
			"Name": "和顺县",
			"sort": 8
		}, {
			"Code": "140010",
			"Name": "左权县",
			"sort": 9
		}, {
			"Code": "140010",
			"Name": "榆社县",
			"sort": 10
		}, {
			"Code": "140010",
			"Name": "榆次区",
			"sort": 11
		}],
		"sort": 10
	}, {
		"Code": "140011",
		"Name": "太原市",
		"level": [{
			"Code": "140011",
			"Name": "高新技术产业开发区 ",
			"sort": 1
		}, {
			"Code": "140011",
			"Name": "古交市",
			"sort": 2
		}, {
			"Code": "140011",
			"Name": "娄烦县",
			"sort": 3
		}, {
			"Code": "140011",
			"Name": "阳曲县",
			"sort": 4
		}, {
			"Code": "140011",
			"Name": "清徐县",
			"sort": 5
		}, {
			"Code": "140011",
			"Name": "晋源区",
			"sort": 6
		}, {
			"Code": "140011",
			"Name": "尖草坪区",
			"sort": 7
		}, {
			"Code": "140011",
			"Name": "万柏林区",
			"sort": 8
		}, {
			"Code": "140011",
			"Name": "杏花岭区",
			"sort": 9
		}, {
			"Code": "140011",
			"Name": "小店区",
			"sort": 10
		}, {
			"Code": "140011",
			"Name": "迎泽区",
			"sort": 11
		}],
		"sort": 11
	}]
}, {
	"Code": "150000",
	"Name": "内蒙古自治区",
	"level": [{
		"Code": "150001",
		"Name": "呼和浩特市",
		"level": [{
			"Code": "150001",
			"Name": "武川县",
			"sort": 1
		}, {
			"Code": "150001",
			"Name": "如意开发区",
			"sort": 2
		}, {
			"Code": "150001",
			"Name": "金桥开发区",
			"sort": 3
		}, {
			"Code": "150001",
			"Name": "金川开发区",
			"sort": 4
		}, {
			"Code": "150001",
			"Name": "和林格尔县",
			"level": [{
				"Code": "2141",
				"Name": "盛乐工业园区"
			}],
			"sort": 5
		}, {
			"Code": "150001",
			"Name": "新城区",
			"sort": 6
		}, {
			"Code": "150001",
			"Name": "赛罕区",
			"sort": 7
		}, {
			"Code": "150001",
			"Name": "托克托县",
			"sort": 8
		}, {
			"Code": "150001",
			"Name": "回民区",
			"sort": 9
		}, {
			"Code": "150001",
			"Name": "土默特左旗",
			"sort": 10
		}, {
			"Code": "150001",
			"Name": "新城区",
			"sort": 11
		}, {
			"Code": "150001",
			"Name": "玉泉区",
			"sort": 12
		}, {
			"Code": "150001",
			"Name": "鸿盛高科技园区",
			"sort": 13
		}],
		"sort": 1
	}, {
		"Code": "150002",
		"Name": "阿拉善盟",
		"level": [{
			"Code": "150002",
			"Name": "阿拉善左旗",
			"sort": 1
		}, {
			"Code": "150002",
			"Name": "阿拉善右旗",
			"sort": 2
		}, {
			"Code": "150002",
			"Name": "额济纳旗",
			"sort": 3
		}],
		"sort": 2
	}, {
		"Code": "150003",
		"Name": "锡林郭勒盟",
		"level": [{
			"Code": "150003",
			"Name": "二连浩特市",
			"sort": 1
		}, {
			"Code": "150003",
			"Name": "正蓝旗",
			"sort": 2
		}, {
			"Code": "150003",
			"Name": "正镶白旗",
			"sort": 3
		}, {
			"Code": "150003",
			"Name": "镶黄旗",
			"sort": 4
		}, {
			"Code": "150003",
			"Name": "太仆寺旗",
			"sort": 5
		}, {
			"Code": "150003",
			"Name": "西乌珠穆沁旗",
			"sort": 6
		}, {
			"Code": "150003",
			"Name": "东乌珠穆沁旗",
			"sort": 7
		}, {
			"Code": "150003",
			"Name": "苏尼特右旗",
			"sort": 8
		}, {
			"Code": "150003",
			"Name": "苏尼特左旗",
			"sort": 9
		}, {
			"Code": "150003",
			"Name": "阿巴嘎旗",
			"sort": 10
		}, {
			"Code": "150003",
			"Name": "锡林浩特市",
			"sort": 11
		}, {
			"Code": "150003",
			"Name": "多伦县",
			"sort": 12
		}],
		"sort": 3
	}, {
		"Code": "150004",
		"Name": "兴安盟",
		"level": [{
			"Code": "150004",
			"Name": "乌兰浩特市 ",
			"sort": 1
		}, {
			"Code": "150004",
			"Name": "阿尔山市",
			"sort": 2
		}, {
			"Code": "150004",
			"Name": "科尔沁右翼前旗",
			"sort": 3
		}, {
			"Code": "150004",
			"Name": "科尔沁右翼中旗",
			"sort": 4
		}, {
			"Code": "150004",
			"Name": "扎赉特旗",
			"sort": 5
		}, {
			"Code": "150004",
			"Name": "突泉县",
			"sort": 6
		}],
		"sort": 4
	}, {
		"Code": "150005",
		"Name": "乌兰察布市",
		"level": [{
			"Code": "150005",
			"Name": "集宁区",
			"sort": 1
		}, {
			"Code": "150005",
			"Name": "四子王旗",
			"sort": 2
		}, {
			"Code": "150005",
			"Name": "察哈尔右翼后旗",
			"sort": 3
		}, {
			"Code": "150005",
			"Name": "察哈尔右翼中旗",
			"sort": 4
		}, {
			"Code": "150005",
			"Name": "察哈尔右翼前旗",
			"sort": 5
		}, {
			"Code": "150005",
			"Name": "凉城县",
			"sort": 6
		}, {
			"Code": "150005",
			"Name": "兴和县",
			"sort": 7
		}, {
			"Code": "150005",
			"Name": "商都县",
			"sort": 8
		}, {
			"Code": "150005",
			"Name": "化德县",
			"sort": 9
		}, {
			"Code": "150005",
			"Name": "卓资县",
			"sort": 10
		}, {
			"Code": "150005",
			"Name": "丰镇市",
			"sort": 11
		}],
		"sort": 5
	}, {
		"Code": "150006",
		"Name": "巴彦淖尔市",
		"level": [{
			"Code": "150006",
			"Name": "临河区",
			"sort": 1
		}, {
			"Code": "150006",
			"Name": "五原县",
			"sort": 2
		}, {
			"Code": "150006",
			"Name": "磴口县",
			"sort": 3
		}, {
			"Code": "150006",
			"Name": "乌拉特前旗",
			"sort": 4
		}, {
			"Code": "150006",
			"Name": "乌拉特中旗",
			"sort": 5
		}, {
			"Code": "150006",
			"Name": "乌拉特后旗",
			"sort": 6
		}, {
			"Code": "150006",
			"Name": "杭锦后旗 ",
			"sort": 7
		}, {
			"Code": "150006",
			"Name": "临河市",
			"sort": 8
		}],
		"sort": 6
	}, {
		"Code": "150007",
		"Name": "呼伦贝尔市",
		"level": [{
			"Code": "150007",
			"Name": "海拉尔区",
			"sort": 1
		}, {
			"Code": "150007",
			"Name": "额尔古纳市",
			"sort": 2
		}, {
			"Code": "150007",
			"Name": "扎兰屯市",
			"sort": 3
		}, {
			"Code": "150007",
			"Name": "牙克石市",
			"sort": 4
		}, {
			"Code": "150007",
			"Name": "满洲里市",
			"sort": 5
		}, {
			"Code": "150007",
			"Name": "新巴尔虎右旗",
			"sort": 6
		}, {
			"Code": "150007",
			"Name": "新巴尔虎左旗",
			"sort": 7
		}, {
			"Code": "150007",
			"Name": "陈巴尔虎旗",
			"sort": 8
		}, {
			"Code": "150007",
			"Name": "鄂温克族自治旗",
			"sort": 9
		}, {
			"Code": "150007",
			"Name": "鄂伦春自治旗",
			"sort": 10
		}, {
			"Code": "150007",
			"Name": "莫力达瓦达斡尔族自治旗",
			"sort": 11
		}, {
			"Code": "150007",
			"Name": "阿荣旗",
			"sort": 12
		}, {
			"Code": "150007",
			"Name": "根河市",
			"sort": 13
		}],
		"sort": 7
	}, {
		"Code": "150008",
		"Name": "鄂尔多斯市",
		"level": [{
			"Code": "150008",
			"Name": "东胜区 ",
			"sort": 1
		}, {
			"Code": "150008",
			"Name": "达拉特旗",
			"sort": 2
		}, {
			"Code": "150008",
			"Name": "准格尔旗",
			"sort": 3
		}, {
			"Code": "150008",
			"Name": "鄂托克前旗",
			"sort": 4
		}, {
			"Code": "150008",
			"Name": "鄂托克旗",
			"sort": 5
		}, {
			"Code": "150008",
			"Name": "杭锦旗",
			"sort": 6
		}, {
			"Code": "150008",
			"Name": "乌审旗",
			"sort": 7
		}, {
			"Code": "150008",
			"Name": "伊金霍洛旗",
			"sort": 8
		}],
		"sort": 8
	}, {
		"Code": "150009",
		"Name": "通辽市",
		"level": [{
			"Code": "150009",
			"Name": "科尔沁区",
			"sort": 1
		}, {
			"Code": "150009",
			"Name": "科尔沁左翼中旗",
			"sort": 2
		}, {
			"Code": "150009",
			"Name": "科尔沁左翼后旗",
			"sort": 3
		}, {
			"Code": "150009",
			"Name": "开鲁县",
			"sort": 4
		}, {
			"Code": "150009",
			"Name": "库伦旗",
			"sort": 5
		}, {
			"Code": "150009",
			"Name": "奈曼旗",
			"sort": 6
		}, {
			"Code": "150009",
			"Name": "扎鲁特旗",
			"sort": 7
		}, {
			"Code": "150009",
			"Name": "霍林郭勒市",
			"sort": 8
		}],
		"sort": 9
	}, {
		"Code": "150010",
		"Name": "赤峰市",
		"level": [{
			"Code": "150010",
			"Name": "红山区",
			"sort": 1
		}, {
			"Code": "150010",
			"Name": "敖汉旗",
			"sort": 2
		}, {
			"Code": "150010",
			"Name": "宁城县",
			"sort": 3
		}, {
			"Code": "150010",
			"Name": "喀喇沁旗",
			"sort": 4
		}, {
			"Code": "150010",
			"Name": "翁牛特旗",
			"sort": 5
		}, {
			"Code": "150010",
			"Name": "克什克腾旗",
			"sort": 6
		}, {
			"Code": "150010",
			"Name": "林西县",
			"sort": 7
		}, {
			"Code": "150010",
			"Name": "巴林右旗",
			"sort": 8
		}, {
			"Code": "150010",
			"Name": "巴林左旗",
			"sort": 9
		}, {
			"Code": "150010",
			"Name": "阿鲁科尔沁旗",
			"sort": 10
		}, {
			"Code": "150010",
			"Name": "松山区",
			"sort": 11
		}, {
			"Code": "150010",
			"Name": "元宝山区",
			"sort": 12
		}, {
			"Code": "150010",
			"Name": "新城区",
			"sort": 13
		}],
		"sort": 10
	}, {
		"Code": "150011",
		"Name": "乌海市",
		"level": [{
			"Code": "150011",
			"Name": "海勃湾区",
			"sort": 1
		}, {
			"Code": "150011",
			"Name": "海南区",
			"sort": 2
		}, {
			"Code": "150011",
			"Name": "乌达区",
			"sort": 3
		}],
		"sort": 11
	}, {
		"Code": "150012",
		"Name": "包头市",
		"level": [{
			"Code": "150012",
			"Name": "东河区",
			"sort": 1
		}, {
			"Code": "150012",
			"Name": "昆都仑区",
			"sort": 2
		}, {
			"Code": "150012",
			"Name": "青山区",
			"sort": 3
		}, {
			"Code": "150012",
			"Name": "石拐区",
			"sort": 4
		}, {
			"Code": "150012",
			"Name": "白云矿区",
			"sort": 5
		}, {
			"Code": "150012",
			"Name": "九原区",
			"sort": 6
		}, {
			"Code": "150012",
			"Name": "土默特右旗",
			"sort": 7
		}, {
			"Code": "150012",
			"Name": "固阳县",
			"sort": 8
		}, {
			"Code": "150012",
			"Name": "达尔罕茂明安联合旗",
			"sort": 9
		}],
		"sort": 12
	}, {
		"Code": "150013",
		"Name": "乌兰浩特市",
		"sort": 13,
		"level": [{
			"Code": "150013",
			"Name": "--",
			"sort": 1
		}]
	}]
}, {
	"Code": "210000",
	"Name": "辽宁省",
	"level": [{
		"Code": "210001",
		"Name": "海城市",
		"sort": 1,
		"level": [{
			"Code": "210001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "210002",
		"Name": "北票市",
		"sort": 2,
		"level": [{
			"Code": "210002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "210003",
		"Name": "朝阳市",
		"level": [{
			"Code": "210003",
			"Name": "双塔区",
			"sort": 1
		}, {
			"Code": "210003",
			"Name": "龙城区",
			"sort": 2
		}, {
			"Code": "210003",
			"Name": "朝阳县",
			"sort": 3
		}, {
			"Code": "210003",
			"Name": "建平县",
			"sort": 4
		}, {
			"Code": "210003",
			"Name": "喀喇沁左翼蒙古族自治县",
			"sort": 5
		}, {
			"Code": "210003",
			"Name": "北票市",
			"sort": 6
		}, {
			"Code": "210003",
			"Name": "凌源市",
			"sort": 7
		}],
		"sort": 3
	}, {
		"Code": "210004",
		"Name": "阜新市",
		"level": [{
			"Code": "210004",
			"Name": "海州区",
			"sort": 1
		}, {
			"Code": "210004",
			"Name": "新邱区",
			"sort": 2
		}, {
			"Code": "210004",
			"Name": "太平区",
			"sort": 3
		}, {
			"Code": "210004",
			"Name": "细河区",
			"sort": 4
		}, {
			"Code": "210004",
			"Name": "阜新蒙古族自治县",
			"sort": 5
		}, {
			"Code": "210004",
			"Name": "彰武县",
			"sort": 6
		}],
		"sort": 4
	}, {
		"Code": "210005",
		"Name": "葫芦岛市",
		"level": [{
			"Code": "210005",
			"Name": "连山区 ",
			"sort": 1
		}, {
			"Code": "210005",
			"Name": "龙港区",
			"sort": 2
		}, {
			"Code": "210005",
			"Name": "南票区",
			"sort": 3
		}, {
			"Code": "210005",
			"Name": "绥中县",
			"sort": 4
		}, {
			"Code": "210005",
			"Name": "建昌县",
			"sort": 5
		}, {
			"Code": "210005",
			"Name": "兴城市",
			"level": [{
				"Code": "1992",
				"Name": "市区"
			}],
			"sort": 6
		}],
		"sort": 5
	}, {
		"Code": "210006",
		"Name": "铁岭市",
		"level": [{
			"Code": "210006",
			"Name": "清河区",
			"sort": 1
		}, {
			"Code": "210006",
			"Name": "铁岭县",
			"sort": 2
		}, {
			"Code": "210006",
			"Name": "西丰县",
			"sort": 3
		}, {
			"Code": "210006",
			"Name": "昌图县",
			"sort": 4
		}, {
			"Code": "210006",
			"Name": "调兵山市",
			"sort": 5
		}, {
			"Code": "210006",
			"Name": "开原市",
			"sort": 6
		}, {
			"Code": "210006",
			"Name": "银州区",
			"sort": 7
		}],
		"sort": 6
	}, {
		"Code": "210007",
		"Name": "盘锦市",
		"level": [{
			"Code": "210007",
			"Name": "双台子区",
			"sort": 1
		}, {
			"Code": "210007",
			"Name": "兴隆台区",
			"sort": 2
		}, {
			"Code": "210007",
			"Name": "盘锦经济开发区",
			"sort": 3
		}, {
			"Code": "210007",
			"Name": "辽河油田高新产业园 ",
			"sort": 4
		}, {
			"Code": "210007",
			"Name": "大洼县",
			"level": [{
				"Code": "1895",
				"Name": "田家镇"
			}],
			"sort": 5
		}, {
			"Code": "210007",
			"Name": "盘山县",
			"level": [{
				"Code": "1897",
				"Name": "盘山县经济开发区"
			}],
			"sort": 6
		}],
		"sort": 7
	}, {
		"Code": "210008",
		"Name": "辽阳市",
		"level": [{
			"Code": "210008",
			"Name": "白塔区",
			"sort": 1
		}, {
			"Code": "210008",
			"Name": "文圣区",
			"sort": 2
		}, {
			"Code": "210008",
			"Name": "宏伟区",
			"sort": 3
		}, {
			"Code": "210008",
			"Name": "辽阳市高新技术产业开发区",
			"sort": 4
		}, {
			"Code": "210008",
			"Name": "太子河区",
			"sort": 5
		}, {
			"Code": "210008",
			"Name": "灯塔市",
			"level": [{
				"Code": "1905",
				"Name": "灯塔市区"
			}],
			"sort": 6
		}, {
			"Code": "210008",
			"Name": "辽阳县",
			"level": [{
				"Code": "1907",
				"Name": "兰家镇"
			}, {
				"Code": "1908",
				"Name": "首山镇"
			}],
			"sort": 7
		}],
		"sort": 8
	}, {
		"Code": "210009",
		"Name": "营口市",
		"level": [{
			"Code": "210009",
			"Name": "西市区",
			"sort": 1
		}, {
			"Code": "210009",
			"Name": "鲅鱼圈区",
			"sort": 2
		}, {
			"Code": "210009",
			"Name": "站前区",
			"sort": 3
		}, {
			"Code": "210009",
			"Name": "老边区",
			"sort": 4
		}, {
			"Code": "210009",
			"Name": "盖州市",
			"sort": 5
		}, {
			"Code": "210009",
			"Name": "大石桥市",
			"level": [{
				"Code": "1918",
				"Name": "大石桥市区"
			}],
			"sort": 6
		}],
		"sort": 9
	}, {
		"Code": "210010",
		"Name": "锦州市",
		"level": [{
			"Code": "210010",
			"Name": "北镇市",
			"sort": 1
		}, {
			"Code": "210010",
			"Name": "凌海市",
			"sort": 2
		}, {
			"Code": "210010",
			"Name": "义县",
			"sort": 3
		}, {
			"Code": "210010",
			"Name": "黑山县",
			"sort": 4
		}, {
			"Code": "210010",
			"Name": "经济技术开发区 ",
			"sort": 5
		}, {
			"Code": "210010",
			"Name": "凌河新区",
			"sort": 6
		}, {
			"Code": "210010",
			"Name": "凌南新区",
			"sort": 7
		}, {
			"Code": "210010",
			"Name": "太和区",
			"sort": 8
		}, {
			"Code": "210010",
			"Name": "凌河区",
			"sort": 9
		}, {
			"Code": "210010",
			"Name": "古塔区",
			"sort": 10
		}],
		"sort": 10
	}, {
		"Code": "210011",
		"Name": "丹东市",
		"level": [{
			"Code": "210011",
			"Name": "元宝区",
			"sort": 1
		}, {
			"Code": "210011",
			"Name": "振兴区",
			"sort": 2
		}, {
			"Code": "210011",
			"Name": "振安区",
			"sort": 3
		}, {
			"Code": "210011",
			"Name": "宽甸满族自治县",
			"sort": 4
		}, {
			"Code": "210011",
			"Name": "凤城市",
			"sort": 5
		}, {
			"Code": "210011",
			"Name": "东港市",
			"level": [{
				"Code": "1930",
				"Name": "大东区"
			}, {
				"Code": "1931",
				"Name": "北井子镇"
			}, {
				"Code": "1932",
				"Name": "长山子镇"
			}, {
				"Code": "1933",
				"Name": "汤池镇"
			}],
			"sort": 6
		}],
		"sort": 11
	}, {
		"Code": "210012",
		"Name": "本溪市",
		"level": [{
			"Code": "210012",
			"Name": "溪湖区 ",
			"sort": 1
		}, {
			"Code": "210012",
			"Name": "南芬区",
			"sort": 2
		}, {
			"Code": "210012",
			"Name": "本溪满族自治县",
			"sort": 3
		}, {
			"Code": "210012",
			"Name": "桓仁满族自治县",
			"sort": 4
		}, {
			"Code": "210012",
			"Name": "平山区",
			"sort": 5
		}, {
			"Code": "210012",
			"Name": "明山区",
			"sort": 6
		}],
		"sort": 12
	}, {
		"Code": "210013",
		"Name": "抚顺市",
		"level": [{
			"Code": "210013",
			"Name": "清原满族自治县 ",
			"sort": 1
		}, {
			"Code": "210013",
			"Name": "新宾满族自治县",
			"sort": 2
		}, {
			"Code": "210013",
			"Name": "抚顺经济开发区 ",
			"sort": 3
		}, {
			"Code": "210013",
			"Name": "胜利开发区",
			"sort": 4
		}, {
			"Code": "210013",
			"Name": "东洲区",
			"sort": 5
		}, {
			"Code": "210013",
			"Name": "高湾经济开发区",
			"sort": 6
		}, {
			"Code": "210013",
			"Name": "李石经济开发",
			"sort": 7
		}, {
			"Code": "210013",
			"Name": "抚顺县",
			"sort": 8
		}, {
			"Code": "210013",
			"Name": "望花区",
			"sort": 9
		}, {
			"Code": "210013",
			"Name": "新抚区",
			"sort": 10
		}, {
			"Code": "210013",
			"Name": "顺城区",
			"sort": 11
		}],
		"sort": 13
	}, {
		"Code": "210014",
		"Name": "鞍山市",
		"level": [{
			"Code": "210014",
			"Name": "铁东区",
			"sort": 1
		}, {
			"Code": "210014",
			"Name": "鞍山经济开发区(西区)",
			"sort": 2
		}, {
			"Code": "210014",
			"Name": "铁西区",
			"sort": 3
		}, {
			"Code": "210014",
			"Name": "立山区",
			"sort": 4
		}, {
			"Code": "210014",
			"Name": "千山区",
			"sort": 5
		}, {
			"Code": "210014",
			"Name": "台安县",
			"sort": 6
		}, {
			"Code": "210014",
			"Name": "岫岩满族自治县",
			"sort": 7
		}, {
			"Code": "210014",
			"Name": "海城市",
			"level": [{
				"Code": "2143",
				"Name": "毛祁镇"
			}, {
				"Code": "2144",
				"Name": "西四镇"
			}, {
				"Code": "2145",
				"Name": "铁西经济技术开发区"
			}, {
				"Code": "1955",
				"Name": "兴海管理区"
			}, {
				"Code": "1971",
				"Name": "王石镇"
			}, {
				"Code": "1970",
				"Name": "旗口镇"
			}, {
				"Code": "1969",
				"Name": "耿庄"
			}, {
				"Code": "1968",
				"Name": "验军镇"
			}, {
				"Code": "1967",
				"Name": "东四镇"
			}, {
				"Code": "1966",
				"Name": "中小镇"
			}, {
				"Code": "1965",
				"Name": "感王镇"
			}, {
				"Code": "1964",
				"Name": "西柳镇"
			}, {
				"Code": "1953",
				"Name": "海州管理区"
			}, {
				"Code": "1961",
				"Name": "大屯镇"
			}, {
				"Code": "1960",
				"Name": "甘泉镇"
			}, {
				"Code": "1959",
				"Name": "二道河"
			}, {
				"Code": "1958",
				"Name": "南台镇"
			}, {
				"Code": "1957",
				"Name": "八里镇"
			}, {
				"Code": "1956",
				"Name": "响堂管理区"
			}, {
				"Code": "1963",
				"Name": "牛庄镇"
			}],
			"sort": 8
		}],
		"sort": 14
	}, {
		"Code": "210015",
		"Name": "大连市",
		"level": [{
			"Code": "210015",
			"Name": "中山区",
			"sort": 1
		}, {
			"Code": "210015",
			"Name": "庄河市 ",
			"sort": 2
		}, {
			"Code": "210015",
			"Name": "长海县",
			"sort": 3
		}, {
			"Code": "210015",
			"Name": "金州区",
			"sort": 4
		}, {
			"Code": "210015",
			"Name": "旅顺口区",
			"sort": 5
		}, {
			"Code": "210015",
			"Name": "甘井子区",
			"sort": 6
		}, {
			"Code": "210015",
			"Name": "沙河口区 ",
			"sort": 7
		}, {
			"Code": "210015",
			"Name": "西岗区",
			"sort": 8
		}, {
			"Code": "210015",
			"Name": "经济技术开发区",
			"sort": 9
		}, {
			"Code": "210015",
			"Name": "瓦房店市",
			"level": [{
				"Code": "1982",
				"Name": "市区"
			}],
			"sort": 10
		}, {
			"Code": "210015",
			"Name": "普兰店市",
			"level": [{
				"Code": "1980",
				"Name": "市区"
			}],
			"sort": 11
		}],
		"sort": 15
	}, {
		"Code": "210016",
		"Name": "沈阳市",
		"level": [{
			"Code": "210016",
			"Name": "沈北新区",
			"sort": 1
		}, {
			"Code": "210016",
			"Name": "辽中县",
			"sort": 2
		}, {
			"Code": "210016",
			"Name": "张士经济技术开发南区",
			"sort": 3
		}, {
			"Code": "210016",
			"Name": "张士经济技术开发区",
			"sort": 4
		}, {
			"Code": "210016",
			"Name": "沈阳经济技术开发区",
			"sort": 5
		}, {
			"Code": "210016",
			"Name": "新城子区",
			"sort": 6
		}, {
			"Code": "210016",
			"Name": "道义开发区",
			"sort": 7
		}, {
			"Code": "210016",
			"Name": "于洪区",
			"sort": 8
		}, {
			"Code": "210016",
			"Name": "苏家屯区",
			"sort": 9
		}, {
			"Code": "210016",
			"Name": "浑南新区",
			"sort": 10
		}, {
			"Code": "210016",
			"Name": "东陵区",
			"sort": 11
		}, {
			"Code": "210016",
			"Name": "沈河区",
			"sort": 12
		}, {
			"Code": "210016",
			"Name": "铁西新区",
			"sort": 13
		}, {
			"Code": "210016",
			"Name": "铁西区",
			"sort": 14
		}, {
			"Code": "210016",
			"Name": "皇姑区",
			"level": [{
				"Code": "3038",
				"Name": "北陵"
			}, {
				"Code": "3039",
				"Name": "北行"
			}, {
				"Code": "3040",
				"Name": "辽大"
			}, {
				"Code": "3041",
				"Name": "塔湾"
			}, {
				"Code": "3042",
				"Name": "小白楼"
			}],
			"sort": 15
		}, {
			"Code": "210016",
			"Name": "和平区",
			"level": [{
				"Code": "3031",
				"Name": "北市场"
			}, {
				"Code": "3032",
				"Name": "马路湾"
			}, {
				"Code": "3033",
				"Name": "南湖公园"
			}, {
				"Code": "3034",
				"Name": "南市"
			}, {
				"Code": "3035",
				"Name": "太原街"
			}, {
				"Code": "3036",
				"Name": "五里河"
			}, {
				"Code": "3037",
				"Name": "西塔"
			}],
			"sort": 16
		}, {
			"Code": "210016",
			"Name": "大东区",
			"level": [{
				"Code": "3027",
				"Name": "大东广场"
			}, {
				"Code": "3028",
				"Name": "大东路"
			}, {
				"Code": "3029",
				"Name": "东塔"
			}, {
				"Code": "3030",
				"Name": "东站"
			}],
			"sort": 17
		}, {
			"Code": "210016",
			"Name": "新民市",
			"sort": 18
		}],
		"sort": 16
	}]
}, {
	"Code": "220000",
	"Name": "吉林省",
	"level": [{
		"Code": "220001",
		"Name": "舒兰市",
		"sort": 1,
		"level": [{
			"Code": "220001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "220002",
		"Name": "延吉市",
		"sort": 2,
		"level": [{
			"Code": "220002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "220003",
		"Name": "通化市",
		"level": [{
			"Code": "220003",
			"Name": "梅河口市",
			"sort": 1
		}, {
			"Code": "220003",
			"Name": "东昌区",
			"sort": 2
		}, {
			"Code": "220003",
			"Name": "二道江区",
			"sort": 3
		}, {
			"Code": "220003",
			"Name": "通化县",
			"sort": 4
		}, {
			"Code": "220003",
			"Name": "辉南县",
			"sort": 5
		}, {
			"Code": "220003",
			"Name": "柳河县",
			"sort": 6
		}, {
			"Code": "220003",
			"Name": "集安市",
			"sort": 7
		}],
		"sort": 3
	}, {
		"Code": "220004",
		"Name": "白山市",
		"level": [{
			"Code": "220004",
			"Name": "江源县",
			"sort": 1
		}, {
			"Code": "220004",
			"Name": "靖宇县",
			"sort": 2
		}, {
			"Code": "220004",
			"Name": "抚松县",
			"sort": 3
		}],
		"sort": 4
	}, {
		"Code": "220005",
		"Name": "延边朝鲜族自治州",
		"level": [{
			"Code": "220005",
			"Name": "安图县 ",
			"sort": 1
		}, {
			"Code": "220005",
			"Name": "汪清县 ",
			"sort": 2
		}, {
			"Code": "220005",
			"Name": "和龙市 ",
			"sort": 3
		}, {
			"Code": "220005",
			"Name": "龙井市 ",
			"sort": 4
		}, {
			"Code": "220005",
			"Name": "珲春市 ",
			"sort": 5
		}, {
			"Code": "220005",
			"Name": "敦化市 ",
			"sort": 6
		}, {
			"Code": "220005",
			"Name": "图们市 ",
			"sort": 7
		}, {
			"Code": "220005",
			"Name": "延吉市 ",
			"sort": 8
		}],
		"sort": 5
	}, {
		"Code": "220006",
		"Name": "白城市",
		"level": [{
			"Code": "220006",
			"Name": "大安市 ",
			"sort": 1
		}, {
			"Code": "220006",
			"Name": "洮南市 ",
			"sort": 2
		}, {
			"Code": "220006",
			"Name": "通榆县 ",
			"sort": 3
		}, {
			"Code": "220006",
			"Name": "镇赉县 ",
			"sort": 4
		}, {
			"Code": "220006",
			"Name": "洮北区 ",
			"sort": 5
		}],
		"sort": 6
	}, {
		"Code": "220007",
		"Name": "松原市",
		"level": [{
			"Code": "220007",
			"Name": "扶余县 ",
			"sort": 1
		}, {
			"Code": "220007",
			"Name": "乾安县 ",
			"sort": 2
		}, {
			"Code": "220007",
			"Name": "长岭县 ",
			"sort": 3
		}, {
			"Code": "220007",
			"Name": "前郭尔罗斯蒙古族自治县 ",
			"sort": 4
		}, {
			"Code": "220007",
			"Name": "宁江区 ",
			"sort": 5
		}],
		"sort": 7
	}, {
		"Code": "220008",
		"Name": "兴华乡",
		"level": [{
			"Code": "220008",
			"Name": "集安市 ",
			"sort": 1
		}, {
			"Code": "220008",
			"Name": "梅河口市 ",
			"sort": 2
		}, {
			"Code": "220008",
			"Name": "柳河县 ",
			"sort": 3
		}, {
			"Code": "220008",
			"Name": "辉南县 ",
			"sort": 4
		}, {
			"Code": "220008",
			"Name": "通化县 ",
			"sort": 5
		}, {
			"Code": "220008",
			"Name": "二道江区 ",
			"sort": 6
		}, {
			"Code": "220008",
			"Name": "东昌区 ",
			"sort": 7
		}],
		"sort": 8
	}, {
		"Code": "220009",
		"Name": "辽源市",
		"sort": 9,
		"level": [{
			"Code": "220009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "220010",
		"Name": "辽源市",
		"level": [{
			"Code": "220010",
			"Name": "东辽县 ",
			"sort": 1
		}, {
			"Code": "220010",
			"Name": "东丰县  ",
			"sort": 2
		}, {
			"Code": "220010",
			"Name": "西安区 ",
			"sort": 3
		}, {
			"Code": "220010",
			"Name": "龙山区 ",
			"sort": 4
		}],
		"sort": 10
	}, {
		"Code": "220011",
		"Name": "四平市",
		"level": [{
			"Code": "220011",
			"Name": "铁西区",
			"sort": 1
		}, {
			"Code": "220011",
			"Name": "双辽市",
			"sort": 2
		}, {
			"Code": "220011",
			"Name": "公主岭市 ",
			"sort": 3
		}, {
			"Code": "220011",
			"Name": "伊通满族自治县 ",
			"sort": 4
		}, {
			"Code": "220011",
			"Name": "梨树县 ",
			"sort": 5
		}, {
			"Code": "220011",
			"Name": "铁东区 ",
			"sort": 6
		}],
		"sort": 11
	}, {
		"Code": "220012",
		"Name": "吉林市",
		"level": [{
			"Code": "220012",
			"Name": "船营区",
			"sort": 1
		}, {
			"Code": "220012",
			"Name": "昌邑区",
			"sort": 2
		}, {
			"Code": "220012",
			"Name": "丰满区",
			"sort": 3
		}, {
			"Code": "220012",
			"Name": "龙潭区",
			"sort": 4
		}, {
			"Code": "220012",
			"Name": "高新区",
			"sort": 5
		}],
		"sort": 12
	}, {
		"Code": "220013",
		"Name": "长春市",
		"level": [{
			"Code": "220013",
			"Name": "九台市",
			"sort": 1
		}, {
			"Code": "220013",
			"Name": "榆树市",
			"sort": 2
		}, {
			"Code": "220013",
			"Name": "农安县",
			"sort": 3
		}, {
			"Code": "220013",
			"Name": "汽车产业开发区",
			"sort": 4
		}, {
			"Code": "220013",
			"Name": "净月旅游经济开发区",
			"sort": 5
		}, {
			"Code": "220013",
			"Name": "高新技术产业开发区",
			"sort": 6
		}, {
			"Code": "220013",
			"Name": "经济技术开发区",
			"sort": 7
		}, {
			"Code": "220013",
			"Name": "二道区",
			"sort": 8
		}, {
			"Code": "220013",
			"Name": "南关区",
			"sort": 9
		}, {
			"Code": "220013",
			"Name": "绿园区",
			"sort": 10
		}, {
			"Code": "220013",
			"Name": "朝阳区",
			"sort": 11
		}, {
			"Code": "220013",
			"Name": "宽城区",
			"sort": 12
		}],
		"sort": 13
	}]
}, {
	"Code": "230000",
	"Name": "黑龙江省",
	"level": [{
		"Code": "230001",
		"Name": "大兴安岭地区",
		"level": [{
			"Code": "230001",
			"Name": "加格达奇区 ",
			"sort": 1
		}, {
			"Code": "230001",
			"Name": "松岭区 ",
			"sort": 2
		}, {
			"Code": "230001",
			"Name": "新林区 ",
			"sort": 3
		}, {
			"Code": "230001",
			"Name": "呼中区 ",
			"sort": 4
		}, {
			"Code": "230001",
			"Name": "呼玛县 ",
			"sort": 5
		}, {
			"Code": "230001",
			"Name": "塔河县 ",
			"sort": 6
		}, {
			"Code": "230001",
			"Name": "漠河县 ",
			"sort": 7
		}],
		"sort": 1
	}, {
		"Code": "230002",
		"Name": "绥化市",
		"level": [{
			"Code": "230002",
			"Name": "北林区 ",
			"sort": 1
		}, {
			"Code": "230002",
			"Name": "肇东市 ",
			"sort": 2
		}, {
			"Code": "230002",
			"Name": "安达市 ",
			"sort": 3
		}, {
			"Code": "230002",
			"Name": "绥棱县 ",
			"sort": 4
		}, {
			"Code": "230002",
			"Name": "明水县 ",
			"sort": 5
		}, {
			"Code": "230002",
			"Name": "庆安县 ",
			"sort": 6
		}, {
			"Code": "230002",
			"Name": "青冈县 ",
			"sort": 7
		}, {
			"Code": "230002",
			"Name": "兰西县 ",
			"sort": 8
		}, {
			"Code": "230002",
			"Name": "望奎县 ",
			"sort": 9
		}, {
			"Code": "230002",
			"Name": "海伦市 ",
			"sort": 10
		}],
		"sort": 2
	}, {
		"Code": "230003",
		"Name": "黑河市",
		"level": [{
			"Code": "230003",
			"Name": "爱辉区 ",
			"sort": 1
		}, {
			"Code": "230003",
			"Name": "嫩江县 ",
			"sort": 2
		}, {
			"Code": "230003",
			"Name": "逊克县 ",
			"sort": 3
		}, {
			"Code": "230003",
			"Name": "孙吴县 ",
			"sort": 4
		}, {
			"Code": "230003",
			"Name": "北安市 ",
			"sort": 5
		}, {
			"Code": "230003",
			"Name": "五大连池市 ",
			"sort": 6
		}],
		"sort": 3
	}, {
		"Code": "230004",
		"Name": "牡丹江市",
		"level": [{
			"Code": "230004",
			"Name": "东安区 ",
			"sort": 1
		}, {
			"Code": "230004",
			"Name": "宁安市 ",
			"sort": 2
		}, {
			"Code": "230004",
			"Name": "海林市 ",
			"sort": 3
		}, {
			"Code": "230004",
			"Name": "绥芬河市 ",
			"sort": 4
		}, {
			"Code": "230004",
			"Name": "林口县 ",
			"sort": 5
		}, {
			"Code": "230004",
			"Name": "东宁县 ",
			"sort": 6
		}, {
			"Code": "230004",
			"Name": "西安区 ",
			"sort": 7
		}, {
			"Code": "230004",
			"Name": "爱民区 ",
			"sort": 8
		}, {
			"Code": "230004",
			"Name": "阳明区 ",
			"sort": 9
		}, {
			"Code": "230004",
			"Name": "穆棱市 ",
			"sort": 10
		}],
		"sort": 4
	}, {
		"Code": "230005",
		"Name": "七台河市",
		"level": [{
			"Code": "230005",
			"Name": "新兴区 ",
			"sort": 1
		}, {
			"Code": "230005",
			"Name": "桃山区 ",
			"sort": 2
		}, {
			"Code": "230005",
			"Name": "茄子河区 ",
			"sort": 3
		}, {
			"Code": "230005",
			"Name": "勃利县 ",
			"sort": 4
		}],
		"sort": 5
	}, {
		"Code": "230006",
		"Name": "佳木斯市",
		"level": [{
			"Code": "230006",
			"Name": "向阳区 ",
			"sort": 1
		}, {
			"Code": "230006",
			"Name": "前进区 ",
			"sort": 2
		}, {
			"Code": "230006",
			"Name": "东风区 ",
			"sort": 3
		}, {
			"Code": "230006",
			"Name": "桦南县 ",
			"sort": 4
		}, {
			"Code": "230006",
			"Name": "桦川县 ",
			"sort": 5
		}, {
			"Code": "230006",
			"Name": "汤原县 ",
			"sort": 6
		}, {
			"Code": "230006",
			"Name": "抚远县 ",
			"sort": 7
		}, {
			"Code": "230006",
			"Name": "同江市 ",
			"sort": 8
		}, {
			"Code": "230006",
			"Name": "富锦市 ",
			"sort": 9
		}],
		"sort": 6
	}, {
		"Code": "230007",
		"Name": "伊春市",
		"level": [{
			"Code": "230007",
			"Name": "红星区 ",
			"sort": 1
		}, {
			"Code": "230007",
			"Name": "嘉荫县 ",
			"sort": 2
		}, {
			"Code": "230007",
			"Name": "伊春区 ",
			"sort": 3
		}, {
			"Code": "230007",
			"Name": "南岔区 ",
			"sort": 4
		}, {
			"Code": "230007",
			"Name": "友好区 ",
			"sort": 5
		}, {
			"Code": "230007",
			"Name": "西林区 ",
			"sort": 6
		}, {
			"Code": "230007",
			"Name": "翠峦区 ",
			"sort": 7
		}, {
			"Code": "230007",
			"Name": "新青区 ",
			"sort": 8
		}, {
			"Code": "230007",
			"Name": "美溪区 ",
			"sort": 9
		}, {
			"Code": "230007",
			"Name": "金山屯区 ",
			"sort": 10
		}, {
			"Code": "230007",
			"Name": "五营区 ",
			"sort": 11
		}, {
			"Code": "230007",
			"Name": "乌马河区 ",
			"sort": 12
		}, {
			"Code": "230007",
			"Name": "汤旺河区 ",
			"sort": 13
		}, {
			"Code": "230007",
			"Name": "带岭区 ",
			"sort": 14
		}, {
			"Code": "230007",
			"Name": "乌伊岭区 ",
			"sort": 15
		}, {
			"Code": "230007",
			"Name": "上甘岭区 ",
			"sort": 16
		}, {
			"Code": "230007",
			"Name": "铁力市 ",
			"sort": 17
		}],
		"sort": 7
	}, {
		"Code": "230008",
		"Name": "双鸭山市",
		"level": [{
			"Code": "230008",
			"Name": "饶河县",
			"sort": 1
		}, {
			"Code": "230008",
			"Name": "宝清县 ",
			"sort": 2
		}, {
			"Code": "230008",
			"Name": "友谊县 ",
			"sort": 3
		}, {
			"Code": "230008",
			"Name": "集贤县 ",
			"sort": 4
		}, {
			"Code": "230008",
			"Name": "宝山区 ",
			"sort": 5
		}, {
			"Code": "230008",
			"Name": "四方台区  ",
			"sort": 6
		}, {
			"Code": "230008",
			"Name": "岭东区 ",
			"sort": 7
		}, {
			"Code": "230008",
			"Name": "尖山区 ",
			"sort": 8
		}],
		"sort": 8
	}, {
		"Code": "230009",
		"Name": "鹤岗市",
		"level": [{
			"Code": "230009",
			"Name": "绥滨县 ",
			"sort": 1
		}, {
			"Code": "230009",
			"Name": "萝北县 ",
			"sort": 2
		}, {
			"Code": "230009",
			"Name": "兴山区 ",
			"sort": 3
		}, {
			"Code": "230009",
			"Name": "东山区 ",
			"sort": 4
		}, {
			"Code": "230009",
			"Name": "兴安区 ",
			"sort": 5
		}, {
			"Code": "230009",
			"Name": "南山区 ",
			"sort": 6
		}, {
			"Code": "230009",
			"Name": "工农区 ",
			"sort": 7
		}, {
			"Code": "230009",
			"Name": "向阳区 ",
			"sort": 8
		}],
		"sort": 9
	}, {
		"Code": "230010",
		"Name": "鸡西市",
		"level": [{
			"Code": "230010",
			"Name": "密山市 ",
			"sort": 1
		}, {
			"Code": "230010",
			"Name": "虎林市 ",
			"sort": 2
		}, {
			"Code": "230010",
			"Name": "鸡东县 ",
			"sort": 3
		}, {
			"Code": "230010",
			"Name": "麻山区 ",
			"sort": 4
		}, {
			"Code": "230010",
			"Name": "城子河区 ",
			"sort": 5
		}, {
			"Code": "230010",
			"Name": "梨树区 ",
			"sort": 6
		}, {
			"Code": "230010",
			"Name": "滴道区 ",
			"sort": 7
		}, {
			"Code": "230010",
			"Name": "恒山区 ",
			"sort": 8
		}, {
			"Code": "230010",
			"Name": "鸡冠区  ",
			"sort": 9
		}],
		"sort": 10
	}, {
		"Code": "230011",
		"Name": "齐齐哈尔市",
		"level": [{
			"Code": "230011",
			"Name": "建华区 ",
			"sort": 1
		}, {
			"Code": "230011",
			"Name": "昂昂溪区 ",
			"sort": 2
		}, {
			"Code": "230011",
			"Name": "富拉尔基区 ",
			"sort": 3
		}, {
			"Code": "230011",
			"Name": "碾子山区",
			"sort": 4
		}, {
			"Code": "230011",
			"Name": "梅里斯达斡尔族区 ",
			"sort": 5
		}, {
			"Code": "230011",
			"Name": "龙江县 ",
			"sort": 6
		}, {
			"Code": "230011",
			"Name": "依安县 ",
			"sort": 7
		}, {
			"Code": "230011",
			"Name": "泰来县 ",
			"sort": 8
		}, {
			"Code": "230011",
			"Name": "甘南县 ",
			"sort": 9
		}, {
			"Code": "230011",
			"Name": "富裕县 ",
			"sort": 10
		}, {
			"Code": "230011",
			"Name": "克山县 ",
			"sort": 11
		}, {
			"Code": "230011",
			"Name": "克东县 ",
			"sort": 12
		}, {
			"Code": "230011",
			"Name": "拜泉县 ",
			"sort": 13
		}, {
			"Code": "230011",
			"Name": "讷河市 ",
			"sort": 14
		}, {
			"Code": "230011",
			"Name": "龙沙区 ",
			"sort": 15
		}, {
			"Code": "230011",
			"Name": "铁锋区 ",
			"sort": 16
		}],
		"sort": 11
	}, {
		"Code": "230012",
		"Name": "大庆市",
		"level": [{
			"Code": "230012",
			"Name": "杜尔伯特蒙古族自治县",
			"sort": 1
		}, {
			"Code": "230012",
			"Name": "大同区",
			"sort": 2
		}, {
			"Code": "230012",
			"Name": "肇州县",
			"sort": 3
		}, {
			"Code": "230012",
			"Name": "肇源县",
			"sort": 4
		}, {
			"Code": "230012",
			"Name": "经济技术开发区",
			"sort": 5
		}, {
			"Code": "230012",
			"Name": "红岗区",
			"sort": 6
		}, {
			"Code": "230012",
			"Name": "采油六厂",
			"sort": 7
		}, {
			"Code": "230012",
			"Name": "喇嘛甸镇",
			"sort": 8
		}, {
			"Code": "230012",
			"Name": "卧里屯",
			"sort": 9
		}, {
			"Code": "230012",
			"Name": "乙烯",
			"sort": 10
		}, {
			"Code": "230012",
			"Name": "龙凤区",
			"sort": 11
		}, {
			"Code": "230012",
			"Name": "让湖路区",
			"sort": 12
		}, {
			"Code": "230012",
			"Name": "萨尔图区",
			"sort": 13
		}],
		"sort": 12
	}, {
		"Code": "230013",
		"Name": "哈尔滨市",
		"level": [{
			"Code": "230013",
			"Name": "尚志市 ",
			"sort": 1
		}, {
			"Code": "230013",
			"Name": "阿城区 ",
			"sort": 2
		}, {
			"Code": "230013",
			"Name": "依兰县 ",
			"sort": 3
		}, {
			"Code": "230013",
			"Name": "方正县 ",
			"sort": 4
		}, {
			"Code": "230013",
			"Name": "宾县 ",
			"sort": 5
		}, {
			"Code": "230013",
			"Name": "巴彦县 ",
			"sort": 6
		}, {
			"Code": "230013",
			"Name": "木兰县 ",
			"sort": 7
		}, {
			"Code": "230013",
			"Name": "通河县 ",
			"sort": 8
		}, {
			"Code": "230013",
			"Name": "五常市 ",
			"sort": 9
		}, {
			"Code": "230013",
			"Name": "延寿县",
			"sort": 10
		}, {
			"Code": "230013",
			"Name": "呼兰区 ",
			"sort": 11
		}, {
			"Code": "230013",
			"Name": "双城市",
			"level": [{
				"Code": "4993",
				"Name": "经济技术开发区"
			}, {
				"Code": "4992",
				"Name": "双城镇"
			}, {
				"Code": "4994",
				"Name": "新城区 "
			}],
			"sort": 12
		}, {
			"Code": "230013",
			"Name": "松北区",
			"sort": 13
		}, {
			"Code": "230013",
			"Name": "平房区",
			"sort": 14
		}, {
			"Code": "230013",
			"Name": "香坊区",
			"sort": 15
		}, {
			"Code": "230013",
			"Name": "道外区",
			"sort": 16
		}, {
			"Code": "230013",
			"Name": "道里区",
			"sort": 17
		}, {
			"Code": "230013",
			"Name": "南岗区",
			"sort": 18
		}],
		"sort": 13
	}]
}, {
	"Code": "310000",
	"Name": "上海市",
	"level": [{
		"Code": "310001",
		"Name": "徐汇区",
		"sort": 1,
		"level": [{
			"Code": "310001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310002",
		"Name": "崇明县",
		"level": [{
			"Code": "310002",
			"Name": "城桥镇 ",
			"sort": 1
		}, {
			"Code": "310002",
			"Name": "新河镇",
			"sort": 2
		}],
		"sort": 2
	}, {
		"Code": "310003",
		"Name": "奉贤区",
		"sort": 3,
		"level": [{
			"Code": "310003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310004",
		"Name": "南汇区",
		"sort": 4,
		"level": [{
			"Code": "310004",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310005",
		"Name": "青浦区",
		"sort": 5,
		"level": [{
			"Code": "310005",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310006",
		"Name": "松江区",
		"sort": 6,
		"level": [{
			"Code": "310006",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310007",
		"Name": "金山区",
		"sort": 7,
		"level": [{
			"Code": "310007",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310008",
		"Name": "浦东新区",
		"sort": 8,
		"level": [{
			"Code": "310008",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310009",
		"Name": "嘉定区",
		"sort": 9,
		"level": [{
			"Code": "310009",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310010",
		"Name": "宝山区",
		"sort": 10,
		"level": [{
			"Code": "310010",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310011",
		"Name": "闵行区",
		"sort": 11,
		"level": [{
			"Code": "310011",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310012",
		"Name": "杨浦区",
		"sort": 12,
		"level": [{
			"Code": "310012",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310013",
		"Name": "虹口区",
		"sort": 13,
		"level": [{
			"Code": "310013",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310014",
		"Name": "闸北区",
		"sort": 14,
		"level": [{
			"Code": "310014",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310015",
		"Name": "普陀区",
		"sort": 15,
		"level": [{
			"Code": "310015",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310016",
		"Name": "静安区",
		"sort": 16,
		"level": [{
			"Code": "310016",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310017",
		"Name": "长宁区",
		"sort": 17,
		"level": [{
			"Code": "310017",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310018",
		"Name": "黄浦区",
		"sort": 18,
		"level": [{
			"Code": "310018",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "310019",
		"Name": "卢湾区",
		"sort": 19,
		"level": [{
			"Code": "310019",
			"Name": "--",
			"sort": 1
		}]
	}]
}, {
	"Code": "320000",
	"Name": "江苏省",
	"level": [{
		"Code": "320001",
		"Name": "南京市",
		"level": [{
			"Code": "320001",
			"Name": "玄武区 ",
			"sort": 1
		}, {
			"Code": "320001",
			"Name": "溧水县 ",
			"sort": 2
		}, {
			"Code": "320001",
			"Name": "六合区 ",
			"sort": 3
		}, {
			"Code": "320001",
			"Name": "江宁区 ",
			"sort": 4
		}, {
			"Code": "320001",
			"Name": "雨花台区 ",
			"sort": 5
		}, {
			"Code": "320001",
			"Name": "栖霞区 ",
			"sort": 6
		}, {
			"Code": "320001",
			"Name": "浦口区 ",
			"sort": 7
		}, {
			"Code": "320001",
			"Name": "下关区 ",
			"sort": 8
		}, {
			"Code": "320001",
			"Name": "鼓楼区 ",
			"sort": 9
		}, {
			"Code": "320001",
			"Name": "建邺区 ",
			"sort": 10
		}, {
			"Code": "320001",
			"Name": "秦淮区 ",
			"sort": 11
		}, {
			"Code": "320001",
			"Name": "白下区 ",
			"sort": 12
		}, {
			"Code": "320001",
			"Name": "高淳县 ",
			"level": [{
				"Code": "4997",
				"Name": "淳溪镇 "
			}, {
				"Code": "4998",
				"Name": "高淳经济开发区"
			}],
			"sort": 13
		}],
		"sort": 1
	}, {
		"Code": "320002",
		"Name": "泰州市",
		"level": [{
			"Code": "320002",
			"Name": "海陵区",
			"sort": 1
		}, {
			"Code": "320002",
			"Name": "高港区",
			"sort": 2
		}, {
			"Code": "320002",
			"Name": "靖江市 ",
			"sort": 3
		}, {
			"Code": "320002",
			"Name": "泰兴市 ",
			"level": [{
				"Code": "5130",
				"Name": "泰兴镇"
			}, {
				"Code": "5141",
				"Name": "过船镇"
			}, {
				"Code": "5140",
				"Name": "大生镇"
			}, {
				"Code": "5139",
				"Name": "七圩镇"
			}, {
				"Code": "5138",
				"Name": "蒋华镇"
			}, {
				"Code": "5137",
				"Name": "张桥镇"
			}, {
				"Code": "5136",
				"Name": "黄桥镇"
			}, {
				"Code": "5135",
				"Name": "溪桥镇"
			}, {
				"Code": "5134",
				"Name": "河失镇"
			}, {
				"Code": "5133",
				"Name": "宣堡镇"
			}, {
				"Code": "5132",
				"Name": "姚王镇"
			}, {
				"Code": "5131",
				"Name": "马甸镇"
			}, {
				"Code": "5142",
				"Name": "分界镇"
			}],
			"sort": 4
		}, {
			"Code": "320002",
			"Name": "姜堰市 ",
			"level": [{
				"Code": "5143",
				"Name": "姜堰经济开发区"
			}, {
				"Code": "5144",
				"Name": "姜堰镇"
			}, {
				"Code": "5145",
				"Name": "苏陈镇"
			}, {
				"Code": "5146",
				"Name": "桥头镇"
			}, {
				"Code": "5147",
				"Name": "沈高镇"
			}, {
				"Code": "5148",
				"Name": "王石镇"
			}, {
				"Code": "5149",
				"Name": "梁徐镇"
			}, {
				"Code": "5150",
				"Name": "娄庄镇"
			}, {
				"Code": "5151",
				"Name": "白米镇"
			}],
			"sort": 5
		}, {
			"Code": "320002",
			"Name": "兴化市",
			"sort": 6
		}],
		"sort": 2
	}, {
		"Code": "320003",
		"Name": "镇江市",
		"level": [{
			"Code": "320003",
			"Name": "京口区 ",
			"sort": 1
		}, {
			"Code": "320003",
			"Name": "润州区 ",
			"sort": 2
		}, {
			"Code": "320003",
			"Name": "丹徒区 ",
			"sort": 3
		}, {
			"Code": "320003",
			"Name": "丹阳市 ",
			"sort": 4
		}, {
			"Code": "320003",
			"Name": "扬中市 ",
			"sort": 5
		}, {
			"Code": "320003",
			"Name": "句容市 ",
			"level": [{
				"Code": "5127",
				"Name": "袁巷镇"
			}, {
				"Code": "5128",
				"Name": "茅山镇"
			}, {
				"Code": "5129",
				"Name": "茅西镇"
			}],
			"sort": 6
		}],
		"sort": 3
	}, {
		"Code": "320004",
		"Name": "扬州市",
		"level": [{
			"Code": "320004",
			"Name": "维扬区",
			"sort": 1
		}, {
			"Code": "320004",
			"Name": "广陵区",
			"sort": 2
		}, {
			"Code": "320004",
			"Name": "开发区",
			"sort": 3
		}, {
			"Code": "320004",
			"Name": "邗江区",
			"sort": 4
		}, {
			"Code": "320004",
			"Name": "宝应县 ",
			"sort": 5
		}, {
			"Code": "320004",
			"Name": "仪征市 ",
			"level": [{
				"Code": "5118",
				"Name": "大仪镇"
			}, {
				"Code": "5120",
				"Name": "胥浦镇"
			}, {
				"Code": "5121",
				"Name": "新城镇"
			}, {
				"Code": "5122",
				"Name": "新集镇"
			}, {
				"Code": "5123",
				"Name": "马集镇"
			}, {
				"Code": "5124",
				"Name": "朴席镇"
			}, {
				"Code": "5125",
				"Name": "刘集镇"
			}, {
				"Code": "5126",
				"Name": "谢集镇"
			}],
			"sort": 6
		}, {
			"Code": "320004",
			"Name": "高邮市 ",
			"level": [{
				"Code": "5117",
				"Name": "高邮镇"
			}],
			"sort": 7
		}, {
			"Code": "320004",
			"Name": "江都市 ",
			"level": [{
				"Code": "5090",
				"Name": "仙女镇"
			}, {
				"Code": "5105",
				"Name": "泰安镇"
			}, {
				"Code": "5106",
				"Name": "杨庄镇"
			}, {
				"Code": "5107",
				"Name": "真武镇"
			}, {
				"Code": "5108",
				"Name": "嘶马镇"
			}, {
				"Code": "5109",
				"Name": "滨湖镇"
			}, {
				"Code": "5110",
				"Name": "浦头镇"
			}, {
				"Code": "5111",
				"Name": "丁伙镇"
			}, {
				"Code": "5112",
				"Name": "富民镇"
			}, {
				"Code": "5113",
				"Name": "小纪镇"
			}, {
				"Code": "5114",
				"Name": "高徐镇"
			}, {
				"Code": "5104",
				"Name": "吴桥镇"
			}, {
				"Code": "5103",
				"Name": "曹王镇"
			}, {
				"Code": "5102",
				"Name": "邵伯镇"
			}, {
				"Code": "5091",
				"Name": "张纲镇"
			}, {
				"Code": "5092",
				"Name": "砖桥镇"
			}, {
				"Code": "5100",
				"Name": "正谊镇"
			}, {
				"Code": "5094",
				"Name": "昌松镇"
			}, {
				"Code": "5095",
				"Name": "宜陵镇"
			}, {
				"Code": "5096",
				"Name": "双沟镇"
			}, {
				"Code": "5097",
				"Name": "大桥镇"
			}, {
				"Code": "5098",
				"Name": "花荡镇"
			}, {
				"Code": "5099",
				"Name": "七里镇"
			}, {
				"Code": "5101",
				"Name": "谢桥镇"
			}, {
				"Code": "5115",
				"Name": "樊(凡)川镇"
			}],
			"sort": 8
		}],
		"sort": 4
	}, {
		"Code": "320005",
		"Name": "盐城市",
		"level": [{
			"Code": "320005",
			"Name": "滨海县 ",
			"sort": 1
		}, {
			"Code": "320005",
			"Name": "东台市 ",
			"level": [{
				"Code": "5076",
				"Name": "东台镇"
			}, {
				"Code": "5084",
				"Name": "廉贻镇"
			}, {
				"Code": "5083",
				"Name": "五烈镇"
			}, {
				"Code": "5082",
				"Name": "头灶镇"
			}, {
				"Code": "5081",
				"Name": "廉贻镇"
			}, {
				"Code": "5080",
				"Name": "五烈镇"
			}, {
				"Code": "5079",
				"Name": "梁垛镇"
			}, {
				"Code": "5078",
				"Name": "安丰镇"
			}, {
				"Code": "5077",
				"Name": "富安镇 "
			}, {
				"Code": "5085",
				"Name": "时堰镇"
			}],
			"sort": 2
		}, {
			"Code": "320005",
			"Name": "建湖县 ",
			"level": [{
				"Code": "5086",
				"Name": "县城中心"
			}, {
				"Code": "5087",
				"Name": "近湖镇"
			}, {
				"Code": "5088",
				"Name": "江苏省建湖经济开发区"
			}, {
				"Code": "5089",
				"Name": "建阳镇"
			}],
			"sort": 3
		}, {
			"Code": "320005",
			"Name": "射阳县 ",
			"sort": 4
		}, {
			"Code": "320005",
			"Name": "阜宁县 ",
			"sort": 5
		}, {
			"Code": "320005",
			"Name": "盐都区",
			"sort": 6
		}, {
			"Code": "320005",
			"Name": "亭湖经济开发区",
			"sort": 7
		}, {
			"Code": "320005",
			"Name": "亭湖区",
			"sort": 8
		}, {
			"Code": "320005",
			"Name": "响水县 ",
			"sort": 9
		}, {
			"Code": "320005",
			"Name": "大丰市 ",
			"level": [{
				"Code": "5068",
				"Name": "白驹镇"
			}, {
				"Code": "5069",
				"Name": "刘庄镇"
			}, {
				"Code": "5070",
				"Name": "新丰镇"
			}, {
				"Code": "5071",
				"Name": "大中镇"
			}, {
				"Code": "5072",
				"Name": "西团镇"
			}, {
				"Code": "5073",
				"Name": "大龙镇"
			}, {
				"Code": "5074",
				"Name": "裕华镇"
			}, {
				"Code": "5075",
				"Name": "小海镇 "
			}],
			"sort": 10
		}],
		"sort": 5
	}, {
		"Code": "320006",
		"Name": "淮安市",
		"level": [{
			"Code": "320006",
			"Name": "淮阴区",
			"sort": 1
		}, {
			"Code": "320006",
			"Name": "金湖县",
			"sort": 2
		}, {
			"Code": "320006",
			"Name": "清浦区",
			"sort": 3
		}, {
			"Code": "320006",
			"Name": "盱眙县",
			"sort": 4
		}, {
			"Code": "320006",
			"Name": "清河区",
			"sort": 5
		}, {
			"Code": "320006",
			"Name": "楚州区",
			"sort": 6
		}, {
			"Code": "320006",
			"Name": "洪泽县",
			"sort": 7
		}, {
			"Code": "320006",
			"Name": "涟水县",
			"level": [{
				"Code": "2284",
				"Name": "县城"
			}],
			"sort": 8
		}, {
			"Code": "320006",
			"Name": "淮阴区开发区",
			"sort": 9
		}],
		"sort": 6
	}, {
		"Code": "320007",
		"Name": "连云港市",
		"level": [{
			"Code": "320007",
			"Name": "新浦区",
			"sort": 1
		}, {
			"Code": "320007",
			"Name": "灌云县",
			"sort": 2
		}, {
			"Code": "320007",
			"Name": "东海县",
			"level": [{
				"Code": "5062",
				"Name": "东海开发区(东)"
			}, {
				"Code": "5063",
				"Name": "东海开发区(西)"
			}, {
				"Code": "5064",
				"Name": "牛山镇"
			}, {
				"Code": "5065",
				"Name": "驼峰镇"
			}, {
				"Code": "5066",
				"Name": "石榴镇"
			}],
			"sort": 3
		}, {
			"Code": "320007",
			"Name": "赣榆县",
			"level": [{
				"Code": "5055",
				"Name": "青口镇"
			}, {
				"Code": "5056",
				"Name": "海洋经济开发区"
			}, {
				"Code": "5057",
				"Name": "赣榆经济开发区"
			}, {
				"Code": "5058",
				"Name": "赣榆西关工业区"
			}, {
				"Code": "5061",
				"Name": "海头镇"
			}],
			"sort": 4
		}, {
			"Code": "320007",
			"Name": "连云区",
			"sort": 5
		}, {
			"Code": "320007",
			"Name": "连云港国家经济进出口加工区",
			"sort": 6
		}, {
			"Code": "320007",
			"Name": "连云港经济技术开发区",
			"sort": 7
		}, {
			"Code": "320007",
			"Name": "浦南经济技术开发区",
			"sort": 8
		}, {
			"Code": "320007",
			"Name": "海州区",
			"sort": 9
		}, {
			"Code": "320007",
			"Name": "灌南县",
			"sort": 10
		}],
		"sort": 7
	}, {
		"Code": "320008",
		"Name": "南通市",
		"level": [{
			"Code": "320008",
			"Name": "经济技术开发区",
			"sort": 1
		}, {
			"Code": "320008",
			"Name": "海安县",
			"level": [{
				"Code": "2252",
				"Name": "海安镇"
			}, {
				"Code": "2253",
				"Name": "胡集镇"
			}, {
				"Code": "2254",
				"Name": "曲塘镇"
			}, {
				"Code": "2255",
				"Name": "双楼镇"
			}, {
				"Code": "2256",
				"Name": "隆政镇"
			}, {
				"Code": "2257",
				"Name": "城东镇"
			}, {
				"Code": "2258",
				"Name": "李堡镇"
			}, {
				"Code": "2259",
				"Name": "丁所镇"
			}, {
				"Code": "2260",
				"Name": "西场镇"
			}],
			"sort": 2
		}, {
			"Code": "320008",
			"Name": "如东县",
			"level": [{
				"Code": "5002",
				"Name": "如东私营工业园"
			}, {
				"Code": "2271",
				"Name": "曹埠镇"
			}, {
				"Code": "2270",
				"Name": "饮泉镇"
			}, {
				"Code": "2269",
				"Name": "兵房镇"
			}, {
				"Code": "2268",
				"Name": "岔河镇"
			}, {
				"Code": "2267",
				"Name": "潮桥镇"
			}, {
				"Code": "2266",
				"Name": "马塘镇"
			}, {
				"Code": "2265",
				"Name": "如东经济开发区新区"
			}, {
				"Code": "2264",
				"Name": "老环镇"
			}, {
				"Code": "2263",
				"Name": "掘港镇"
			}, {
				"Code": "5003",
				"Name": "陈高工业园"
			}],
			"sort": 3
		}, {
			"Code": "320008",
			"Name": "启东市 ",
			"level": [{
				"Code": "2273",
				"Name": "汇龙镇"
			}, {
				"Code": "2274",
				"Name": "民主镇"
			}, {
				"Code": "2275",
				"Name": "新港镇"
			}, {
				"Code": "2276",
				"Name": "北新镇"
			}, {
				"Code": "2277",
				"Name": "黄仓镇"
			}, {
				"Code": "2278",
				"Name": "惠萍镇"
			}, {
				"Code": "2279",
				"Name": "天汾镇"
			}, {
				"Code": "2280",
				"Name": "吕四港镇"
			}],
			"sort": 4
		}, {
			"Code": "320008",
			"Name": "如皋市",
			"level": [{
				"Code": "5004",
				"Name": "如城镇 "
			}, {
				"Code": "5015",
				"Name": "长江镇"
			}, {
				"Code": "5014",
				"Name": "东陈镇"
			}, {
				"Code": "5013",
				"Name": "郭园镇"
			}, {
				"Code": "5012",
				"Name": "石庄镇"
			}, {
				"Code": "5011",
				"Name": "下原镇 "
			}, {
				"Code": "5010",
				"Name": "白蒲镇"
			}, {
				"Code": "5009",
				"Name": "丁堰镇"
			}, {
				"Code": "5008",
				"Name": "九华镇"
			}, {
				"Code": "5007",
				"Name": "柴湾镇 "
			}, {
				"Code": "5006",
				"Name": "桃园镇 "
			}, {
				"Code": "5005",
				"Name": "林梓镇 "
			}, {
				"Code": "5016",
				"Name": "如皋港经济开发区"
			}],
			"sort": 5
		}, {
			"Code": "320008",
			"Name": "崇川区 ",
			"sort": 6
		}, {
			"Code": "320008",
			"Name": "港闸区 ",
			"sort": 7
		}, {
			"Code": "320008",
			"Name": "通州市 ",
			"level": [{
				"Code": "5017",
				"Name": "金沙镇"
			}, {
				"Code": "5034",
				"Name": "开沙岛"
			}, {
				"Code": "5033",
				"Name": "五接镇"
			}, {
				"Code": "5032",
				"Name": "平东镇"
			}, {
				"Code": "5031",
				"Name": "平潮镇"
			}, {
				"Code": "5030",
				"Name": "西亭镇"
			}, {
				"Code": "5029",
				"Name": "张芝山镇"
			}, {
				"Code": "5028",
				"Name": "兴东镇"
			}, {
				"Code": "5027",
				"Name": "川港镇"
			}, {
				"Code": "5026",
				"Name": "正场镇"
			}, {
				"Code": "5025",
				"Name": "姜灶镇"
			}, {
				"Code": "5024",
				"Name": "横港镇"
			}, {
				"Code": "5023",
				"Name": "兴仁镇"
			}, {
				"Code": "5022",
				"Name": "刘桥镇"
			}, {
				"Code": "5021",
				"Name": "四安镇"
			}, {
				"Code": "5020",
				"Name": "先锋镇"
			}, {
				"Code": "5019",
				"Name": "袁灶镇"
			}, {
				"Code": "5018",
				"Name": "五甲镇"
			}, {
				"Code": "5035",
				"Name": "十总镇"
			}],
			"sort": 8
		}, {
			"Code": "320008",
			"Name": "海门市 ",
			"level": [{
				"Code": "5036",
				"Name": "海门镇"
			}, {
				"Code": "5053",
				"Name": "正余镇 "
			}, {
				"Code": "5052",
				"Name": "树勋镇"
			}, {
				"Code": "5051",
				"Name": "余东镇"
			}, {
				"Code": "5050",
				"Name": "包场镇"
			}, {
				"Code": "5049",
				"Name": "四甲镇"
			}, {
				"Code": "5048",
				"Name": "六匡镇"
			}, {
				"Code": "5047",
				"Name": "悦来镇"
			}, {
				"Code": "5046",
				"Name": "江滨镇"
			}, {
				"Code": "5045",
				"Name": "常乐镇"
			}, {
				"Code": "5044",
				"Name": "三厂镇"
			}, {
				"Code": "5043",
				"Name": "德胜镇"
			}, {
				"Code": "5042",
				"Name": "平山镇"
			}, {
				"Code": "5041",
				"Name": "瑞祥镇"
			}, {
				"Code": "5040",
				"Name": "三和镇"
			}, {
				"Code": "5039",
				"Name": "天补镇"
			}, {
				"Code": "5038",
				"Name": "三星镇"
			}, {
				"Code": "5037",
				"Name": "海门镇开发区"
			}, {
				"Code": "5054",
				"Name": "天汾镇 "
			}],
			"sort": 9
		}],
		"sort": 8
	}, {
		"Code": "320009",
		"Name": "苏州市",
		"level": [{
			"Code": "320009",
			"Name": "常熟市",
			"sort": 1
		}, {
			"Code": "320009",
			"Name": "相城区",
			"sort": 2
		}, {
			"Code": "320009",
			"Name": "吴中区 ",
			"sort": 3
		}, {
			"Code": "320009",
			"Name": "虎丘区 ",
			"sort": 4
		}, {
			"Code": "320009",
			"Name": "金阊区",
			"sort": 5
		}, {
			"Code": "320009",
			"Name": "平江区 ",
			"sort": 6
		}, {
			"Code": "320009",
			"Name": "沧浪区  ",
			"sort": 7
		}, {
			"Code": "320009",
			"Name": "太仓市",
			"sort": 8
		}, {
			"Code": "320009",
			"Name": "吴江市",
			"sort": 9
		}, {
			"Code": "320009",
			"Name": "昆山市",
			"sort": 10
		}, {
			"Code": "320009",
			"Name": "张家港市",
			"sort": 11
		}, {
			"Code": "320009",
			"Name": "苏州工业园区",
			"sort": 12
		}],
		"sort": 9
	}, {
		"Code": "320010",
		"Name": "常州市",
		"level": [{
			"Code": "320010",
			"Name": "金坛市",
			"sort": 1
		}, {
			"Code": "320010",
			"Name": "溧阳市",
			"level": [{
				"Code": "2231",
				"Name": "溧城镇"
			}, {
				"Code": "2243",
				"Name": "社渚镇"
			}, {
				"Code": "2242",
				"Name": "前马镇"
			}, {
				"Code": "2241",
				"Name": "竹箦镇"
			}, {
				"Code": "2240",
				"Name": "茶亭镇"
			}, {
				"Code": "2239",
				"Name": "戴埠镇"
			}, {
				"Code": "2238",
				"Name": "天目湖镇"
			}, {
				"Code": "2237",
				"Name": "昆仑开发区"
			}, {
				"Code": "2236",
				"Name": "埭头镇"
			}, {
				"Code": "2235",
				"Name": "清安镇"
			}, {
				"Code": "2234",
				"Name": "杨庄镇"
			}, {
				"Code": "2233",
				"Name": "后六镇"
			}, {
				"Code": "2232",
				"Name": "上黄镇"
			}, {
				"Code": "2244",
				"Name": "周城镇"
			}],
			"sort": 2
		}, {
			"Code": "320010",
			"Name": "天宁区 ",
			"sort": 3
		}, {
			"Code": "320010",
			"Name": "钟楼区 ",
			"sort": 4
		}, {
			"Code": "320010",
			"Name": "戚墅堰区 ",
			"sort": 5
		}, {
			"Code": "320010",
			"Name": "新北区 ",
			"sort": 6
		}, {
			"Code": "320010",
			"Name": "武进区",
			"sort": 7
		}],
		"sort": 10
	}, {
		"Code": "320011",
		"Name": "徐州市",
		"level": [{
			"Code": "320011",
			"Name": "九里区",
			"sort": 1
		}, {
			"Code": "320011",
			"Name": "沛县 ",
			"sort": 2
		}, {
			"Code": "320011",
			"Name": "丰县",
			"sort": 3
		}, {
			"Code": "320011",
			"Name": "贾汪区 ",
			"sort": 4
		}, {
			"Code": "320011",
			"Name": "邳州市 ",
			"sort": 5
		}, {
			"Code": "320011",
			"Name": "新沂市 ",
			"sort": 6
		}, {
			"Code": "320011",
			"Name": "铜山新区",
			"sort": 7
		}, {
			"Code": "320011",
			"Name": "泉山区",
			"sort": 8
		}, {
			"Code": "320011",
			"Name": "云龙区",
			"sort": 9
		}, {
			"Code": "320011",
			"Name": "鼓楼区",
			"sort": 10
		}, {
			"Code": "320011",
			"Name": "睢宁县 ",
			"sort": 11
		}, {
			"Code": "320011",
			"Name": "金山桥开发区",
			"sort": 12
		}],
		"sort": 11
	}, {
		"Code": "320012",
		"Name": "无锡市",
		"level": [{
			"Code": "320012",
			"Name": "宜兴市",
			"sort": 1
		}, {
			"Code": "320012",
			"Name": "江阴市",
			"sort": 2
		}, {
			"Code": "320012",
			"Name": "崇安区 ",
			"sort": 3
		}, {
			"Code": "320012",
			"Name": "南长区 ",
			"sort": 4
		}, {
			"Code": "320012",
			"Name": "北塘区 ",
			"sort": 5
		}, {
			"Code": "320012",
			"Name": "锡山区 ",
			"sort": 6
		}, {
			"Code": "320012",
			"Name": "惠山区 ",
			"sort": 7
		}, {
			"Code": "320012",
			"Name": "滨湖区 ",
			"sort": 8
		}, {
			"Code": "320012",
			"Name": "新区",
			"sort": 9
		}],
		"sort": 12
	}, {
		"Code": "320013",
		"Name": "宿迁市",
		"level": [{
			"Code": "320013",
			"Name": "泗洪县 ",
			"sort": 1
		}, {
			"Code": "320013",
			"Name": "宿城区 ",
			"sort": 2
		}, {
			"Code": "320013",
			"Name": "宿豫经济开发区",
			"sort": 3
		}, {
			"Code": "320013",
			"Name": "沭阳县 ",
			"sort": 4
		}, {
			"Code": "320013",
			"Name": "宿豫区",
			"sort": 5
		}, {
			"Code": "320013",
			"Name": "泗阳县 ",
			"sort": 6
		}, {
			"Code": "320013",
			"Name": "市区",
			"sort": 7
		}, {
			"Code": "320013",
			"Name": "宿迁经济开发区",
			"sort": 8
		}],
		"sort": 13
	}]
}, {
	"Code": "330000",
	"Name": "浙江省",
	"level": [{
		"Code": "330001",
		"Name": "余姚市",
		"sort": 1,
		"level": [{
			"Code": "330001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "330002",
		"Name": "乐清市",
		"sort": 2,
		"level": [{
			"Code": "330002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "330003",
		"Name": "义乌市",
		"sort": 3,
		"level": [{
			"Code": "330003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "330004",
		"Name": "海宁市",
		"sort": 4,
		"level": [{
			"Code": "330004",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "330005",
		"Name": "奉化市",
		"sort": 5,
		"level": [{
			"Code": "330005",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "330006",
		"Name": "慈溪市",
		"sort": 6,
		"level": [{
			"Code": "330006",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "330007",
		"Name": "丽水市",
		"level": [{
			"Code": "330007",
			"Name": "莲都区  ",
			"sort": 1
		}, {
			"Code": "330007",
			"Name": "青田县 ",
			"level": [{
				"Code": "5403",
				"Name": "鹤城镇"
			}, {
				"Code": "5404",
				"Name": "温溪镇"
			}],
			"sort": 2
		}, {
			"Code": "330007",
			"Name": "缙云县 ",
			"sort": 3
		}, {
			"Code": "330007",
			"Name": "遂昌县 ",
			"sort": 4
		}, {
			"Code": "330007",
			"Name": "松阳县 ",
			"sort": 5
		}, {
			"Code": "330007",
			"Name": "云和县 ",
			"level": [{
				"Code": "5402",
				"Name": "云和镇"
			}],
			"sort": 6
		}, {
			"Code": "330007",
			"Name": "庆元县 ",
			"sort": 7
		}, {
			"Code": "330007",
			"Name": "景宁畲族自治县 ",
			"sort": 8
		}, {
			"Code": "330007",
			"Name": "龙泉市 ",
			"sort": 9
		}],
		"sort": 7
	}, {
		"Code": "330008",
		"Name": "台州市",
		"level": [{
			"Code": "330008",
			"Name": "椒江区  ",
			"sort": 1
		}, {
			"Code": "330008",
			"Name": "黄岩区 ",
			"sort": 2
		}, {
			"Code": "330008",
			"Name": "路桥区 ",
			"sort": 3
		}, {
			"Code": "330008",
			"Name": "玉环县 ",
			"level": [{
				"Code": "5375",
				"Name": "珠港镇（城关镇）"
			}, {
				"Code": "5376",
				"Name": "坎门镇"
			}, {
				"Code": "5377",
				"Name": "陈屿镇"
			}, {
				"Code": "5378",
				"Name": "普南工业区"
			}, {
				"Code": "5379",
				"Name": "清港镇"
			}, {
				"Code": "5380",
				"Name": "楚门镇"
			}, {
				"Code": "5381",
				"Name": "芦蒲镇"
			}, {
				"Code": "5382",
				"Name": "干江镇 "
			}],
			"sort": 4
		}, {
			"Code": "330008",
			"Name": "天台县 ",
			"level": [{
				"Code": "5383",
				"Name": "县城中心"
			}, {
				"Code": "5384",
				"Name": "坦头工业区"
			}],
			"sort": 5
		}, {
			"Code": "330008",
			"Name": "三门县",
			"sort": 6
		}, {
			"Code": "330008",
			"Name": "仙居县 ",
			"level": [{
				"Code": "5385",
				"Name": "城关镇"
			}, {
				"Code": "5386",
				"Name": "下各镇"
			}, {
				"Code": "5387",
				"Name": "官路镇"
			}],
			"sort": 7
		}, {
			"Code": "330008",
			"Name": "温岭市 ",
			"level": [{
				"Code": "5395",
				"Name": "松门镇"
			}, {
				"Code": "5396",
				"Name": "箬横镇"
			}, {
				"Code": "5397",
				"Name": "新河镇"
			}, {
				"Code": "5398",
				"Name": "温峤镇"
			}, {
				"Code": "5399",
				"Name": "滨海镇"
			}, {
				"Code": "5400",
				"Name": "城南镇"
			}, {
				"Code": "5401",
				"Name": "坞根镇"
			}],
			"sort": 8
		}, {
			"Code": "330008",
			"Name": "临海市",
			"level": [{
				"Code": "5388",
				"Name": "东塍镇"
			}, {
				"Code": "5389",
				"Name": "沿江镇"
			}, {
				"Code": "5390",
				"Name": "涌泉镇"
			}, {
				"Code": "5391",
				"Name": "尤溪镇"
			}, {
				"Code": "5392",
				"Name": "杜桥镇"
			}, {
				"Code": "5393",
				"Name": "白水洋镇"
			}, {
				"Code": "5394",
				"Name": "双港镇"
			}, {
				"Code": "6060",
				"Name": "市区"
			}],
			"sort": 9
		}],
		"sort": 8
	}, {
		"Code": "330009",
		"Name": "舟山市",
		"level": [{
			"Code": "330009",
			"Name": "定海区 ",
			"sort": 1
		}, {
			"Code": "330009",
			"Name": "普陀区 ",
			"sort": 2
		}, {
			"Code": "330009",
			"Name": "岱山县 ",
			"sort": 3
		}, {
			"Code": "330009",
			"Name": "嵊泗县 ",
			"sort": 4
		}, {
			"Code": "330009",
			"Name": "东港开发区",
			"sort": 5
		}, {
			"Code": "330009",
			"Name": "浦西开发区",
			"sort": 6
		}],
		"sort": 9
	}, {
		"Code": "330010",
		"Name": "衢州市",
		"level": [{
			"Code": "330010",
			"Name": "柯城区 ",
			"sort": 1
		}, {
			"Code": "330010",
			"Name": "衢江区 ",
			"sort": 2
		}, {
			"Code": "330010",
			"Name": "常山县 ",
			"level": [{
				"Code": "5363",
				"Name": "天马镇"
			}],
			"sort": 3
		}, {
			"Code": "330010",
			"Name": "开化县 ",
			"sort": 4
		}, {
			"Code": "330010",
			"Name": "龙游县 ",
			"level": [{
				"Code": "5364",
				"Name": "龙游镇"
			}, {
				"Code": "5365",
				"Name": "城南工业区"
			}, {
				"Code": "5366",
				"Name": "灵江工业区"
			}, {
				"Code": "5367",
				"Name": "城北工业区"
			}, {
				"Code": "5368",
				"Name": "小南海镇"
			}, {
				"Code": "5369",
				"Name": "湖镇镇"
			}],
			"sort": 5
		}, {
			"Code": "330010",
			"Name": "江山市 ",
			"level": [{
				"Code": "5370",
				"Name": "上余镇"
			}, {
				"Code": "5371",
				"Name": "贺村镇"
			}, {
				"Code": "5372",
				"Name": "城南工业区"
			}],
			"sort": 6
		}],
		"sort": 10
	}, {
		"Code": "330011",
		"Name": "金华市",
		"level": [{
			"Code": "330011",
			"Name": "婺城区 ",
			"sort": 1
		}, {
			"Code": "330011",
			"Name": "金东区 ",
			"sort": 2
		}, {
			"Code": "330011",
			"Name": "武义县 ",
			"level": [{
				"Code": "5335",
				"Name": "桐琴镇"
			}, {
				"Code": "5336",
				"Name": "泉溪镇"
			}, {
				"Code": "5337",
				"Name": "履坦镇"
			}, {
				"Code": "5338",
				"Name": "王宅镇"
			}, {
				"Code": "5339",
				"Name": "白洋渡工业区"
			}, {
				"Code": "5340",
				"Name": "百花山工业区"
			}, {
				"Code": "5341",
				"Name": "深塘工业区"
			}, {
				"Code": "5342",
				"Name": "牛背金工业区"
			}],
			"sort": 3
		}, {
			"Code": "330011",
			"Name": "浦江县 ",
			"level": [{
				"Code": "5343",
				"Name": "浦阳镇"
			}, {
				"Code": "5344",
				"Name": "黄宅镇"
			}, {
				"Code": "5345",
				"Name": "白马镇"
			}, {
				"Code": "5346",
				"Name": "郑宅镇"
			}, {
				"Code": "5347",
				"Name": "郑家坞镇"
			}, {
				"Code": "5348",
				"Name": "岩头镇"
			}],
			"sort": 4
		}, {
			"Code": "330011",
			"Name": "磐安县 ",
			"level": [{
				"Code": "5349",
				"Name": "县城中心"
			}],
			"sort": 5
		}, {
			"Code": "330011",
			"Name": "兰溪市 ",
			"level": [{
				"Code": "5350",
				"Name": "厚仁镇"
			}, {
				"Code": "5351",
				"Name": "黄店镇"
			}, {
				"Code": "5352",
				"Name": "香溪镇"
			}, {
				"Code": "5353",
				"Name": "马涧镇"
			}],
			"sort": 6
		}, {
			"Code": "330011",
			"Name": "义乌市 ",
			"sort": 7
		}, {
			"Code": "330011",
			"Name": "东阳市 ",
			"level": [{
				"Code": "5354",
				"Name": "市区"
			}, {
				"Code": "5355",
				"Name": "横店镇"
			}, {
				"Code": "5356",
				"Name": "湖溪镇"
			}, {
				"Code": "5357",
				"Name": "歌山镇"
			}, {
				"Code": "5358",
				"Name": "南马镇"
			}, {
				"Code": "5359",
				"Name": "巍山镇"
			}, {
				"Code": "5360",
				"Name": "千祥镇"
			}, {
				"Code": "5361",
				"Name": "画水镇"
			}, {
				"Code": "5362",
				"Name": "马宅镇"
			}],
			"sort": 8
		}, {
			"Code": "330011",
			"Name": "永康市 ",
			"sort": 9
		}],
		"sort": 11
	}, {
		"Code": "330012",
		"Name": "绍兴市",
		"level": [{
			"Code": "330012",
			"Name": "越城区 ",
			"sort": 1
		}, {
			"Code": "330012",
			"Name": "绍兴县 ",
			"sort": 2
		}, {
			"Code": "330012",
			"Name": "新昌县 ",
			"level": [{
				"Code": "5277",
				"Name": "城关镇"
			}, {
				"Code": "5278",
				"Name": "拔茅镇"
			}, {
				"Code": "5279",
				"Name": "梅渚镇"
			}, {
				"Code": "5280",
				"Name": "澄潭镇"
			}, {
				"Code": "5281",
				"Name": "儒岙镇"
			}],
			"sort": 3
		}, {
			"Code": "330012",
			"Name": "诸暨市 ",
			"level": [{
				"Code": "5282",
				"Name": "城关镇"
			}, {
				"Code": "5295",
				"Name": "安华镇"
			}, {
				"Code": "5296",
				"Name": "应店街镇"
			}, {
				"Code": "5297",
				"Name": "直埠镇"
			}, {
				"Code": "5298",
				"Name": "次坞镇"
			}, {
				"Code": "5299",
				"Name": "同山镇"
			}, {
				"Code": "5300",
				"Name": "赵家镇"
			}, {
				"Code": "5301",
				"Name": "湄池镇"
			}, {
				"Code": "5302",
				"Name": "璜山镇"
			}, {
				"Code": "5303",
				"Name": "牌头镇"
			}, {
				"Code": "5304",
				"Name": "里浦镇"
			}, {
				"Code": "5294",
				"Name": "阮市镇"
			}, {
				"Code": "5293",
				"Name": "店口镇"
			}, {
				"Code": "5283",
				"Name": "三都镇"
			}, {
				"Code": "5284",
				"Name": "大唐镇"
			}, {
				"Code": "5285",
				"Name": "草塔镇"
			}, {
				"Code": "5286",
				"Name": "五一镇"
			}, {
				"Code": "5287",
				"Name": "山下湖镇"
			}, {
				"Code": "5288",
				"Name": "江藻镇"
			}, {
				"Code": "5289",
				"Name": "五泄镇"
			}, {
				"Code": "5290",
				"Name": "枫桥镇"
			}, {
				"Code": "5291",
				"Name": "双桥镇"
			}, {
				"Code": "5292",
				"Name": "街亭镇"
			}, {
				"Code": "5305",
				"Name": "王家井镇"
			}],
			"sort": 4
		}, {
			"Code": "330012",
			"Name": "上虞市 ",
			"level": [{
				"Code": "5306",
				"Name": "百官镇"
			}, {
				"Code": "5320",
				"Name": "上浦镇"
			}, {
				"Code": "5319",
				"Name": "永和镇"
			}, {
				"Code": "5318",
				"Name": "汤浦镇"
			}, {
				"Code": "5317",
				"Name": "东关镇"
			}, {
				"Code": "5316",
				"Name": "沥海镇"
			}, {
				"Code": "5315",
				"Name": "丰惠镇"
			}, {
				"Code": "5314",
				"Name": "梁湖镇"
			}, {
				"Code": "5313",
				"Name": "道墟镇"
			}, {
				"Code": "5312",
				"Name": "松厦镇"
			}, {
				"Code": "5311",
				"Name": "谢塘镇"
			}, {
				"Code": "5310",
				"Name": "驿亭镇"
			}, {
				"Code": "5309",
				"Name": "小越镇"
			}, {
				"Code": "5308",
				"Name": "盖北镇"
			}, {
				"Code": "5307",
				"Name": "长塘镇"
			}, {
				"Code": "5321",
				"Name": "章镇"
			}],
			"sort": 5
		}, {
			"Code": "330012",
			"Name": "嵊州市 ",
			"level": [{
				"Code": "5322",
				"Name": "城关镇"
			}, {
				"Code": "5333",
				"Name": "三界镇"
			}, {
				"Code": "5332",
				"Name": "石磺镇"
			}, {
				"Code": "5331",
				"Name": "富润镇"
			}, {
				"Code": "5330",
				"Name": "崇仁镇"
			}, {
				"Code": "5329",
				"Name": "黄泽镇"
			}, {
				"Code": "5328",
				"Name": "开元镇"
			}, {
				"Code": "5327",
				"Name": "博济镇"
			}, {
				"Code": "5326",
				"Name": "甘霖镇"
			}, {
				"Code": "5325",
				"Name": "长乐镇"
			}, {
				"Code": "5324",
				"Name": "蛟镇"
			}, {
				"Code": "5323",
				"Name": "城东经济开发区"
			}, {
				"Code": "5334",
				"Name": "仙岩镇"
			}],
			"sort": 6
		}],
		"sort": 12
	}, {
		"Code": "330013",
		"Name": "湖州市",
		"level": [{
			"Code": "330013",
			"Name": "吴兴区 ",
			"sort": 1
		}, {
			"Code": "330013",
			"Name": "南浔区 ",
			"sort": 2
		}, {
			"Code": "330013",
			"Name": "德清县 ",
			"sort": 3
		}, {
			"Code": "330013",
			"Name": "长兴县 ",
			"sort": 4
		}, {
			"Code": "330013",
			"Name": "安吉县 ",
			"level": [{
				"Code": "5267",
				"Name": "孝丰镇"
			}, {
				"Code": "5275",
				"Name": "良朋镇"
			}, {
				"Code": "5274",
				"Name": "高禹镇"
			}, {
				"Code": "5273",
				"Name": "杭垓镇"
			}, {
				"Code": "5272",
				"Name": "章村镇"
			}, {
				"Code": "5271",
				"Name": "报福镇"
			}, {
				"Code": "5270",
				"Name": "晓墅镇"
			}, {
				"Code": "5269",
				"Name": "梅溪镇"
			}, {
				"Code": "5268",
				"Name": "天荒坪镇"
			}, {
				"Code": "5276",
				"Name": "鄣吴镇"
			}],
			"sort": 5
		}],
		"sort": 13
	}, {
		"Code": "330014",
		"Name": "嘉兴市",
		"level": [{
			"Code": "330014",
			"Name": "南湖区 ",
			"sort": 1
		}, {
			"Code": "330014",
			"Name": "秀洲区  ",
			"sort": 2
		}, {
			"Code": "330014",
			"Name": "嘉善县 ",
			"sort": 3
		}, {
			"Code": "330014",
			"Name": "海盐县 ",
			"sort": 4
		}, {
			"Code": "330014",
			"Name": "海宁市 ",
			"sort": 5
		}, {
			"Code": "330014",
			"Name": "平湖市 ",
			"sort": 6
		}, {
			"Code": "330014",
			"Name": "桐乡市 ",
			"sort": 7
		}],
		"sort": 14
	}, {
		"Code": "330015",
		"Name": "温州市",
		"level": [{
			"Code": "330015",
			"Name": "鹿城区  ",
			"sort": 1
		}, {
			"Code": "330015",
			"Name": "瑞安市 ",
			"level": [{
				"Code": "5218",
				"Name": "安阳新区"
			}, {
				"Code": "5236",
				"Name": "潮基镇"
			}, {
				"Code": "5235",
				"Name": "陶山镇"
			}, {
				"Code": "5234",
				"Name": "马屿镇"
			}, {
				"Code": "5233",
				"Name": "罗凤镇"
			}, {
				"Code": "5232",
				"Name": "仙降镇"
			}, {
				"Code": "5231",
				"Name": "飞云镇"
			}, {
				"Code": "5229",
				"Name": "东山镇"
			}, {
				"Code": "5228",
				"Name": "场桥镇"
			}, {
				"Code": "5227",
				"Name": "海安镇"
			}, {
				"Code": "5226",
				"Name": "上望镇"
			}, {
				"Code": "5225",
				"Name": "桐浦镇"
			}, {
				"Code": "5224",
				"Name": "鲍田镇"
			}, {
				"Code": "5223",
				"Name": "城关镇"
			}, {
				"Code": "5222",
				"Name": "汀田镇"
			}, {
				"Code": "5221",
				"Name": "莘塍镇"
			}, {
				"Code": "5220",
				"Name": "碧山镇"
			}, {
				"Code": "5219",
				"Name": "塘下镇"
			}, {
				"Code": "5237",
				"Name": "湖岭镇"
			}],
			"sort": 2
		}, {
			"Code": "330015",
			"Name": "泰顺县 ",
			"sort": 3
		}, {
			"Code": "330015",
			"Name": "文成县 ",
			"sort": 4
		}, {
			"Code": "330015",
			"Name": "苍南县 ",
			"level": [{
				"Code": "5246",
				"Name": "龙港镇"
			}, {
				"Code": "5247",
				"Name": "金乡镇"
			}, {
				"Code": "5248",
				"Name": "钱库镇"
			}, {
				"Code": "5249",
				"Name": "芦浦镇"
			}, {
				"Code": "5250",
				"Name": "宜山镇"
			}, {
				"Code": "5251",
				"Name": "望里镇"
			}, {
				"Code": "5252",
				"Name": "灵溪镇"
			}, {
				"Code": "5253",
				"Name": "湖前镇"
			}],
			"sort": 5
		}, {
			"Code": "330015",
			"Name": "平阳县 ",
			"level": [{
				"Code": "5254",
				"Name": "郑楼镇"
			}, {
				"Code": "5265",
				"Name": "宋埠镇"
			}, {
				"Code": "5264",
				"Name": "宋桥镇"
			}, {
				"Code": "5263",
				"Name": "麻步镇"
			}, {
				"Code": "5262",
				"Name": "滕蛟镇"
			}, {
				"Code": "5261",
				"Name": "萧江镇"
			}, {
				"Code": "5260",
				"Name": "钱仓镇"
			}, {
				"Code": "5259",
				"Name": "昆阳镇"
			}, {
				"Code": "5258",
				"Name": "鳌江镇"
			}, {
				"Code": "5257",
				"Name": "榆垟镇"
			}, {
				"Code": "5256",
				"Name": "下宋工业园"
			}, {
				"Code": "5255",
				"Name": "水头镇"
			}, {
				"Code": "5266",
				"Name": "凤卧镇"
			}],
			"sort": 6
		}, {
			"Code": "330015",
			"Name": "永嘉县 ",
			"level": [{
				"Code": "5238",
				"Name": "桥头镇"
			}, {
				"Code": "5239",
				"Name": "瓯北镇"
			}, {
				"Code": "5241",
				"Name": "上塘镇"
			}, {
				"Code": "5242",
				"Name": "下塘镇"
			}, {
				"Code": "5243",
				"Name": "沙头镇"
			}, {
				"Code": "5244",
				"Name": "乌牛镇"
			}, {
				"Code": "5245",
				"Name": "桥下镇"
			}],
			"sort": 7
		}, {
			"Code": "330015",
			"Name": "洞头县 ",
			"sort": 8
		}, {
			"Code": "330015",
			"Name": "瓯海区 ",
			"sort": 9
		}, {
			"Code": "330015",
			"Name": "龙湾区 ",
			"sort": 10
		}, {
			"Code": "330015",
			"Name": "乐清市 ",
			"level": [{
				"Code": "5197",
				"Name": "乐成镇"
			}, {
				"Code": "5216",
				"Name": "湖雾镇"
			}, {
				"Code": "5215",
				"Name": "芙蓉镇"
			}, {
				"Code": "5214",
				"Name": "清江镇"
			}, {
				"Code": "5213",
				"Name": "白石镇"
			}, {
				"Code": "5212",
				"Name": "南塘镇"
			}, {
				"Code": "5211",
				"Name": "蒲歧镇"
			}, {
				"Code": "5210",
				"Name": "黄华镇"
			}, {
				"Code": "5209",
				"Name": "石帆镇"
			}, {
				"Code": "5207",
				"Name": "象阳镇"
			}, {
				"Code": "5206",
				"Name": "磐石镇"
			}, {
				"Code": "5204",
				"Name": "淡溪镇"
			}, {
				"Code": "5203",
				"Name": "翁垟镇"
			}, {
				"Code": "5202",
				"Name": "虹桥镇"
			}, {
				"Code": "5201",
				"Name": "乐城镇"
			}, {
				"Code": "5200",
				"Name": "七里港镇"
			}, {
				"Code": "5199",
				"Name": "柳市镇"
			}, {
				"Code": "5198",
				"Name": "北白象镇"
			}, {
				"Code": "5217",
				"Name": "大荆镇"
			}],
			"sort": 11
		}],
		"sort": 15
	}, {
		"Code": "330016",
		"Name": "宁波市",
		"level": [{
			"Code": "330016",
			"Name": "海曙区 ",
			"sort": 1
		}, {
			"Code": "330016",
			"Name": "慈溪市 ",
			"sort": 2
		}, {
			"Code": "330016",
			"Name": "余姚市 ",
			"sort": 3
		}, {
			"Code": "330016",
			"Name": "宁海县 ",
			"level": [{
				"Code": "5185",
				"Name": "宁海新兴工业园区"
			}, {
				"Code": "5194",
				"Name": "力洋镇"
			}, {
				"Code": "5193",
				"Name": "前童镇"
			}, {
				"Code": "5192",
				"Name": "岔路镇"
			}, {
				"Code": "5191",
				"Name": "强胶镇"
			}, {
				"Code": "5190",
				"Name": "深圳镇"
			}, {
				"Code": "5189",
				"Name": "黄坛镇"
			}, {
				"Code": "5188",
				"Name": "大佳何镇"
			}, {
				"Code": "5187",
				"Name": "西店镇"
			}, {
				"Code": "5186",
				"Name": "宁海科技园区"
			}, {
				"Code": "5196",
				"Name": "长街镇"
			}],
			"sort": 4
		}, {
			"Code": "330016",
			"Name": "象山县 ",
			"level": [{
				"Code": "5179",
				"Name": "丹城镇"
			}, {
				"Code": "5180",
				"Name": "大徐镇"
			}, {
				"Code": "5182",
				"Name": "墙头镇"
			}, {
				"Code": "5183",
				"Name": "西周镇"
			}, {
				"Code": "5184",
				"Name": "石浦镇"
			}],
			"sort": 5
		}, {
			"Code": "330016",
			"Name": "鄞州区 ",
			"sort": 6
		}, {
			"Code": "330016",
			"Name": "镇海区 ",
			"sort": 7
		}, {
			"Code": "330016",
			"Name": "北仑区 ",
			"sort": 8
		}, {
			"Code": "330016",
			"Name": "江北区  ",
			"sort": 9
		}, {
			"Code": "330016",
			"Name": "江东区 ",
			"sort": 10
		}, {
			"Code": "330016",
			"Name": "奉化市",
			"sort": 11
		}],
		"sort": 16
	}, {
		"Code": "330017",
		"Name": "杭州市",
		"level": [{
			"Code": "330017",
			"Name": "江干区 ",
			"sort": 1
		}, {
			"Code": "330017",
			"Name": "富阳市 ",
			"sort": 2
		}, {
			"Code": "330017",
			"Name": "建德市 ",
			"level": [{
				"Code": "5172",
				"Name": "干潭镇"
			}, {
				"Code": "5173",
				"Name": "安仁镇"
			}, {
				"Code": "5174",
				"Name": "洋溪街道"
			}, {
				"Code": "5175",
				"Name": "梅城镇"
			}, {
				"Code": "5176",
				"Name": "杨村桥镇"
			}, {
				"Code": "5177",
				"Name": "下涯镇"
			}],
			"sort": 3
		}, {
			"Code": "330017",
			"Name": "淳安县 ",
			"level": [{
				"Code": "5178",
				"Name": "千岛湖镇"
			}],
			"sort": 4
		}, {
			"Code": "330017",
			"Name": "桐庐县 ",
			"level": [{
				"Code": "5161",
				"Name": "洋洲经济开发区"
			}, {
				"Code": "5170",
				"Name": "百江镇"
			}, {
				"Code": "5169",
				"Name": "富春江镇"
			}, {
				"Code": "5168",
				"Name": "凤川镇"
			}, {
				"Code": "5167",
				"Name": "分水镇"
			}, {
				"Code": "5166",
				"Name": "江南镇"
			}, {
				"Code": "5165",
				"Name": "方埠开发区"
			}, {
				"Code": "5164",
				"Name": "横村镇"
			}, {
				"Code": "5163",
				"Name": "双湖开发区"
			}, {
				"Code": "5162",
				"Name": "桐庐经济开发区"
			}, {
				"Code": "5171",
				"Name": "瑶琳镇"
			}],
			"sort": 5
		}, {
			"Code": "330017",
			"Name": "余杭区 ",
			"sort": 6
		}, {
			"Code": "330017",
			"Name": "萧山区 ",
			"sort": 7
		}, {
			"Code": "330017",
			"Name": "滨江区 ",
			"sort": 8
		}, {
			"Code": "330017",
			"Name": "西湖区 ",
			"sort": 9
		}, {
			"Code": "330017",
			"Name": "拱墅区 ",
			"sort": 10
		}, {
			"Code": "330017",
			"Name": "下城区 ",
			"sort": 11
		}, {
			"Code": "330017",
			"Name": "上城区 ",
			"sort": 12
		}, {
			"Code": "330017",
			"Name": "临安市 ",
			"level": [{
				"Code": "5154",
				"Name": "临安经济开发区"
			}, {
				"Code": "5155",
				"Name": "高虹镇"
			}, {
				"Code": "5156",
				"Name": "藻溪镇"
			}, {
				"Code": "5157",
				"Name": "于潜镇"
			}, {
				"Code": "5158",
				"Name": "横畈镇"
			}, {
				"Code": "5159",
				"Name": "昌化镇"
			}, {
				"Code": "5160",
				"Name": "太阳镇"
			}],
			"sort": 13
		}],
		"sort": 17
	}]
}, {
	"Code": "340000",
	"Name": "安徽省",
	"level": [{
		"Code": "340001",
		"Name": "合肥市",
		"level": [{
			"Code": "340001",
			"Name": "瑶海区 ",
			"sort": 1
		}, {
			"Code": "340001",
			"Name": "经济开发区",
			"sort": 2
		}, {
			"Code": "340001",
			"Name": "循环经济开发区",
			"sort": 3
		}, {
			"Code": "340001",
			"Name": "高新经济开发区",
			"sort": 4
		}, {
			"Code": "340001",
			"Name": "肥西县 ",
			"level": [{
				"Code": "5411",
				"Name": "桃花工业园区"
			}, {
				"Code": "5412",
				"Name": "南岗镇"
			}],
			"sort": 5
		}, {
			"Code": "340001",
			"Name": "肥东县 ",
			"level": [{
				"Code": "5409",
				"Name": "肥东新城开发区"
			}, {
				"Code": "5410",
				"Name": "店埠镇"
			}],
			"sort": 6
		}, {
			"Code": "340001",
			"Name": "长丰县 ",
			"level": [{
				"Code": "5408",
				"Name": "双凤工业园区 "
			}],
			"sort": 7
		}, {
			"Code": "340001",
			"Name": "包河区 ",
			"sort": 8
		}, {
			"Code": "340001",
			"Name": "蜀山区 ",
			"sort": 9
		}, {
			"Code": "340001",
			"Name": "庐阳区 ",
			"sort": 10
		}, {
			"Code": "340001",
			"Name": "蒙城县",
			"sort": 11
		}],
		"sort": 1
	}, {
		"Code": "340002",
		"Name": "池州市",
		"level": [{
			"Code": "340002",
			"Name": "贵池区 ",
			"sort": 1
		}, {
			"Code": "340002",
			"Name": "东至县 ",
			"sort": 2
		}, {
			"Code": "340002",
			"Name": "石台县 ",
			"sort": 3
		}, {
			"Code": "340002",
			"Name": "青阳县 ",
			"sort": 4
		}],
		"sort": 2
	}, {
		"Code": "340003",
		"Name": "亳州市",
		"level": [{
			"Code": "340003",
			"Name": "谯城区 ",
			"sort": 1
		}, {
			"Code": "340003",
			"Name": "涡阳县 ",
			"sort": 2
		}, {
			"Code": "340003",
			"Name": "蒙城县 ",
			"sort": 3
		}, {
			"Code": "340003",
			"Name": "利辛县 ",
			"sort": 4
		}],
		"sort": 3
	}, {
		"Code": "340004",
		"Name": "六安市",
		"level": [{
			"Code": "340004",
			"Name": "金安区 ",
			"sort": 1
		}, {
			"Code": "340004",
			"Name": "裕安区 ",
			"sort": 2
		}, {
			"Code": "340004",
			"Name": "寿县 ",
			"sort": 3
		}, {
			"Code": "340004",
			"Name": "霍邱县 ",
			"sort": 4
		}, {
			"Code": "340004",
			"Name": "舒城县 ",
			"sort": 5
		}, {
			"Code": "340004",
			"Name": "金寨县 ",
			"sort": 6
		}, {
			"Code": "340004",
			"Name": "霍山县 ",
			"sort": 7
		}, {
			"Code": "340004",
			"Name": "六安经济开发区",
			"sort": 8
		}],
		"sort": 4
	}, {
		"Code": "340005",
		"Name": "巢湖市",
		"level": [{
			"Code": "340005",
			"Name": "居巢区 ",
			"sort": 1
		}, {
			"Code": "340005",
			"Name": "庐江县 ",
			"sort": 2
		}, {
			"Code": "340005",
			"Name": "无为县 ",
			"sort": 3
		}, {
			"Code": "340005",
			"Name": "含山县 ",
			"sort": 4
		}, {
			"Code": "340005",
			"Name": "和县 ",
			"sort": 5
		}, {
			"Code": "340005",
			"Name": "居巢区民营经济园",
			"sort": 6
		}],
		"sort": 5
	}, {
		"Code": "340006",
		"Name": "宿州市",
		"level": [{
			"Code": "340006",
			"Name": "埇桥区 ",
			"sort": 1
		}, {
			"Code": "340006",
			"Name": "砀山县 ",
			"sort": 2
		}, {
			"Code": "340006",
			"Name": "萧县 ",
			"sort": 3
		}, {
			"Code": "340006",
			"Name": "灵璧县 ",
			"sort": 4
		}, {
			"Code": "340006",
			"Name": "泗县 ",
			"sort": 5
		}],
		"sort": 6
	}, {
		"Code": "340007",
		"Name": "阜阳市",
		"level": [{
			"Code": "340007",
			"Name": "颍州区  ",
			"sort": 1
		}, {
			"Code": "340007",
			"Name": "颍东区 ",
			"sort": 2
		}, {
			"Code": "340007",
			"Name": "颍泉区 ",
			"sort": 3
		}, {
			"Code": "340007",
			"Name": "临泉县 ",
			"sort": 4
		}, {
			"Code": "340007",
			"Name": "太和县 ",
			"sort": 5
		}, {
			"Code": "340007",
			"Name": "阜南县 ",
			"sort": 6
		}, {
			"Code": "340007",
			"Name": "颍上县 ",
			"sort": 7
		}, {
			"Code": "340007",
			"Name": "界首市 ",
			"sort": 8
		}],
		"sort": 7
	}, {
		"Code": "340008",
		"Name": "滁州市",
		"level": [{
			"Code": "340008",
			"Name": "琅琊区 ",
			"sort": 1
		}, {
			"Code": "340008",
			"Name": "南谯区  ",
			"sort": 2
		}, {
			"Code": "340008",
			"Name": "来安县 ",
			"sort": 3
		}, {
			"Code": "340008",
			"Name": "全椒县 ",
			"sort": 4
		}, {
			"Code": "340008",
			"Name": "定远县 ",
			"sort": 5
		}, {
			"Code": "340008",
			"Name": "凤阳县 ",
			"sort": 6
		}, {
			"Code": "340008",
			"Name": "天长市 ",
			"sort": 7
		}, {
			"Code": "340008",
			"Name": "明光市 ",
			"sort": 8
		}, {
			"Code": "340008",
			"Name": "滁州市经济开发区",
			"sort": 9
		}],
		"sort": 8
	}, {
		"Code": "340009",
		"Name": "黄山市",
		"level": [{
			"Code": "340009",
			"Name": "屯溪区 ",
			"sort": 1
		}, {
			"Code": "340009",
			"Name": "黄山区 ",
			"sort": 2
		}, {
			"Code": "340009",
			"Name": "徽州区 ",
			"sort": 3
		}, {
			"Code": "340009",
			"Name": "歙县 ",
			"sort": 4
		}, {
			"Code": "340009",
			"Name": "休宁县 ",
			"sort": 5
		}, {
			"Code": "340009",
			"Name": "黟县 ",
			"sort": 6
		}, {
			"Code": "340009",
			"Name": "祁门县 ",
			"sort": 7
		}],
		"sort": 9
	}, {
		"Code": "340010",
		"Name": "安庆市",
		"level": [{
			"Code": "340010",
			"Name": "迎江区 ",
			"sort": 1
		}, {
			"Code": "340010",
			"Name": "吴咀工业园",
			"sort": 2
		}, {
			"Code": "340010",
			"Name": "安庆长江大桥综合经济开发区",
			"sort": 3
		}, {
			"Code": "340010",
			"Name": "经济技术开发区",
			"sort": 4
		}, {
			"Code": "340010",
			"Name": "桐城市 ",
			"level": [{
				"Code": "5439",
				"Name": "桐城民营技术开发区"
			}, {
				"Code": "5440",
				"Name": "市区"
			}],
			"sort": 5
		}, {
			"Code": "340010",
			"Name": "岳西县 ",
			"sort": 6
		}, {
			"Code": "340010",
			"Name": "望江县 ",
			"sort": 7
		}, {
			"Code": "340010",
			"Name": "宿松县 ",
			"sort": 8
		}, {
			"Code": "340010",
			"Name": "太湖县 ",
			"sort": 9
		}, {
			"Code": "340010",
			"Name": "潜山县 ",
			"sort": 10
		}, {
			"Code": "340010",
			"Name": "枞阳县 ",
			"sort": 11
		}, {
			"Code": "340010",
			"Name": "怀宁县 ",
			"sort": 12
		}, {
			"Code": "340010",
			"Name": "宜秀区 ",
			"sort": 13
		}, {
			"Code": "340010",
			"Name": "大观区 ",
			"sort": 14
		}, {
			"Code": "340010",
			"Name": "大旺工业园",
			"sort": 15
		}],
		"sort": 10
	}, {
		"Code": "340011",
		"Name": "铜陵市",
		"level": [{
			"Code": "340011",
			"Name": "铜官山区 ",
			"sort": 1
		}, {
			"Code": "340011",
			"Name": "狮子山区 ",
			"sort": 2
		}, {
			"Code": "340011",
			"Name": "铜陵县 ",
			"level": [{
				"Code": "5432",
				"Name": "金昌工业园"
			}, {
				"Code": "5433",
				"Name": "希望工业园 "
			}],
			"sort": 3
		}, {
			"Code": "340011",
			"Name": "郊区",
			"sort": 4
		}],
		"sort": 11
	}, {
		"Code": "340012",
		"Name": "淮北市",
		"level": [{
			"Code": "340012",
			"Name": "杜集区 ",
			"sort": 1
		}, {
			"Code": "340012",
			"Name": "相山区 ",
			"sort": 2
		}, {
			"Code": "340012",
			"Name": "烈山区 ",
			"sort": 3
		}, {
			"Code": "340012",
			"Name": "濉溪县 ",
			"sort": 4
		}],
		"sort": 12
	}, {
		"Code": "340013",
		"Name": "马鞍山市",
		"level": [{
			"Code": "340013",
			"Name": "金家庄区 ",
			"sort": 1
		}, {
			"Code": "340013",
			"Name": "花山区 ",
			"sort": 2
		}, {
			"Code": "340013",
			"Name": "雨山区 ",
			"sort": 3
		}, {
			"Code": "340013",
			"Name": "当涂县 ",
			"level": [{
				"Code": "5425",
				"Name": "当涂工业园"
			}, {
				"Code": "5426",
				"Name": "姑孰镇"
			}, {
				"Code": "5427",
				"Name": "博望镇"
			}, {
				"Code": "5428",
				"Name": "丹阳镇"
			}, {
				"Code": "5429",
				"Name": "围屏镇"
			}, {
				"Code": "5430",
				"Name": "向山镇"
			}, {
				"Code": "5431",
				"Name": "霍里镇"
			}],
			"sort": 4
		}, {
			"Code": "340013",
			"Name": "马鞍山经济开发区 ",
			"sort": 5
		}],
		"sort": 13
	}, {
		"Code": "340014",
		"Name": "淮南市",
		"level": [{
			"Code": "340014",
			"Name": "大通区 ",
			"sort": 1
		}, {
			"Code": "340014",
			"Name": "田家庵区 ",
			"sort": 2
		}, {
			"Code": "340014",
			"Name": "谢家集区 ",
			"sort": 3
		}, {
			"Code": "340014",
			"Name": "八公山区 ",
			"sort": 4
		}, {
			"Code": "340014",
			"Name": "潘集区 ",
			"sort": 5
		}, {
			"Code": "340014",
			"Name": "凤台县 ",
			"sort": 6
		}, {
			"Code": "340014",
			"Name": "钱江区",
			"sort": 7
		}],
		"sort": 14
	}, {
		"Code": "340015",
		"Name": "蚌埠市",
		"level": [{
			"Code": "340015",
			"Name": "龙子湖区 ",
			"sort": 1
		}, {
			"Code": "340015",
			"Name": "蚌山区 ",
			"sort": 2
		}, {
			"Code": "340015",
			"Name": "禹会区 ",
			"sort": 3
		}, {
			"Code": "340015",
			"Name": "淮上区 ",
			"sort": 4
		}, {
			"Code": "340015",
			"Name": "怀远县 ",
			"sort": 5
		}, {
			"Code": "340015",
			"Name": "五河县 ",
			"sort": 6
		}, {
			"Code": "340015",
			"Name": "固镇县 ",
			"sort": 7
		}, {
			"Code": "340015",
			"Name": "蚌埠新城开发区",
			"sort": 8
		}, {
			"Code": "340015",
			"Name": "高新技术产业开发区",
			"sort": 9
		}],
		"sort": 15
	}, {
		"Code": "340016",
		"Name": "芜湖市",
		"level": [{
			"Code": "340016",
			"Name": "镜湖区 ",
			"sort": 1
		}, {
			"Code": "340016",
			"Name": "弋江区 ",
			"sort": 2
		}, {
			"Code": "340016",
			"Name": "鸠江区 ",
			"sort": 3
		}, {
			"Code": "340016",
			"Name": "三山区 ",
			"sort": 4
		}, {
			"Code": "340016",
			"Name": "芜湖县 ",
			"level": [{
				"Code": "5415",
				"Name": "湾沚镇"
			}, {
				"Code": "5416",
				"Name": "三鲁工业园"
			}],
			"sort": 5
		}, {
			"Code": "340016",
			"Name": "繁昌县 ",
			"level": [{
				"Code": "5417",
				"Name": "繁阳镇"
			}, {
				"Code": "5418",
				"Name": "孙村镇"
			}, {
				"Code": "5419",
				"Name": "黄浒镇"
			}, {
				"Code": "5420",
				"Name": "峨山工业园区"
			}, {
				"Code": "5421",
				"Name": "繁昌县工业园区"
			}],
			"sort": 6
		}, {
			"Code": "340016",
			"Name": "南陵县 ",
			"sort": 7
		}, {
			"Code": "340016",
			"Name": "高新技术开发区",
			"sort": 8
		}, {
			"Code": "340016",
			"Name": "经济技术开发区",
			"sort": 9
		}],
		"sort": 16
	}, {
		"Code": "340017",
		"Name": "宣城市",
		"level": [{
			"Code": "340017",
			"Name": "宣州区 ",
			"sort": 1
		}, {
			"Code": "340017",
			"Name": "郎溪县 ",
			"sort": 2
		}, {
			"Code": "340017",
			"Name": "广德县 ",
			"level": [{
				"Code": "5450",
				"Name": "桃州镇"
			}, {
				"Code": "5451",
				"Name": "广德经济技术开发区"
			}, {
				"Code": "5452",
				"Name": "邱村镇"
			}],
			"sort": 3
		}, {
			"Code": "340017",
			"Name": "泾县 ",
			"sort": 4
		}, {
			"Code": "340017",
			"Name": "绩溪县 ",
			"sort": 5
		}, {
			"Code": "340017",
			"Name": "旌德县 ",
			"sort": 6
		}, {
			"Code": "340017",
			"Name": "宁国市 ",
			"level": [{
				"Code": "5446",
				"Name": "宁国经济技术开发区"
			}, {
				"Code": "5447",
				"Name": "宁国经济开发区"
			}, {
				"Code": "5448",
				"Name": "汪溪镇"
			}, {
				"Code": "5449",
				"Name": "河沥溪镇"
			}],
			"sort": 7
		}, {
			"Code": "340017",
			"Name": "宣城经济开发区",
			"sort": 8
		}, {
			"Code": "340017",
			"Name": "宣州工业区",
			"sort": 9
		}],
		"sort": 17
	}]
}, {
	"Code": "350000",
	"Name": "福建省",
	"level": [{
		"Code": "350001",
		"Name": "石狮市",
		"sort": 1,
		"level": [{
			"Code": "350001",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "350002",
		"Name": "晋江市",
		"sort": 2,
		"level": [{
			"Code": "350002",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "350003",
		"Name": "福清市",
		"sort": 3,
		"level": [{
			"Code": "350003",
			"Name": "--",
			"sort": 1
		}]
	}, {
		"Code": "350004",
		"Name": "宁德市",
		"level": [{
			"Code": "350004",
			"Name": "蕉城区 ",
			"sort": 1
		}, {
			"Code": "350004",
			"Name": "霞浦县 ",
			"level": [{
				"Code": "5595",
				"Name": "松城镇"
			}, {
				"Code": "5596",
				"Name": "桃源工业园区"
			}, {
				"Code": "5597",
				"Name": "三沙镇"
			}],
			"sort": 2
		}, {
			"Code": "350004",
			"Name": "古田县 ",
			"level": [{
				"Code": "5598",
				"Name": "新城镇"
			}, {
				"Code": "5599",
				"Name": "松吉乡中心"
			}, {
				"Code": "5600",
				"Name": "湖滨乡中心 "
			}],
			"sort": 3
		}, {
			"Code": "350004",
			"Name": "屏南县 ",
			"level": [{
				"Code": "5601",
				"Name": "古峰镇"
			}, {
				"Code": "5602",
				"Name": "屏城乡"
			}],
			"sort": 4
		}, {
			"Code": "350004",
			"Name": "寿宁县 ",
			"level": [{
				"Code": "5603",
				"Name": "清源乡"
			}, {
				"Code": "5604",
				"Name": "鳌阳镇"
			}],
			"sort": 5
		}, {
			"Code": "350004",
			"Name": "周宁县 ",
			"level": [{
				"Code": "5605",
				"Name": "狮城镇"
			}, {
				"Code": "5606",
				"Name": "浦源镇"
			}],
			"sort": 6
		}, {
			"Code": "350004",
			"Name": "柘荣县 ",
			"level": [{
				"Code": "5607",
				"Name": "双城镇"
			}, {
				"Code": "5608",
				"Name": "岘山洋工业区"
			}, {
				"Code": "5609",
				"Name": "东源乡"
			}],
			"sort": 7
		}, {
			"Code": "350004",
			"Name": "福安市 ",
			"level": [{
				"Code": "5610",
				"Name": "韩城镇"
			}, {
				"Code": "5611",
				"Name": "秦溪洋工业区"
			}, {
				"Code": "5612",
				"Name": "坂中工业区"
			}, {
				"Code": "5613",
				"Name": "小溪边工业区"
			}, {
				"Code": "5614",
				"Name": "南郊工业区"
			}, {
				"Code": "5615",
				"Name": "洋边"
			}, {
				"Code": "5616",
				"Name": "阳头"
			}, {
				"Code": "5617",
				"Name": "岩湖开发区"
			}, {
				"Code": "5618",
				"Name": "罗江开发区"
			}],
			"sort": 8
		}, {
			"Code": "350004",
			"Name": "福鼎市 ",
			"level": [{
				"Code": "5619",
				"Name": "桐城镇"
			}, {
				"Code": "5620",
				"Name": "流美开发区"
			}, {
				"Code": "5621",
				"Name": "龙山开发区"
			}, {
				"Code": "5622",
				"Name": "温州工业园区"
			}, {
				"Code": "5623",
				"Name": "星火工业园区"
			}, {
				"Code": "5624",
				"Name": "秦屿镇"
			}, {
				"Code": "5625",
				"Name": "店下镇"
			}],
			"sort": 9
		}],
		"sort": 4
	}, {
		"Code": "350005",
		"Name": "龙岩市",
		"level": [{
			"Code": "350005",
			"Name": "新罗区 ",
			"sort": 1
		}, {
			"Code": "350005",
			"Name": "长汀县 ",
			"sort": 2
		}, {
			"Code": "350005",
			"Name": "永定县 ",
			"sort": 3
		}, {
			"Code": "350005",
			"Name": "上杭县 ",
			"sort": 4
		}, {
			"Code": "350005",
			"Name": "武平县 ",
			"sort": 5
		}, {
			"Code": "350005",
			"Name": "连城县 ",
			"sort": 6
		}, {
			"Code": "350005",
			"Name": "漳平市 ",
			"sort": 7
		}],
		"sort": 5
	}, {
		"Code": "350006",
		"Name": "南平市",
		"level": [{
			"Code": "350006",
			"Name": "延平区 ",
			"sort": 1
		}, {
			"Code": "350006",
			"Name": "建瓯市 ",
			"sort": 2
		}, {
			"Code": "350006",
			"Name": "武夷山市 ",
			"level": [{
				"Code": "5588",
				"Name": "崇安镇"
			}, {
				"Code": "5589",
				"Name": "高速板镇"
			}, {
				"Code": "5590",
				"Name": "兴田镇"
			}, {
				"Code": "5591",
				"Name": "新村镇"
			}],
			"sort": 3
		}, {
			"Code": "350006",
			"Name": "邵武市 ",
			"level": [{
				"Code": "5585",
				"Name": "水北镇"
			}, {
				"Code": "5586",
				"Name": "下沙镇"
			}, {
				"Code": "5587",
				"Name": "郊城镇"
			}],
			"sort": 4
		}, {
			"Code": "350006",
			"Name": "政和县 ",
			"level": [{
				"Code": "5580",
				"Name": "松源工业区"
			}, {
				"Code": "5581",
				"Name": "鹤都岭工业区"
			}, {
				"Code": "5582",
				"Name": "熊山镇"
			}, {
				"Code": "5583",
				"Name": "铁山镇"
			}, {
				"Code": "5584",
				"Name": "东峰镇"
			}],
			"sort": 5
		}, {
			"Code": "350006",
			"Name": "松溪县 ",
			"level": [{
				"Code": "5579",
				"Name": "松源镇"
			}],
			"sort": 6
		}, {
			"Code": "350006",
			"Name": "光泽县 ",
			"level": [{
				"Code": "5578",
				"Name": "杭川镇 "
			}],
			"sort": 7
		}, {
			"Code": "350006",
			"Name": "浦城县 ",
			"level": [{
				"Code": "5576",
				"Name": "南浦镇"
			}, {
				"Code": "5577",
				"Name": "莲塘镇"
			}],
			"sort": 8
		}, {
			"Code": "350006",
			"Name": "顺昌县 ",
			"level": [{
				"Code": "5574",
				"Name": "水南镇"
			}, {
				"Code": "5575",
				"Name": "双溪镇"
			}],
			"sort": 9
		}, {
			"Code": "350006",
			"Name": "建阳市 ",
			"level": [{
				"Code": "5592",
				"Name": "潭城镇"
			}, {
				"Code": "5593",
				"Name": "童游镇"
			}, {
				"Code": "5594",
				"Name": "麻沙镇"
			}],
			"sort": 10
		}],
		"sort": 6
	}, {
		"Code": "350007",
		"Name": "漳州市",
		"level": [{
			"Code": "350007",
			"Name": "芗城区 ",
			"sort": 1
		}, {
			"Code": "350007",
			"Name": "华安县 ",
			"level": [{
				"Code": "5572",
				"Name": "丰山镇"
			}],
			"sort": 2
		}, {
			"Code": "350007",
			"Name": "平和县 ",
			"level": [{
				"Code": "5569",
				"Name": "小溪镇"
			}, {
				"Code": "5570",
				"Name": "山格镇"
			}, {
				"Code": "5571",
				"Name": "文峰镇"
			}],
			"sort": 3
		}, {
			"Code": "350007",
			"Name": "南靖县 ",
			"level": [{
				"Code": "5564",
				"Name": "靖城镇"
			}, {
				"Code": "5565",
				"Name": "山城镇"
			}, {
				"Code": "5566",
				"Name": "金山镇"
			}, {
				"Code": "5567",
				"Name": "龙山镇"
			}, {
				"Code": "5568",
				"Name": "丰田镇 "
			}],
			"sort": 4
		}, {
			"Code": "350007",
			"Name": "东山县 ",
			"level": [{
				"Code": "5561",
				"Name": "铜陵镇"
			}, {
				"Code": "5562",
				"Name": "西埔镇"
			}, {
				"Code": "5563",
				"Name": "东山经济技术开发区"
			}],
			"sort": 5
		}, {
			"Code": "350007",
			"Name": "长泰县 ",
			"level": [{
				"Code": "5555",
				"Name": "陈巷镇"
			}, {
				"Code": "5556",
				"Name": "武安镇"
			}, {
				"Code": "5557",
				"Name": "兴泰工业区"
			}, {
				"Code": "5558",
				"Name": "岩溪工业区"
			}, {
				"Code": "5559",
				"Name": "官山工业区 "
			}, {
				"Code": "5560",
				"Name": "上蔡"
			}],
			"sort": 6
		}, {
			"Code": "350007",
			"Name": "诏安县 ",
			"level": [{
				"Code": "5553",
				"Name": "南诏镇"
			}, {
				"Code": "5554",
				"Name": "深桥镇"
			}],
			"sort": 7
		}, {
			"Code": "350007",
			"Name": "漳浦县 ",
			"level": [{
				"Code": "5545",
				"Name": "长桥镇"
			}, {
				"Code": "5546",
				"Name": "旧镇"
			}, {
				"Code": "5547",
				"Name": "绥安镇"
			}, {
				"Code": "5548",
				"Name": "盘陀镇"
			}, {
				"Code": "5549",
				"Name": "湖西镇"
			}, {
				"Code": "5550",
				"Name": "佛昙镇"
			}, {
				"Code": "5551",
				"Name": "深土镇"
			}, {
				"Code": "5552",
				"Name": "赤湖镇"
			}],
			"sort": 8
		}, {
			"Code": "350007",
			"Name": "云霄县 ",
			"level": [{
				"Code": "5542",
				"Name": "云陵镇"
			}, {
				"Code": "5543",
				"Name": "常山工业区"
			}, {
				"Code": "5544",
				"Name": "七星工业区"
			}],
			"sort": 9
		}, {
			"Code": "350007",
			"Name": "龙文区 ",
			"sort": 10
		}, {
			"Code": "350007",
			"Name": "龙海市 ",
			"sort": 11
		}],
		"sort": 7
	}, {
		"Code": "350008",
		"Name": "泉州市",
		"level": [{
			"Code": "350008",
			"Name": "鲤城区  ",
			"sort": 1
		}, {
			"Code": "350008",
			"Name": "晋江市 ",
			"sort": 2
		}, {
			"Code": "350008",
			"Name": "石狮市 ",
			"sort": 3
		}, {
			"Code": "350008",
			"Name": "金门县 ",
			"sort": 4
		}, {
			"Code": "350008",
			"Name": "德化县 ",
			"level": [{
				"Code": "5538",
				"Name": "龙浔镇"
			}, {
				"Code": "5539",
				"Name": "浔中镇"
			}, {
				"Code": "5540",
				"Name": "三班镇"
			}, {
				"Code": "5541",
				"Name": "盖德镇"
			}],
			"sort": 5
		}, {
			"Code": "350008",
			"Name": "永春县 ",
			"level": [{
				"Code": "5530",
				"Name": "桃城镇"
			}, {
				"Code": "5531",
				"Name": "五里街镇"
			}, {
				"Code": "5532",
				"Name": "岵山镇"
			}, {
				"Code": "5533",
				"Name": "石鼓镇"
			}, {
				"Code": "5534",
				"Name": "东平镇"
			}, {
				"Code": "5535",
				"Name": "东关镇"
			}, {
				"Code": "5536",
				"Name": "达埔镇"
			}, {
				"Code": "5537",
				"Name": "蓬壶镇"
			}],
			"sort": 6
		}, {
			"Code": "350008",
			"Name": "安溪县 ",
			"level": [{
				"Code": "5525",
				"Name": "凤城镇"
			}, {
				"Code": "5526",
				"Name": "城厢镇"
			}, {
				"Code": "5527",
				"Name": "官桥镇"
			}, {
				"Code": "5528",
				"Name": "龙门镇"
			}, {
				"Code": "5529",
				"Name": "尚卿镇"
			}],
			"sort": 7
		}, {
			"Code": "350008",
			"Name": "惠安县 ",
			"level": [{
				"Code": "5520",
				"Name": "肖厝镇"
			}, {
				"Code": "5521",
				"Name": "崇武镇"
			}, {
				"Code": "5522",
				"Name": "张坂镇"
			}, {
				"Code": "5523",
				"Name": "东桥镇"
			}, {
				"Code": "5524",
				"Name": "山霞镇"
			}],
			"sort": 8
		}, {
			"Code": "350008",
			"Name": "泉港区 ",
			"sort": 9
		}, {
			"Code": "350008",
			"Name": "洛江区 ",
			"sort": 10
		}, {
			"Code": "350008",
			"Name": "丰泽区 ",
			"sort": 11
		}, {
			"Code": "350008",
			"Name": "南安市 ",
			"level": [{
				"Code": "5517",
				"Name": "永春县"
			}, {
				"Code": "5518",
				"Name": "安溪县"
			}, {
				"Code": "5519",
				"Name": "德化县"
			}],
			"sort": 12
		}],
		"sort": 8
	}, {
		"Code": "350009",
		"Name": "三明市",
		"level": [{
			"Code": "350009",
			"Name": "梅列区 ",
			"sort": 1
		}, {
			"Code": "350009",
			"Name": "建宁县 ",
			"sort": 2
		}, {
			"Code": "350009",
			"Name": "泰宁县 ",
			"sort": 3
		}, {
			"Code": "350009",
			"Name": "将乐县 ",
			"level": [{
				"Code": "5514",
				"Name": "水南镇"
			}, {
				"Code": "5515",
				"Name": "古镛镇"
			}, {
				"Code": "5516",
				"Name": "北山工业园区 "
			}],
			"sort": 4
		}, {
			"Code": "350009",
			"Name": "沙县 ",
			"level": [{
				"Code": "5506",
				"Name": "水东工业园"
			}, {
				"Code": "5507",
				"Name": "三明高新技术产业开发区"
			}, {
				"Code": "5508",
				"Name": "金古开发区"
			}, {
				"Code": "5509",
				"Name": "青州镇"
			}],
			"sort": 5
		}, {
			"Code": "350009",
			"Name": "尤溪县 ",
			"level": [{
				"Code": "5510",
				"Name": "城关镇"
			}, {
				"Code": "5511",
				"Name": "西城镇"
			}],
			"sort": 6
		}, {
			"Code": "350009",
			"Name": "大田县 ",
			"sort": 7
		}, {
			"Code": "350009",
			"Name": "宁化县 ",
			"sort": 8
		}, {
			"Code": "350009",
			"Name": "清流县 ",
			"sort": 9
		}, {
			"Code": "350009",
			"Name": "明溪县 ",
			"level": [{
				"Code": "5512",
				"Name": "雪锋镇"
			}, {
				"Code": "5513",
				"Name": "城关乡"
			}],
			"sort": 10
		}, {
			"Code": "350009",
			"Name": "三元区 ",
			"sort": 11
		}, {
			"Code": "350009",
			"Name": "永安市 ",
			"level": [{
				"Code": "5503",
				"Name": "尼葛开发区"
			}, {
				"Code": "5504",
				"Name": "贡川镇"
			}, {
				"Code": "5505",
				"Name": "曹远镇"
			}],
			"sort": 12
		}],
		"sort": 9
	}, {
		"Code": "350010",
		"Name": "莆田市",
		"level": [{
			"Code": "350010",
			"Name": "城厢区 ",
			"sort": 1
		}, {
			"Code": "350010",
			"Name": "涵江区 ",
			"sort": 2
		}, {
			"Code": "350010",
			"Name": "荔城区 ",
			"sort": 3
		}, {
			"Code": "350010",
			"Name": "秀屿区 ",
			"sort": 4
		}, {
			"Code": "350010",
			"Name": "仙游县 ",
			"sort": 5
		}],
		"sort": 10
	}, {
		"Code": "350011",
		"Name": "厦门市",
		"level": [{
			"Code": "350011",
			"Name": "思明区  ",
			"sort": 1
		}, {
			"Code": "350011",
			"Name": "海沧区 ",
			"sort": 2
		}, {
			"Code": "350011",
			"Name": "湖里区 ",
			"sort": 3
		}, {
			"Code": "350011",
			"Name": "集美区 ",
			"sort": 4
		}, {
			"Code": "350011",
			"Name": "同安区 ",
			"sort": 5
		}, {
			"Code": "350011",
			"Name": "翔安区 ",
			"sort": 6
		}],
		"sort": 11
	}, {
		"Code": "350012",
		"Name": "福州市",
		"level": [{
			"Code": "350012",
			"Name": "鼓楼区  ",
			"sort": 1
		}, {
			"Code": "350012",
			"Name": "福清市 ",
			"level": [{
				"Code": "5478",
				"Name": "融城镇"
			}, {
				"Code": "5494",
				"Name": "江镜镇"
			}, {
				"Code": "5493",
				"Name": "沙埔镇"
			}, {
				"Code": "5492",
				"Name": "三山镇"
			}, {
				"Code": "5491",
				"Name": "高山镇"
			}, {
				"Code": "5490",
				"Name": "港头镇"
			}, {
				"Code": "5489",
				"Name": "东张镇"
			}, {
				"Code": "5488",
				"Name": "新厝镇"
			}, {
				"Code": "5487",
				"Name": "海口镇"
			}, {
				"Code": "5486",
				"Name": "渔溪镇"
			}, {
				"Code": "5485",
				"Name": "阳下镇"
			}, {
				"Code": "5484",
				"Name": "上迳镇"
			}, {
				"Code": "5483",
				"Name": "城头镇"
			}, {
				"Code": "5482",
				"Name": "音西镇"
			}, {
				"Code": "5481",
				"Name": "境洋镇"
			}, {
				"Code": "5480",
				"Name": "龙田镇"
			}, {
				"Code": "5479",
				"Name": "宏路镇"
			}, {
				"Code": "5495",
				"Name": "江阴镇"
			}],
			"sort": 2
		}, {
			"Code": "350012",
			"Name": "平潭县 ",
			"sort": 3
		}, {
			"Code": "350012",
			"Name": "永泰县 ",
			"level": [{
				"Code": "5475",
				"Name": "樟城镇"
			}, {
				"Code": "5476",
				"Name": "城峰镇"
			}, {
				"Code": "5477",
				"Name": "清凉镇 "
			}],
			"sort": 4
		}, {
			"Code": "350012",
			"Name": "闽清县 ",
			"level": [{
				"Code": "5469",
				"Name": "梅城镇"
			}, {
				"Code": "5470",
				"Name": "梅溪镇"
			}, {
				"Code": "5471",
				"Name": "池园镇"
			}, {
				"Code": "5472",
				"Name": "白樟镇"
			}, {
				"Code": "5473",
				"Name": "坂东镇"
			}, {
				"Code": "5474",
				"Name": "白中镇"
			}],
			"sort": 5
		}, {
			"Code": "350012",
			"Name": "罗源县 ",
			"level": [{
				"Code": "5468",
				"Name": "凤山镇"
			}],
			"sort": 6
		}, {
			"Code": "350012",
			"Name": "连江县 ",
			"level": [{
				"Code": "5462",
				"Name": "凤城镇"
			}, {
				"Code": "5463",
				"Name": "敖江镇"
			}, {
				"Code": "5464",
				"Name": "琯头镇"
			}, {
				"Code": "5465",
				"Name": "江南镇"
			}, {
				"Code": "5466",
				"Name": "浦口镇"
			}, {
				"Code": "5467",
				"Name": "东湖镇"
			}],
			"sort": 7
		}, {
			"Code": "350012",
			"Name": "闽侯县 ",
			"level": [{
				"Code": "5453",
				"Name": "甘蔗镇"
			}, {
				"Code": "5454",
				"Name": "荆溪镇"
			}, {
				"Code": "5455",
				"Name": "白沙镇"
			}, {
				"Code": "5456",
				"Name": "青口镇"
			}, {
				"Code": "5457",
				"Name": "南屿镇"
			}, {
				"Code": "5458",
				"Name": "南通镇"
			}, {
				"Code": "5459",
				"Name": "祥谦镇"
			}, {
				"Code": "5460",
				"Name": "尚干镇"
			}, {
				"Code": "5461",
				"Name": "上街镇"
			}],
			"sort": 8
		}, {
			"Code": "350012",
			"Name": "晋安区 ",
			"sort": 9
		}, {
			"Code": "350012",
			"Name": "马尾区 ",
			"sort": 10
		}, {
			"Code": "350012",
			"Name": "仓山区 ",
			"sort": 11
		}, {
			"Code": "350012",
			"Name": "台江区 ",
			"sort": 12
		}, {
			"Code": "350012",
			"Name": "长乐市 ",
			"level": [{
				"Code": "5496",
				"Name": "玉田镇"
			}, {
				"Code": "5497",
				"Name": "松下镇"
			}, {
				"Code": "5498",
				"Name": "梅花镇"
			}, {
				"Code": "5499",
				"Name": "营前镇"
			}, {
				"Code": "5500",
				"Name": "潭头镇"
			}, {
				"Code": "5501",
				"Name": "文武砂镇"
			}, {
				"Code": "5502",
				"Name": "古槐镇"
			}, {
				"Code": "6075",
				"Name": "金峰镇"
			}],
			"sort": 13
		}],
		"sort": 12
	}]
}, {
	"Code": "360000",
	"Name": "江西省",
	"level": [{
		"Code": "360001",
		"Name": "南昌市",
		"level": [{
			"Code": "360001",
			"Name": "东湖区  ",
			"sort": 1
		}, {
			"Code": "360001",
			"Name": "红谷滩新区",
			"sort": 2
		}, {
			"Code": "360001",
			"Name": "南昌高新技术开发区",
			"sort": 3
		}, {
			"Code": "360001",
			"Name": "进贤县 ",
			"sort": 4
		}, {
			"Code": "360001",
			"Name": "安义县 ",
			"sort": 5
		}, {
			"Code": "360001",
			"Name": "新建县 ",
			"level": [{
				"Code": "5631",
				"Name": "长陵镇"
			}, {
				"Code": "5632",
				"Name": "昌北经济技术开发区"
			}, {
				"Code": "5633",
				"Name": "蛟桥镇"
			}],
			"sort": 6
		}, {
			"Code": "360001",
			"Name": "南昌县 ",
			"level": [{
				"Code": "5629",
				"Name": "小兰经济开发区"
			}, {
				"Code": "5630",
				"Name": "连塘镇"
			}],
			"sort": 7
		}, {
			"Code": "360001",
			"Name": "青山湖区 ",
			"sort": 8
		}, {
			"Code": "360001",
			"Name": "湾里区 ",
			"sort": 9
		}, {
			"Code": "360001",
			"Name": "青云谱区 ",
			"sort": 10
		}, {
			"Code": "360001",
			"Name": "西湖区 ",
			"sort": 11
		}, {
			"Code": "360001",
			"Name": "红角洲区",
			"sort": 12
		}],
		"sort": 1
	}, {
		"Code": "360002",
		"Name": "抚州市",
		"level": [{
			"Code": "360002",
			"Name": "临川区 ",
			"sort": 1
		}, {
			"Code": "360002",
			"Name": "东乡县 ",
			"sort": 2
		}, {
			"Code": "360002",
			"Name": "资溪县 ",
			"sort": 3
		}, {
			"Code": "360002",
			"Name": "金溪县 ",
			"sort": 4
		}, {
			"Code": "360002",
			"Name": "宜黄县 ",
			"sort": 5
		}, {
			"Code": "360002",
			"Name": "乐安县 ",
			"sort": 6
		}, {
			"Code": "360002",
			"Name": "崇仁县 ",
			"sort": 7
		}, {
			"Code": "360002",
			"Name": "南丰县 ",
			"sort": 8
		}, {
			"Code": "360002",
			"Name": "黎川县 ",
			"sort": 9
		}, {
			"Code": "360002",
			"Name": "南城县 ",
			"sort": 10
		}, {
			"Code": "360002",
			"Name": "广昌县 ",
			"sort": 11
		}],
		"sort": 2
	}, {
		"Code": "360003",
		"Name": "宜春市",
		"level": [{
			"Code": "360003",
			"Name": "袁州区 ",
			"sort": 1
		}, {
			"Code": "360003",
			"Name": "高安市 ",
			"sort": 2
		}, {
			"Code": "360003",
			"Name": "樟树市 ",
			"sort": 3
		}, {
			"Code": "360003",
			"Name": "丰城市 ",
			"sort": 4
		}, {
			"Code": "360003",
			"Name": "铜鼓县 ",
			"sort": 5
		}, {
			"Code": "360003",
			"Name": "靖安县 ",
			"sort": 6
		}, {
			"Code": "360003",
			"Name": "宜丰县 ",
			"sort": 7
		}, {
			"Code": "360003",
			"Name": "上高县 ",
			"sort": 8
		}, {
			"Code": "360003",
			"Name": "万载县 ",
			"sort": 9
		}, {
			"Code": "360003",
			"Name": "奉新县 ",
			"sort": 10
		}, {
			"Code": "360003",
			"Name": "马王塘经济开发区 ",
			"sort": 11
		}],
		"sort": 3
	}, {
		"Code": "360004",
		"Name": "吉安市",
		"level": [{
			"Code": "360004",
			"Name": "吉州区 ",
			"sort": 1
		}, {
			"Code": "360004",
			"Name": "永新县 ",
			"sort": 2
		}, {
			"Code": "360004",
			"Name": "安福县 ",
			"sort": 3
		}, {
			"Code": "360004",
			"Name": "万安县 ",
			"sort": 4
		}, {
			"Code": "360004",
			"Name": "遂川县 ",
			"sort": 5
		}, {
			"Code": "360004",
			"Name": "泰和县 ",
			"sort": 6
		}, {
			"Code": "360004",
			"Name": "永丰县 ",
			"sort": 7
		}, {
			"Code": "360004",
			"Name": "新干县 ",
			"sort": 8
		}, {
			"Code": "360004",
			"Name": "峡江县 ",
			"sort": 9
		}, {
			"Code": "360004",
			"Name": "吉水县 ",
			"sort": 10
		}, {
			"Code": "360004",
			"Name": "吉安县 ",
			"sort": 11
		}, {
			"Code": "360004",
			"Name": "青原区 ",
			"sort": 12
		}, {
			"Code": "360004",
			"Name": "井冈山市 ",
			"sort": 13
		}],
		"sort": 4
	}, {
		"Code": "360005",
		"Name": "赣州市",
		"level": [{
			"Code": "360005",
			"Name": "章贡区  ",
			"sort": 1
		}, {
			"Code": "360005",
			"Name": "瑞金市 ",
			"sort": 2
		}, {
			"Code": "360005",
			"Name": "石城县 ",
			"sort": 3
		}, {
			"Code": "360005",
			"Name": "寻乌县 ",
			"sort": 4
		}, {
			"Code": "360005",
			"Name": "会昌县 ",
			"sort": 5
		}, {
			"Code": "360005",
			"Name": "兴国县 ",
			"sort": 6
		}, {
			"Code": "360005",
			"Name": "于都县 ",
			"sort": 7
		}, {
			"Code": "360005",
			"Name": "宁都县 ",
			"sort": 8
		}, {
			"Code": "360005",
			"Name": "全南县 ",
			"sort": 9
		}, {
			"Code": "360005",
			"Name": "定南县 ",
			"sort": 10
		}, {
			"Code": "360005",
			"Name": "龙南县 ",
			"sort": 11
		}, {
			"Code": "360005",
			"Name": "安远县 ",
			"sort": 12
		}, {
			"Code": "360005",
			"Name": "崇义县 ",
			"sort": 13
		}, {
			"Code": "360005",
			"Name": "上犹县 ",
			"sort": 14
		}, {
			"Code": "360005",
			"Name": "大余县 ",
			"sort": 15
		}, {
			"Code": "360005",
			"Name": "信丰县 ",
			"sort": 16
		}, {
			"Code": "360005",
			"Name": "赣县 ",
			"sort": 17
		}, {
			"Code": "360005",
			"Name": "南康市 ",
			"sort": 18
		}],
		"sort": 5
	}, {
		"Code": "360006",
		"Name": "鹰潭市",
		"level": [{
			"Code": "360006",
			"Name": "月湖区 ",
			"sort": 1
		}, {
			"Code": "360006",
			"Name": "余江县 ",
			"sort": 2
		}, {
			"Code": "360006",
			"Name": "贵溪市 ",
			"sort": 3
		}],
		"sort": 6
	}, {
		"Code": "360007",
		"Name": "新余市",
		"level": [{
			"Code": "360007",
			"Name": "渝水区 ",
			"sort": 1
		}, {
			"Code": "360007",
			"Name": "分宜县 ",
			"sort": 2
		}, {
			"Code": "360007",
			"Name": "高新经济技术开发区",
			"sort": 3
		}],
		"sort": 7
	}, {
		"Code": "360008",
		"Name": "九江市",
		"level": [{
			"Code": "360008",
			"Name": "庐山区 ",
			"sort": 1
		}, {
			"Code": "360008",
			"Name": "九江经济开发区",
			"sort": 2
		}, {
			"Code": "360008",
			"Name": "瑞昌市 ",
			"sort": 3
		}, {
			"Code": "360008",
			"Name": "彭泽县 ",
			"sort": 4
		}, {
			"Code": "360008",
			"Name": "湖口县 ",
			"sort": 5
		}, {
			"Code": "360008",
			"Name": "都昌县 ",
			"sort": 6
		}, {
			"Code": "360008",
			"Name": "星子县  ",
			"sort": 7
		}, {
			"Code": "360008",
			"Name": "德安县 ",
			"sort": 8
		}, {
			"Code": "360008",
			"Name": "永修县 ",
			"sort": 9
		}, {
			"Code": "360008",
			"Name": "修水县 ",
			"sort": 10
		}, {
			"Code": "360008",
			"Name": "武宁县 ",
			"sort": 11
		}, {
			"Code": "360008",
			"Name": "九江县 ",
			"sort": 12
		}, {
			"Code": "360008",
			"Name": "浔阳区 ",
			"sort": 13
		}, {
			"Code": "360008",
			"Name": "共青开放开发区",
			"sort": 14
		}],
		"sort": 8
	}, {
		"Code": "360009",
		"Name": "萍乡市",
		"level": [{
			"Code": "360009",
			"Name": "安源区 ",
			"sort": 1
		}, {
			"Code": "360009",
			"Name": "湘东区 ",
			"sort": 2
		}, {
			"Code": "360009",
			"Name": "莲花县 ",
			"sort": 3
		}, {
			"Code": "360009",
			"Name": "上栗县 ",
			"sort": 4
		}, {
			"Code": "360009",
			"Name": "芦溪县 ",
			"sort": 5
		}],
		"sort": 9
	}, {
		"Code": "360010",
		"Name": "景德镇市",
		"level": [{
			"Code": "360010",
			"Name": "昌江区 ",
			"sort": 1
		}, {
			"Code": "360010",
			"Name": "珠山区 ",
			"sort": 2
		}, {
			"Code": "360010",
			"Name": "浮梁县 ",
			"sort": 3
		}, {
			"Code": "360010",
			"Name": "乐平市 ",
			"sort": 4
		}],
		"sort": 10
	}, {
		"Code": "360011",
		"Name": "上饶市",
		"level": [{
			"Code": "360011",
			"Name": "信州区 ",
			"sort": 1
		}, {
			"Code": "360011",
			"Name": "德兴市 ",
			"sort": 2
		}, {
			"Code": "360011",
			"Name": "婺源县 ",
			"sort": 3
		}, {
			"Code": "360011",
			"Name": "万年县 ",
			"sort": 4
		}, {
			"Code": "360011",
			"Name": "鄱阳县 ",
			"sort": 5
		}, {
			"Code": "360011",
			"Name": "余干县 ",
			"sort": 6
		}, {
			"Code": "360011",
			"Name": "弋阳县 ",
			"sort": 7
		}, {
			"Code": "360011",
			"Name": "横峰县 ",
			"sort": 8
		}, {
			"Code": "360011",
			"Name": "铅山县 ",
			"sort": 9
		}, {
			"Code": "360011",
			"Name": "玉山县 ",
			"sort": 10
		}, {
			"Code": "360011",
			"Name": "广丰县 ",
			"level": [{
				"Code": "5641",
				"Name": "县城"
			}],
			"sort": 11
		}, {
			"Code": "360011",
			"Name": "上饶县 ",
			"level": [{
				"Code": "5639",
				"Name": "旭日镇"
			}, {
				"Code": "5640",
				"Name": "上饶县工业园 "
			}],
			"sort": 12
		}, {
			"Code": "360011",
			"Name": "上饶经济技术开发区",
			"sort": 13
		}],
		"sort": 11
	}]
}, {
	"Code": "370000",
	"Name": "山东省",
	"level": [{
		"Code": "370001",
		"Name": "济南市",
		"level": [{
			"Code": "370001",
			"Name": "历下区  ",
			"sort": 1
		}, {
			"Code": "370001",
			"Name": "章丘市 ",
			"level": [{
				"Code": "5647",
				"Name": "刁镇"
			}, {
				"Code": "5655",
				"Name": "枣园镇"
			}, {
				"Code": "5654",
				"Name": "绣惠镇"
			}, {
				"Code": "5653",
				"Name": "埠村镇"
			}, {
				"Code": "5652",
				"Name": "明水镇"
			}, {
				"Code": "5651",
				"Name": "明水经济开发区"
			}, {
				"Code": "5650",
				"Name": "章丘市开发区"
			}, {
				"Code": "5649",
				"Name": "旭升镇"
			}, {
				"Code": "5648",
				"Name": "双山镇"
			}, {
				"Code": "5656",
				"Name": "相公庄镇"
			}],
			"sort": 2
		}, {
			"Code": "370001",
			"Name": "商河县 ",
			"sort": 3
		}, {
			"Code": "370001",
			"Name": "济阳县 ",
			"level": [{
				"Code": "5643",
				"Name": "县城区"
			}, {
				"Code": "5644",
				"Name": "济北开发区"
			}, {
				"Code": "5645",
				"Name": "崔寨镇"
			}, {
				"Code": "5646",
				"Name": "回河镇"
			}],
			"sort": 4
		}, {
			"Code": "370001",
			"Name": "平阴县 ",
			"sort": 5
		}, {
			"Code": "370001",
			"Name": "长清区 ",
			"sort": 6
		}, {
			"Code": "370001",
			"Name": "历城区 ",
			"sort": 7
		}, {
			"Code": "370001",
			"Name": "天桥区 ",
			"sort": 8
		}, {
			"Code": "370001",
			"Name": "槐荫区 ",
			"sort": 9
		}, {
			"Code": "370001",
			"Name": "市中区 ",
			"sort": 10
		}, {
			"Code": "370001",
			"Name": "高新技术开发区",
			"sort": 11
		}],
		"sort": 1
	}, {
		"Code": "370002",
		"Name": "滨州市",
		"level": [{
			"Code": "370002",
			"Name": "滨城区  ",
			"sort": 1
		}, {
			"Code": "370002",
			"Name": "惠民县 ",
			"sort": 2
		}, {
			"Code": "370002",
			"Name": "阳信县 ",
			"level": [{
				"Code": "5848",
				"Name": "阳信开发区"
			}],
			"sort": 3
		}, {
			"Code": "370002",
			"Name": "无棣县 ",
			"sort": 4
		}, {
			"Code": "370002",
			"Name": "沾化县 ",
			"sort": 5
		}, {
			"Code": "370002",
			"Name": "博兴县 ",
			"level": [{
				"Code": "5845",
				"Name": "县城"
			}, {
				"Code": "5846",
				"Name": "店子镇"
			}, {
				"Code": "5847",
				"Name": "湖滨镇"
			}],
			"sort": 6
		}, {
			"Code": "370002",
			"Name": "邹平县 ",
			"sort": 7
		}],
		"sort": 2
	}, {
		"Code": "370003",
		"Name": "聊城市",
		"level": [{
			"Code": "370003",
			"Name": "东昌府区  ",
			"sort": 1
		}, {
			"Code": "370003",
			"Name": "阳谷县 ",
			"sort": 2
		}, {
			"Code": "370003",
			"Name": "莘县 ",
			"sort": 3
		}, {
			"Code": "370003",
			"Name": "茌平县 ",
			"sort": 4
		}, {
			"Code": "370003",
			"Name": "东阿县 ",
			"level": [{
				"Code": "5841",
				"Name": "顾官屯镇"
			}, {
				"Code": "5842",
				"Name": "东阿科技工业园"
			}],
			"sort": 5
		}, {
			"Code": "370003",
			"Name": "冠县 ",
			"sort": 6
		}, {
			"Code": "370003",
			"Name": "高唐县 ",
			"level": [{
				"Code": "5844",
				"Name": "县中心"
			}],
			"sort": 7
		}, {
			"Code": "370003",
			"Name": "临清市 ",
			"level": [{
				"Code": "5843",
				"Name": "市中心"
			}],
			"sort": 8
		}, {
			"Code": "370003",
			"Name": "聊城经济技术开发区",
			"sort": 9
		}],
		"sort": 3
	}, {
		"Code": "370004",
		"Name": "德州市",
		"level": [{
			"Code": "370004",
			"Name": "德城区  ",
			"sort": 1
		}, {
			"Code": "370004",
			"Name": "商贸开发区",
			"sort": 2
		}, {
			"Code": "370004",
			"Name": "经济开发区",
			"sort": 3
		}, {
			"Code": "370004",
			"Name": "禹城市 ",
			"level": [{
				"Code": "5833",
				"Name": "市区"
			}, {
				"Code": "5834",
				"Name": "禹城开发区"
			}],
			"sort": 4
		}, {
			"Code": "370004",
			"Name": "乐陵市 ",
			"sort": 5
		}, {
			"Code": "370004",
			"Name": "武城县 ",
			"sort": 6
		}, {
			"Code": "370004",
			"Name": "夏津县 ",
			"sort": 7
		}, {
			"Code": "370004",
			"Name": "平原县 ",
			"sort": 8
		}, {
			"Code": "370004",
			"Name": "齐河县 ",
			"level": [{
				"Code": "5835",
				"Name": "县城"
			}, {
				"Code": "5836",
				"Name": "齐河经济开发区"
			}, {
				"Code": "5837",
				"Name": "经济开发区西区"
			}],
			"sort": 9
		}, {
			"Code": "370004",
			"Name": "临邑县 ",
			"sort": 10
		}, {
			"Code": "370004",
			"Name": "庆云县 ",
			"sort": 11
		}, {
			"Code": "370004",
			"Name": "宁津县 ",
			"level": [{
				"Code": "5832",
				"Name": "县城"
			}],
			"sort": 12
		}, {
			"Code": "370004",
			"Name": "陵县 ",
			"level": [{
				"Code": "5838",
				"Name": "县城"
			}, {
				"Code": "5839",
				"Name": "陵西开发区"
			}],
			"sort": 13
		}, {
			"Code": "370004",
			"Name": "天衢区",
			"sort": 14
		}],
		"sort": 4
	}, {
		"Code": "370005",
		"Name": "临沂市",
		"level": [{
			"Code": "370005",
			"Name": "兰山区  ",
			"sort": 1
		}, {
			"Code": "370005",
			"Name": "蒙阴县 ",
			"level": [{
				"Code": "5823",
				"Name": "县城"
			}, {
				"Code": "5824",
				"Name": "经济技术开发区"
			}],
			"sort": 2
		}, {
			"Code": "370005",
			"Name": "莒南县 ",
			"sort": 3
		}, {
			"Code": "370005",
			"Name": "平邑县 ",
			"sort": 4
		}, {
			"Code": "370005",
			"Name": "费县 ",
			"sort": 5
		}, {
			"Code": "370005",
			"Name": "苍山县 ",
			"sort": 6
		}, {
			"Code": "370005",
			"Name": "沂水县 ",
			"level": [{
				"Code": "5822",
				"Name": "县城"
			}],
			"sort": 7
		}, {
			"Code": "370005",
			"Name": "郯城县 ",
			"sort": 8
		}, {
			"Code": "370005",
			"Name": "沂南县 ",
			"level": [{
				"Code": "5819",
				"Name": "县城"
			}, {
				"Code": "5820",
				"Name": "大庄镇中心"
			}, {
				"Code": "5821",
				"Name": "铜井镇中心 "
			}],
			"sort": 9
		}, {
			"Code": "370005",
			"Name": "河东区 ",
			"sort": 10
		}, {
			"Code": "370005",
			"Name": "罗庄区 ",
			"sort": 11
		}, {
			"Code": "370005",
			"Name": "临沭县 ",
			"level": [{
				"Code": "5827",
				"Name": "县城"
			}],
			"sort": 12
		}],
		"sort": 5
	}, {
		"Code": "370006",
		"Name": "莱芜市",
		"level": [{
			"Code": "370006",
			"Name": "莱城区 ",
			"sort": 1
		}, {
			"Code": "370006",
			"Name": "钢城区 ",
			"sort": 2
		}, {
			"Code": "370006",
			"Name": "莱城经济开发区",
			"sort": 3
		}],
		"sort": 6
	}, {
		"Code": "370007",
		"Name": "日照市",
		"level": [{
			"Code": "370007",
			"Name": "东港区 ",
			"sort": 1
		}, {
			"Code": "370007",
			"Name": "岚山区 ",
			"sort": 2
		}, {
			"Code": "370007",
			"Name": "五莲县 ",
			"level": [{
				"Code": "5816",
				"Name": "县城"
			}],
			"sort": 3
		}, {
			"Code": "370007",
			"Name": "莒县 ",
			"sort": 4
		}, {
			"Code": "370007",
			"Name": "日照经济技术开发区",
			"sort": 5
		}, {
			"Code": "370007",
			"Name": "新市区",
			"sort": 6
		}, {
			"Code": "370007",
			"Name": "老市区 ",
			"sort": 7
		}],
		"sort": 7
	}, {
		"Code": "370008",
		"Name": "威海市",
		"level": [{
			"Code": "370008",
			"Name": "环翠区 ",
			"sort": 1
		}, {
			"Code": "370008",
			"Name": "文登市 ",
			"level": [{
				"Code": "5793",
				"Name": "市区"
			}, {
				"Code": "5794",
				"Name": "北郊镇"
			}, {
				"Code": "5795",
				"Name": "文登营镇"
			}, {
				"Code": "5796",
				"Name": "苘山镇"
			}, {
				"Code": "5797",
				"Name": "北效镇"
			}, {
				"Code": "5798",
				"Name": "米山镇"
			}, {
				"Code": "5799",
				"Name": "文城镇"
			}],
			"sort": 2
		}, {
			"Code": "370008",
			"Name": "荣成市 ",
			"level": [{
				"Code": "5800",
				"Name": "市区"
			}, {
				"Code": "5801",
				"Name": "石岛镇"
			}, {
				"Code": "5802",
				"Name": "虎山镇"
			}, {
				"Code": "5803",
				"Name": "上庄镇"
			}, {
				"Code": "5804",
				"Name": "滕家镇"
			}, {
				"Code": "5805",
				"Name": "崖头镇"
			}],
			"sort": 3
		}, {
			"Code": "370008",
			"Name": "乳山市 ",
			"level": [{
				"Code": "5806",
				"Name": "市区"
			}, {
				"Code": "5807",
				"Name": "夏村镇"
			}, {
				"Code": "5808",
				"Name": "乳山口镇"
			}, {
				"Code": "5809",
				"Name": "金岭开发区"
			}, {
				"Code": "5810",
				"Name": "白沙滩镇"
			}, {
				"Code": "5811",
				"Name": "海阳所镇"
			}],
			"sort": 4
		}, {
			"Code": "370008",
			"Name": "高新技术产业开发区",
			"sort": 5
		}, {
			"Code": "370008",
			"Name": "经济技术开发区",
			"sort": 6
		}],
		"sort": 8
	}, {
		"Code": "370009",
		"Name": "泰安市",
		"level": [{
			"Code": "370009",
			"Name": "泰山区 ",
			"sort": 1
		}, {
			"Code": "370009",
			"Name": "岱岳区 ",
			"sort": 2
		}, {
			"Code": "370009",
			"Name": "宁阳县 ",
			"sort": 3
		}, {
			"Code": "370009",
			"Name": "东平县 ",
			"sort": 4
		}, {
			"Code": "370009",
			"Name": "新泰市 ",
			"sort": 5
		}, {
			"Code": "370009",
			"Name": "肥城市 ",
			"level": [{
				"Code": "5786",
				"Name": "新城镇"
			}, {
				"Code": "5787",
				"Name": "肥城高新开发区"
			}, {
				"Code": "5788",
				"Name": "王瓜店镇"
			}, {
				"Code": "5789",
				"Name": "老城镇"
			}, {
				"Code": "5790",
				"Name": "市区"
			}],
			"sort": 6
		}],
		"sort": 9
	}, {
		"Code": "370010",
		"Name": "济宁市",
		"level": [{
			"Code": "370010",
			"Name": "市中区  ",
			"sort": 1
		}, {
			"Code": "370010",
			"Name": "邹城市 ",
			"level": [{
				"Code": "5785",
				"Name": "市中心"
			}],
			"sort": 2
		}, {
			"Code": "370010",
			"Name": "兖州市 ",
			"sort": 3
		}, {
			"Code": "370010",
			"Name": "曲阜市 ",
			"sort": 4
		}, {
			"Code": "370010",
			"Name": "梁山县 ",
			"sort": 5
		}, {
			"Code": "370010",
			"Name": "泗水县 ",
			"sort": 6
		}, {
			"Code": "370010",
			"Name": "汶上县 ",
			"sort": 7
		}, {
			"Code": "370010",
			"Name": "嘉祥县 ",
			"level": [{
				"Code": "5783",
				"Name": "县城"
			}, {
				"Code": "5784",
				"Name": "嘉祥经济开发区 "
			}],
			"sort": 8
		}, {
			"Code": "370010",
			"Name": "金乡县 ",
			"sort": 9
		}, {
			"Code": "370010",
			"Name": "鱼台县 ",
			"sort": 10
		}, {
			"Code": "370010",
			"Name": "微山县 ",
			"sort": 11
		}, {
			"Code": "370010",
			"Name": "任城区 ",
			"sort": 12
		}, {
			"Code": "370010",
			"Name": "济宁市高新技术产业开发区",
			"sort": 13
		}],
		"sort": 10
	}, {
		"Code": "370011",
		"Name": "潍坊市",
		"level": [{
			"Code": "370011",
			"Name": "潍城区 ",
			"sort": 1
		}, {
			"Code": "370011",
			"Name": "昌邑市 ",
			"level": [{
				"Code": "5774",
				"Name": "市区"
			}, {
				"Code": "5775",
				"Name": "经济开发区"
			}, {
				"Code": "5776",
				"Name": "柳疃镇"
			}, {
				"Code": "5777",
				"Name": "围子镇"
			}, {
				"Code": "5778",
				"Name": "仓街镇"
			}, {
				"Code": "5779",
				"Name": "宋庄镇"
			}, {
				"Code": "5780",
				"Name": "双台镇"
			}, {
				"Code": "5781",
				"Name": "饮马镇"
			}],
			"sort": 2
		}, {
			"Code": "370011",
			"Name": "高密市 ",
			"level": [{
				"Code": "5768",
				"Name": "密水街办"
			}, {
				"Code": "5769",
				"Name": "经济技术开发区"
			}, {
				"Code": "5770",
				"Name": "柏城镇"
			}, {
				"Code": "5771",
				"Name": "姚哥庄镇"
			}, {
				"Code": "5772",
				"Name": "姜庄镇"
			}, {
				"Code": "5773",
				"Name": "夏庄镇"
			}],
			"sort": 3
		}, {
			"Code": "370011",
			"Name": "安丘市 ",
			"level": [{
				"Code": "5762",
				"Name": "市区"
			}, {
				"Code": "5763",
				"Name": "经济技术开发区"
			}, {
				"Code": "5764",
				"Name": "崖头工业园区"
			}, {
				"Code": "5765",
				"Name": "刘家尧镇"
			}, {
				"Code": "5766",
				"Name": "关王镇"
			}, {
				"Code": "5767",
				"Name": "景芝镇"
			}],
			"sort": 4
		}, {
			"Code": "370011",
			"Name": "寿光市 ",
			"level": [{
				"Code": "5752",
				"Name": "市区"
			}, {
				"Code": "5760",
				"Name": "台头镇"
			}, {
				"Code": "5759",
				"Name": "上口镇"
			}, {
				"Code": "5758",
				"Name": "海化开发区"
			}, {
				"Code": "5757",
				"Name": "候镇"
			}, {
				"Code": "5756",
				"Name": "稻田镇"
			}, {
				"Code": "5755",
				"Name": "留吕镇"
			}, {
				"Code": "5754",
				"Name": "寒桥镇"
			}, {
				"Code": "5753",
				"Name": "寿光经济开发区"
			}, {
				"Code": "5761",
				"Name": "化龙镇"
			}],
			"sort": 5
		}, {
			"Code": "370011",
			"Name": "诸城市 ",
			"level": [{
				"Code": "5743",
				"Name": "市区"
			}, {
				"Code": "5744",
				"Name": "经济技术开发"
			}, {
				"Code": "5745",
				"Name": "辛兴镇"
			}, {
				"Code": "5746",
				"Name": "昌城镇"
			}, {
				"Code": "5747",
				"Name": "吕标镇"
			}, {
				"Code": "5748",
				"Name": "朱解镇"
			}, {
				"Code": "5749",
				"Name": "箭口镇"
			}, {
				"Code": "5750",
				"Name": "九台镇"
			}, {
				"Code": "5751",
				"Name": "相州镇"
			}],
			"sort": 6
		}, {
			"Code": "370011",
			"Name": "青州市 ",
			"level": [{
				"Code": "5742",
				"Name": "市区"
			}],
			"sort": 7
		}, {
			"Code": "370011",
			"Name": "昌乐县 ",
			"level": [{
				"Code": "5735",
				"Name": "县城"
			}, {
				"Code": "5736",
				"Name": "昌乐开发区"
			}, {
				"Code": "5737",
				"Name": "昌乐经济技术开发区"
			}, {
				"Code": "5738",
				"Name": "朱刘镇"
			}, {
				"Code": "5739",
				"Name": "五图镇"
			}, {
				"Code": "5740",
				"Name": "乔官镇"
			}, {
				"Code": "5741",
				"Name": "唐吾镇"
			}],
			"sort": 8
		}, {
			"Code": "370011",
			"Name": "临朐县 ",
			"level": [{
				"Code": "5731",
				"Name": "县城"
			}, {
				"Code": "5732",
				"Name": "东城区"
			}, {
				"Code": "5733",
				"Name": "营子镇中心"
			}, {
				"Code": "5734",
				"Name": "临朐经济技术开发区"
			}],
			"sort": 9
		}, {
			"Code": "370011",
			"Name": "奎文区 ",
			"sort": 10
		}, {
			"Code": "370011",
			"Name": "坊子区 ",
			"sort": 11
		}, {
			"Code": "370011",
			"Name": "寒亭区 ",
			"sort": 12
		}, {
			"Code": "370011",
			"Name": "高新技术产业开区",
			"sort": 13
		}],
		"sort": 11
	}, {
		"Code": "370012",
		"Name": "烟台市",
		"level": [{
			"Code": "370012",
			"Name": "芝罘区 ",
			"sort": 1
		}, {
			"Code": "370012",
			"Name": "海阳市 ",
			"level": [{
				"Code": "5726",
				"Name": "市区"
			}, {
				"Code": "5727",
				"Name": "海阳高新技术开发区"
			}, {
				"Code": "5728",
				"Name": "海阳城区"
			}, {
				"Code": "5729",
				"Name": "海阳开发区"
			}],
			"sort": 2
		}, {
			"Code": "370012",
			"Name": "栖霞市 ",
			"level": [{
				"Code": "5724",
				"Name": "松山镇"
			}, {
				"Code": "5725",
				"Name": "桃村镇"
			}],
			"sort": 3
		}, {
			"Code": "370012",
			"Name": "招远市 ",
			"level": [{
				"Code": "5723",
				"Name": "市区"
			}],
			"sort": 4
		}, {
			"Code": "370012",
			"Name": "蓬莱市 ",
			"level": [{
				"Code": "5721",
				"Name": "市中心"
			}, {
				"Code": "5722",
				"Name": "蓬莱经济开发区 "
			}],
			"sort": 5
		}, {
			"Code": "370012",
			"Name": "莱州市 ",
			"level": [{
				"Code": "5713",
				"Name": "莱州经济技术开发区"
			}, {
				"Code": "5714",
				"Name": "虎头崖镇经济开发区"
			}, {
				"Code": "5715",
				"Name": "大原镇"
			}, {
				"Code": "5716",
				"Name": "程郭镇"
			}, {
				"Code": "5717",
				"Name": "南十里镇"
			}, {
				"Code": "5718",
				"Name": "莱州镇"
			}, {
				"Code": "5719",
				"Name": "沙河镇"
			}, {
				"Code": "5720",
				"Name": "路旺镇"
			}],
			"sort": 6
		}, {
			"Code": "370012",
			"Name": "莱阳市 ",
			"level": [{
				"Code": "5712",
				"Name": "照旺庄镇"
			}],
			"sort": 7
		}, {
			"Code": "370012",
			"Name": "龙口市 ",
			"level": [{
				"Code": "5709",
				"Name": "龙口港开发区"
			}, {
				"Code": "5710",
				"Name": "桃村镇"
			}, {
				"Code": "5711",
				"Name": "松山镇"
			}],
			"sort": 8
		}, {
			"Code": "370012",
			"Name": "长岛县 ",
			"sort": 9
		}, {
			"Code": "370012",
			"Name": "莱山区 ",
			"sort": 10
		}, {
			"Code": "370012",
			"Name": "牟平区 ",
			"sort": 11
		}, {
			"Code": "370012",
			"Name": "福山区 ",
			"sort": 12
		}, {
			"Code": "370012",
			"Name": "烟台经济技术开发区",
			"sort": 13
		}],
		"sort": 12
	}, {
		"Code": "370013",
		"Name": "东营市",
		"level": [{
			"Code": "370013",
			"Name": "东营区 ",
			"sort": 1
		}, {
			"Code": "370013",
			"Name": "河口区 ",
			"sort": 2
		}, {
			"Code": "370013",
			"Name": "垦利县 ",
			"level": [{
				"Code": "5703",
				"Name": "县城"
			}],
			"sort": 3
		}, {
			"Code": "370013",
			"Name": "利津县 ",
			"sort": 4
		}, {
			"Code": "370013",
			"Name": "广饶县 ",
			"level": [{
				"Code": "5704",
				"Name": "经济开发区"
			}, {
				"Code": "5705",
				"Name": "大王镇"
			}, {
				"Code": "5706",
				"Name": "稻庄镇"
			}],
			"sort": 5
		}, {
			"Code": "370013",
			"Name": "西城",
			"sort": 6
		}, {
			"Code": "370013",
			"Name": "东城",
			"sort": 7
		}],
		"sort": 13
	}, {
		"Code": "370014",
		"Name": "枣庄市",
		"level": [{
			"Code": "370014",
			"Name": "市中区 ",
			"sort": 1
		}, {
			"Code": "370014",
			"Name": "薛城区 ",
			"sort": 2
		}, {
			"Code": "370014",
			"Name": "峄城区 ",
			"sort": 3
		}, {
			"Code": "370014",
			"Name": "台儿庄区 ",
			"sort": 4
		}, {
			"Code": "370014",
			"Name": "山亭区 ",
			"sort": 5
		}, {
			"Code": "370014",
			"Name": "滕州市 ",
			"sort": 6
		}, {
			"Code": "370014",
			"Name": "新城区",
			"sort": 7
		}],
		"sort": 14
	}, {
		"Code": "370015",
		"Name": "淄博市",
		"level": [{
			"Code": "370015",
			"Name": "淄川区  ",
			"sort": 1
		}, {
			"Code": "370015",
			"Name": "张店区 ",
			"sort": 2
		}, {
			"Code": "370015",
			"Name": "博山区 ",
			"sort": 3
		}, {
			"Code": "370015",
			"Name": "临淄区 ",
			"sort": 4
		}, {
			"Code": "370015",
			"Name": "周村区 ",
			"sort": 5
		}, {
			"Code": "370015",
			"Name": "桓台县 ",
			"sort": 6
		}, {
			"Code": "370015",
			"Name": "高青县 ",
			"level": [{
				"Code": "5698",
				"Name": "县城"
			}, {
				"Code": "5699",
				"Name": "高城镇"
			}],
			"sort": 7
		}, {
			"Code": "370015",
			"Name": "沂源县 ",
			"sort": 8
		}],
		"sort": 15
	}, {
		"Code": "370016",
		"Name": "青岛市",
		"level": [{
			"Code": "370016",
			"Name": "市南区 ",
			"sort": 1
		}, {
			"Code": "370016",
			"Name": "胶南市 ",
			"level": [{
				"Code": "5686",
				"Name": "市区"
			}, {
				"Code": "5687",
				"Name": "经济技术开发区"
			}, {
				"Code": "5688",
				"Name": "隐珠镇"
			}, {
				"Code": "5689",
				"Name": "王台镇"
			}, {
				"Code": "5690",
				"Name": "灵山卫镇"
			}, {
				"Code": "5691",
				"Name": "积米崖镇"
			}, {
				"Code": "5692",
				"Name": "铁山镇"
			}, {
				"Code": "5693",
				"Name": "大珠山镇"
			}],
			"sort": 2
		}, {
			"Code": "370016",
			"Name": "平度市 ",
			"level": [{
				"Code": "5679",
				"Name": "市区"
			}, {
				"Code": "5680",
				"Name": "平度市经济技术开发区"
			}, {
				"Code": "5681",
				"Name": "南村镇"
			}, {
				"Code": "5682",
				"Name": "新河工业园"
			}, {
				"Code": "5683",
				"Name": "灰埠工业园"
			}, {
				"Code": "5684",
				"Name": "长乐工业园"
			}, {
				"Code": "5685",
				"Name": "店子工业园"
			}],
			"sort": 3
		}, {
			"Code": "370016",
			"Name": "即墨市 ",
			"level": [{
				"Code": "5670",
				"Name": "即墨市经济技术开发区"
			}, {
				"Code": "5671",
				"Name": "蓝（兰）村镇"
			}, {
				"Code": "5672",
				"Name": "龙泉镇"
			}, {
				"Code": "5673",
				"Name": "南泉镇"
			}, {
				"Code": "5674",
				"Name": "普东镇"
			}, {
				"Code": "5675",
				"Name": "段泊岚镇"
			}, {
				"Code": "5676",
				"Name": "华山镇"
			}, {
				"Code": "5677",
				"Name": "灵山镇"
			}, {
				"Code": "5678",
				"Name": "大信镇"
			}],
			"sort": 4
		}, {
			"Code": "370016",
			"Name": "胶州市 ",
			"level": [{
				"Code": "5657",
				"Name": "杜村镇"
			}, {
				"Code": "5668",
				"Name": "洋河镇"
			}, {
				"Code": "5667",
				"Name": "李哥庄镇"
			}, {
				"Code": "5666",
				"Name": "胶莱镇"
			}, {
				"Code": "5665",
				"Name": "胶北镇"
			}, {
				"Code": "5664",
				"Name": "胶西镇"
			}, {
				"Code": "5663",
				"Name": "铺集镇"
			}, {
				"Code": "5662",
				"Name": "胶东镇"
			}, {
				"Code": "5661",
				"Name": "马店镇"
			}, {
				"Code": "5660",
				"Name": "九龙镇"
			}, {
				"Code": "5659",
				"Name": "营海镇"
			}, {
				"Code": "5658",
				"Name": "张应镇"
			}, {
				"Code": "5669",
				"Name": "市区"
			}],
			"sort": 5
		}, {
			"Code": "370016",
			"Name": "城阳区  ",
			"sort": 6
		}, {
			"Code": "370016",
			"Name": "李沧区 ",
			"sort": 7
		}, {
			"Code": "370016",
			"Name": "黄岛区 ",
			"sort": 8
		}, {
			"Code": "370016",
			"Name": "四方区 ",
			"sort": 9
		}, {
			"Code": "370016",
			"Name": "崂山区 ",
			"sort": 10
		}, {
			"Code": "370016",
			"Name": "市北区  ",
			"sort": 11
		}, {
			"Code": "370016",
			"Name": "莱西市 ",
			"level": [{
				"Code": "5694",
				"Name": "莱西经济开发区"
			}, {
				"Code": "5695",
				"Name": "姜山镇"
			}, {
				"Code": "5696",
				"Name": "李权庄镇"
			}, {
				"Code": "5697",
				"Name": "周格庄镇"
			}],
			"sort": 12
		}],
		"sort": 16
	}, {
		"Code": "370017",
		"Name": "菏泽市",
		"level": [{
			"Code": "370017",
			"Name": "牡丹区  ",
			"sort": 1
		}, {
			"Code": "370017",
			"Name": "曹县 ",
			"sort": 2
		}, {
			"Code": "370017",
			"Name": "单县 ",
			"sort": 3
		}, {
			"Code": "370017",
			"Name": "成武县 ",
			"sort": 4
		}, {
			"Code": "370017",
			"Name": "巨野县 ",
			"sort": 5
		}, {
			"Code": "370017",
			"Name": "郓城县 ",
			"sort": 6
		}, {
			"Code": "370017",
			"Name": "鄄城县 ",
			"sort": 7
		}, {
			"Code": "370017",
			"Name": "定陶县 ",
			"sort": 8
		}, {
			"Code": "370017",
			"Name": "东明县 ",
			"sort": 9
		}],
		"sort": 17
	}]
}, {
	"Code": "410000",
	"Name": "河南省",
	"level": [{
		"Code": "410001",
		"Name": "郑州市",
		"level": [{
			"Code": "410001",
			"Name": "郑东新区",
			"sort": 1
		}, {
			"Code": "410001",
			"Name": "高新技术产业开发区",
			"sort": 2
		}, {
			"Code": "410001",
			"Name": "经济技术开发区",
			"sort": 3
		}, {
			"Code": "410001",
			"Name": "巩义市 ",
			"sort": 4
		}, {
			"Code": "410001",
			"Name": "中牟县  ",
			"level": [{
				"Code": "5857",
				"Name": "城关镇"
			}, {
				"Code": "5858",
				"Name": "九龙镇"
			}],
			"sort": 5
		}, {
			"Code": "410001",
			"Name": "惠济区 ",
			"sort": 6
		}, {
			"Code": "410001",
			"Name": "登封市 ",
			"sort": 7
		}, {
			"Code": "410001",
			"Name": "新密市",
			"level": [{
				"Code": "1405",
				"Name": "城关镇"
			}, {
				"Code": "1406",
				"Name": "来集镇"
			}, {
				"Code": "1407",
				"Name": "超化镇"
			}, {
				"Code": "1408",
				"Name": "袁庄乡"
			}],
			"sort": 8
		}, {
			"Code": "410001",
			"Name": "荥阳市",
			"level": [{
				"Code": "5853",
				"Name": "豫龙镇"
			}, {
				"Code": "5852",
				"Name": "荥阳五龙工业区"
			}, {
				"Code": "5854",
				"Name": "乔楼镇"
			}, {
				"Code": "5855",
				"Name": "王村镇"
			}, {
				"Code": "1399",
				"Name": "市中心"
			}],
			"sort": 9
		}, {
			"Code": "410001",
			"Name": "新郑市",
			"level": [{
				"Code": "1392",
				"Name": "城关乡"
			}, {
				"Code": "1393",
				"Name": "机场港区"
			}, {
				"Code": "1394",
				"Name": "薛店镇"
			}, {
				"Code": "1395",
				"Name": "和庄镇"
			}, {
				"Code": "1396",
				"Name": "新村镇"
			}, {
				"Code": "1397",
				"Name": "龙湖镇"
			}],
			"sort": 10
		}, {
			"Code": "410001",
			"Name": "上街区",
			"sort": 11
		}, {
			"Code": "410001",
			"Name": "中原区",
			"sort": 12
		}, {
			"Code": "410001",
			"Name": "二七区",
			"sort": 13
		}, {
			"Code": "410001",
			"Name": "管城回族区",
			"sort": 14
		}, {
			"Code": "410001",
			"Name": "金水区",
			"sort": 15
		}],
		"sort": 1
	}, {
		"Code": "410002",
		"Name": "驻马店市",
		"level": [{
			"Code": "410002",
			"Name": "高新技术开发区（南区）",
			"sort": 1
		}, {
			"Code": "410002",
			"Name": "高新技术开发区（北区）",
			"sort": 2
		}, {
			"Code": "410002",
			"Name": "新蔡县 ",
			"sort": 3
		}, {
			"Code": "410002",
			"Name": "遂平县 ",
			"sort": 4
		}, {
			"Code": "410002",
			"Name": "汝南县 ",
			"sort": 5
		}, {
			"Code": "410002",
			"Name": "泌阳县 ",
			"sort": 6
		}, {
			"Code": "410002",
			"Name": "确山县 ",
			"sort": 7
		}, {
			"Code": "410002",
			"Name": "正阳县 ",
			"sort": 8
		}, {
			"Code": "410002",
			"Name": "平舆县 ",
			"sort": 9
		}, {
			"Code": "410002",
			"Name": "西平县  ",
			"sort": 10
		}, {
			"Code": "410002",
			"Name": "上蔡县 ",
			"sort": 11
		}, {
			"Code": "410002",
			"Name": "驿城区",
			"sort": 12
		}],
		"sort": 2
	}, {
		"Code": "410003",
		"Name": "周口市",
		"level": [{
			"Code": "410003",
			"Name": "经济开发区北区",
			"sort": 1
		}, {
			"Code": "410003",
			"Name": "项城市 ",
			"sort": 2
		}, {
			"Code": "410003",
			"Name": "鹿邑县 ",
			"sort": 3
		}, {
			"Code": "410003",
			"Name": "太康县 ",
			"sort": 4
		}, {
			"Code": "410003",
			"Name": "淮阳县 ",
			"sort": 5
		}, {
			"Code": "410003",
			"Name": "郸城县 ",
			"sort": 6
		}, {
			"Code": "410003",
			"Name": "沈丘县  ",
			"sort": 7
		}, {
			"Code": "410003",
			"Name": "商水县 ",
			"sort": 8
		}, {
			"Code": "410003",
			"Name": "扶沟县 ",
			"sort": 9
		}, {
			"Code": "410003",
			"Name": "西华县 ",
			"sort": 10
		}, {
			"Code": "410003",
			"Name": "川汇区",
			"sort": 11
		}],
		"sort": 3
	}, {
		"Code": "410004",
		"Name": "信阳市",
		"level": [{
			"Code": "410004",
			"Name": "息县 ",
			"sort": 1
		}, {
			"Code": "410004",
			"Name": "淮滨县 ",
			"sort": 2
		}, {
			"Code": "410004",
			"Name": "潢川县 ",
			"sort": 3
		}, {
			"Code": "410004",
			"Name": "固始县 ",
			"sort": 4
		}, {
			"Code": "410004",
			"Name": "商城县 ",
			"sort": 5
		}, {
			"Code": "410004",
			"Name": "新县 ",
			"sort": 6
		}, {
			"Code": "410004",
			"Name": "光山县 ",
			"sort": 7
		}, {
			"Code": "410004",
			"Name": "罗山县 ",
			"sort": 8
		}, {
			"Code": "410004",
			"Name": "平桥区",
			"sort": 9
		}, {
			"Code": "410004",
			"Name": "浉河区",
			"sort": 10
		}],
		"sort": 4
	}, {
		"Code": "410005",
		"Name": "商丘市",
		"level": [{
			"Code": "410005",
			"Name": "商丘经济技术开发区",
			"sort": 1
		}, {
			"Code": "410005",
			"Name": "永城市 ",
			"sort": 2
		}, {
			"Code": "410005",
			"Name": "夏邑县 ",
			"sort": 3
		}, {
			"Code": "410005",
			"Name": "虞城县 ",
			"sort": 4
		}, {
			"Code": "410005",
			"Name": "柘城县 ",
			"sort": 5
		}, {
			"Code": "410005",
			"Name": "宁陵县 ",
			"sort": 6
		}, {
			"Code": "410005",
			"Name": "睢县 ",
			"sort": 7
		}, {
			"Code": "410005",
			"Name": "民权县 ",
			"sort": 8
		}, {
			"Code": "410005",
			"Name": "梁园区",
			"sort": 9
		}, {
			"Code": "410005",
			"Name": "睢阳区",
			"sort": 10
		}],
		"sort": 5
	}, {
		"Code": "410006",
		"Name": "南阳市",
		"level": [{
			"Code": "410006",
			"Name": "方城县 ",
			"sort": 1
		}, {
			"Code": "410006",
			"Name": "邓州市 ",
			"sort": 2
		}, {
			"Code": "410006",
			"Name": "桐柏县 ",
			"sort": 3
		}, {
			"Code": "410006",
			"Name": "新野县 ",
			"sort": 4
		}, {
			"Code": "410006",
			"Name": "唐河县 ",
			"sort": 5
		}, {
			"Code": "410006",
			"Name": "社旗县 ",
			"sort": 6
		}, {
			"Code": "410006",
			"Name": "淅川县 ",
			"sort": 7
		}, {
			"Code": "410006",
			"Name": "内乡县 ",
			"sort": 8
		}, {
			"Code": "410006",
			"Name": "镇平县 ",
			"sort": 9
		}, {
			"Code": "410006",
			"Name": "西峡县  ",
			"sort": 10
		}, {
			"Code": "410006",
			"Name": "南召县 ",
			"sort": 11
		}, {
			"Code": "410006",
			"Name": "高新区",
			"sort": 12
		}, {
			"Code": "410006",
			"Name": "卧龙区",
			"sort": 13
		}, {
			"Code": "410006",
			"Name": "宛城区",
			"sort": 14
		}],
		"sort": 6
	}, {
		"Code": "410007",
		"Name": "三门峡市",
		"level": [{
			"Code": "410007",
			"Name": "渑池县 ",
			"sort": 1
		}, {
			"Code": "410007",
			"Name": "湖滨区  ",
			"sort": 2
		}, {
			"Code": "410007",
			"Name": "陕县 ",
			"sort": 3
		}, {
			"Code": "410007",
			"Name": "卢氏县 ",
			"sort": 4
		}, {
			"Code": "410007",
			"Name": "义马市 ",
			"sort": 5
		}, {
			"Code": "410007",
			"Name": "灵宝市 ",
			"sort": 6
		}],
		"sort": 7
	}, {
		"Code": "410008",
		"Name": "漯河市",
		"level": [{
			"Code": "410008",
			"Name": "临颍县 ",
			"sort": 1
		}, {
			"Code": "410008",
			"Name": "舞阳县  ",
			"sort": 2
		}, {
			"Code": "410008",
			"Name": "双龙文景开发区",
			"sort": 3
		}, {
			"Code": "410008",
			"Name": "高新技术开发区",
			"sort": 4
		}, {
			"Code": "410008",
			"Name": "双汇工业区",
			"sort": 5
		}, {
			"Code": "410008",
			"Name": "源汇区",
			"sort": 6
		}, {
			"Code": "410008",
			"Name": "郾城区",
			"sort": 7
		}, {
			"Code": "410008",
			"Name": "召陵区",
			"sort": 8
		}],
		"sort": 8
	}, {
		"Code": "410009",
		"Name": "许昌市",
		"level": [{
			"Code": "410009",
			"Name": "襄城县 ",
			"sort": 1
		}, {
			"Code": "410009",
			"Name": "鄢陵县 ",
			"sort": 2
		}, {
			"Code": "410009",
			"Name": "魏都区",
			"sort": 3
		}, {
			"Code": "410009",
			"Name": "许昌县",
			"level": [{
				"Code": "1438",
				"Name": "县城中心"
			}, {
				"Code": "1439",
				"Name": "半截河乡"
			}, {
				"Code": "1440",
				"Name": "枪杆刘镇"
			}, {
				"Code": "1441",
				"Name": "将官池镇"
			}, {
				"Code": "1442",
				"Name": "尚集镇"
			}, {
				"Code": "1443",
				"Name": "邓庄乡"
			}, {
				"Code": "1444",
				"Name": "蒋李集镇"
			}, {
				"Code": "1445",
				"Name": "七里店乡"
			}],
			"sort": 4
		}, {
			"Code": "410009",
			"Name": "长葛市",
			"level": [{
				"Code": "1447",
				"Name": "市区"
			}, {
				"Code": "1448",
				"Name": "和尚桥镇"
			}, {
				"Code": "1449",
				"Name": "科技工业园区"
			}, {
				"Code": "1450",
				"Name": "黄河高新技术开发区"
			}, {
				"Code": "1451",
				"Name": "城东开发区"
			}, {
				"Code": "1452",
				"Name": "后河镇"
			}, {
				"Code": "1453",
				"Name": "增福乡"
			}, {
				"Code": "1454",
				"Name": "大周镇"
			}, {
				"Code": "1455",
				"Name": "老城镇"
			}],
			"sort": 5
		}, {
			"Code": "410009",
			"Name": "禹州市",
			"level": [{
				"Code": "1457",
				"Name": "市区"
			}, {
				"Code": "1458",
				"Name": "褚河镇"
			}],
			"sort": 6
		}],
		"sort": 9
	}, {
		"Code": "410010",
		"Name": "濮阳市",
		"level": [{
			"Code": "410010",
			"Name": "清丰县 ",
			"sort": 1
		}, {
			"Code": "410010",
			"Name": "南乐县 ",
			"sort": 2
		}, {
			"Code": "410010",
			"Name": "范县 ",
			"sort": 3
		}, {
			"Code": "410010",
			"Name": "台前县 ",
			"sort": 4
		}, {
			"Code": "410010",
			"Name": "濮阳县 ",
			"sort": 5
		}, {
			"Code": "410010",
			"Name": "高新技术产业开发区",
			"sort": 6
		}, {
			"Code": "410010",
			"Name": "华龙区",
			"sort": 7
		}],
		"sort": 10
	}, {
		"Code": "410011",
		"Name": "安阳市",
		"level": [{
			"Code": "410011",
			"Name": "滑县 ",
			"sort": 1
		}, {
			"Code": "410011",
			"Name": "林州市 ",
			"sort": 2
		}, {
			"Code": "410011",
			"Name": "内黄县 ",
			"sort": 3
		}, {
			"Code": "410011",
			"Name": "汤阴县 ",
			"sort": 4
		}, {
			"Code": "410011",
			"Name": "高新技术开发区",
			"sort": 5
		}, {
			"Code": "410011",
			"Name": "龙安区",
			"sort": 6
		}, {
			"Code": "410011",
			"Name": "文峰区",
			"sort": 7
		}, {
			"Code": "410011",
			"Name": "安阳县",
			"level": [{
				"Code": "1468",
				"Name": "县城中心"
			}, {
				"Code": "1469",
				"Name": "柏庄镇"
			}, {
				"Code": "1470",
				"Name": "北蒙工业区"
			}],
			"sort": 8
		}, {
			"Code": "410011",
			"Name": "北关区",
			"sort": 9
		}, {
			"Code": "410011",
			"Name": "殷都区",
			"sort": 10
		}],
		"sort": 11
	}, {
		"Code": "410012",
		"Name": "新乡市",
		"level": [{
			"Code": "410012",
			"Name": "红旗区 ",
			"sort": 1
		}, {
			"Code": "410012",
			"Name": "高新技术开发区",
			"sort": 2
		}, {
			"Code": "410012",
			"Name": "辉县市 ",
			"level": [{
				"Code": "5865",
				"Name": "孟庄镇"
			}, {
				"Code": "5870",
				"Name": "市城区"
			}, {
				"Code": "5867",
				"Name": "百泉镇"
			}, {
				"Code": "5868",
				"Name": "胡桥镇"
			}, {
				"Code": "5869",
				"Name": "长春镇"
			}],
			"sort": 3
		}, {
			"Code": "410012",
			"Name": "长垣县 ",
			"sort": 4
		}, {
			"Code": "410012",
			"Name": "封丘县 ",
			"sort": 5
		}, {
			"Code": "410012",
			"Name": "延津县 ",
			"sort": 6
		}, {
			"Code": "410012",
			"Name": "原阳县 ",
			"sort": 7
		}, {
			"Code": "410012",
			"Name": "获嘉县 ",
			"sort": 8
		}, {
			"Code": "410012",
			"Name": "牧野区 ",
			"sort": 9
		}, {
			"Code": "410012",
			"Name": "凤泉区 ",
			"sort": 10
		}, {
			"Code": "410012",
			"Name": "卫滨区  ",
			"sort": 11
		}, {
			"Code": "410012",
			"Name": "小店工业区",
			"sort": 12
		}, {
			"Code": "410012",
			"Name": "新乡县",
			"level": [{
				"Code": "1483",
				"Name": "小冀镇"
			}],
			"sort": 13
		}, {
			"Code": "410012",
			"Name": "卫辉市",
			"level": [{
				"Code": "1485",
				"Name": "及水镇"
			}, {
				"Code": "1486",
				"Name": "唐庄镇"
			}, {
				"Code": "1487",
				"Name": "后河镇"
			}, {
				"Code": "1488",
				"Name": "张武店"
			}, {
				"Code": "1489",
				"Name": "黄土岗"
			}],
			"sort": 14
		}],
		"sort": 12
	}, {
		"Code": "410013",
		"Name": "鹤壁市",
		"level": [{
			"Code": "410013",
			"Name": "淇县 ",
			"sort": 1
		}, {
			"Code": "410013",
			"Name": "鹤山区 ",
			"sort": 2
		}, {
			"Code": "410013",
			"Name": "浚县 ",
			"sort": 3
		}, {
			"Code": "410013",
			"Name": "金山工业区",
			"sort": 4
		}, {
			"Code": "410013",
			"Name": "淇滨区",
			"sort": 5
		}, {
			"Code": "410013",
			"Name": "山城区",
			"sort": 6
		}],
		"sort": 13
	}, {
		"Code": "410014",
		"Name": "焦作市",
		"level": [{
			"Code": "410014",
			"Name": "孟州市 ",
			"sort": 1
		}, {
			"Code": "410014",
			"Name": "沁阳市 ",
			"sort": 2
		}, {
			"Code": "410014",
			"Name": "温县 ",
			"sort": 3
		}, {
			"Code": "410014",
			"Name": "武陟县 ",
			"sort": 4
		}, {
			"Code": "410014",
			"Name": "博爱县 ",
			"sort": 5
		}, {
			"Code": "410014",
			"Name": "修武县  ",
			"sort": 6
		}, {
			"Code": "410014",
			"Name": "马村区",
			"sort": 7
		}, {
			"Code": "410014",
			"Name": "中站区",
			"sort": 8
		}, {
			"Code": "410014",
			"Name": "高新技术开发区",
			"sort": 9
		}, {
			"Code": "410014",
			"Name": "山阳区",
			"sort": 10
		}, {
			"Code": "410014",
			"Name": "解放区",
			"sort": 11
		}],
		"sort": 14
	}, {
		"Code": "410015",
		"Name": "平顶山市",
		"level": [{
			"Code": "410015",
			"Name": "汝州市 ",
			"sort": 1
		}, {
			"Code": "410015",
			"Name": "舞钢市 ",
			"sort": 2
		}, {
			"Code": "410015",
			"Name": "郏县 ",
			"sort": 3
		}, {
			"Code": "410015",
			"Name": "鲁山县 ",
			"sort": 4
		}, {
			"Code": "410015",
			"Name": "叶县 ",
			"sort": 5
		}, {
			"Code": "410015",
			"Name": "宝丰县 ",
			"sort": 6
		}, {
			"Code": "410015",
			"Name": "高新技术开发区",
			"sort": 7
		}, {
			"Code": "410015",
			"Name": "石龙区 ",
			"sort": 8
		}, {
			"Code": "410015",
			"Name": "卫东区",
			"sort": 9
		}, {
			"Code": "410015",
			"Name": "湛河区",
			"sort": 10
		}, {
			"Code": "410015",
			"Name": "新华区",
			"sort": 11
		}],
		"sort": 15
	}, {
		"Code": "410016",
		"Name": "洛阳市",
		"level": [{
			"Code": "410016",
			"Name": "经济技术开发区",
			"sort": 1
		}, {
			"Code": "410016",
			"Name": "高新技术开发区",
			"sort": 2
		}, {
			"Code": "410016",
			"Name": "伊川县 ",
			"sort": 3
		}, {
			"Code": "410016",
			"Name": "洛宁县 ",
			"sort": 4
		}, {
			"Code": "410016",
			"Name": "汝阳县 ",
			"sort": 5
		}, {
			"Code": "410016",
			"Name": "嵩县 ",
			"sort": 6
		}, {
			"Code": "410016",
			"Name": "栾川县 ",
			"sort": 7
		}, {
			"Code": "410016",
			"Name": "孟津县  ",
			"sort": 8
		}, {
			"Code": "410016",
			"Name": "洛龙区 ",
			"sort": 9
		}, {
			"Code": "410016",
			"Name": "吉利区 ",
			"sort": 10
		}, {
			"Code": "410016",
			"Name": "涧西区 ",
			"sort": 11
		}, {
			"Code": "410016",
			"Name": "西工区 ",
			"sort": 12
		}, {
			"Code": "410016",
			"Name": "老城区  ",
			"sort": 13
		}, {
			"Code": "410016",
			"Name": "瀍河回族区",
			"sort": 14
		}, {
			"Code": "410016",
			"Name": "宜阳县",
			"level": [{
				"Code": "1527",
				"Name": "白村工业园"
			}],
			"sort": 15
		}, {
			"Code": "410016",
			"Name": "偃师市",
			"level": [{
				"Code": "1519",
				"Name": "城关镇"
			}, {
				"Code": "1520",
				"Name": "岳潭镇"
			}, {
				"Code": "1521",
				"Name": "首阳山镇"
			}, {
				"Code": "1522",
				"Name": "邙岭乡"
			}, {
				"Code": "1523",
				"Name": "化乡"
			}, {
				"Code": "1524",
				"Name": "诸葛镇"
			}, {
				"Code": "1525",
				"Name": "翟镇镇"
			}],
			"sort": 16
		}, {
			"Code": "410016",
			"Name": "新安县",
			"level": [{
				"Code": "1516",
				"Name": "洛新工业区"
			}],
			"sort": 17
		}],
		"sort": 16
	}, {
		"Code": "410017",
		"Name": "开封市",
		"level": [{
			"Code": "410017",
			"Name": "顺河回族区 ",
			"sort": 1
		}, {
			"Code": "410017",
			"Name": "兰考县",
			"sort": 2
		}, {
			"Code": "410017",
			"Name": "杞县 ",
			"sort": 3
		}, {
			"Code": "410017",
			"Name": "金明区 ",
			"sort": 4
		}, {
			"Code": "410017",
			"Name": "禹王台区 ",
			"sort": 5
		}, {
			"Code": "410017",
			"Name": "鼓楼区 ",
			"sort": 6
		}, {
			"Code": "410017",
			"Name": "龙亭区  ",
			"sort": 7
		}, {
			"Code": "410017",
			"Name": "通许县 ",
			"sort": 8
		}, {
			"Code": "410017",
			"Name": "尉氏县",
			"level": [{
				"Code": "1537",
				"Name": "城关镇"
			}, {
				"Code": "1538",
				"Name": "张市镇"
			}],
			"sort": 9
		}, {
			"Code": "410017",
			"Name": "开封县",
			"level": [{
				"Code": "5856",
				"Name": "黄龙工业区"
			}, {
				"Code": "1535",
				"Name": "县城中心"
			}],
			"sort": 10
		}],
		"sort": 17
	}, {
		"Code": "410018",
		"Name": "济源市",
		"level": [{
			"Code": "410018",
			"Name": "市区",
			"sort": 1
		}],
		"sort": 18
	}]
}, {
	"Code": "940000",
	"Name": "澳门特别行政区",
	"level": [{
		"Code": "940001",
		"Name": "澳门特别行政区 ",
		"sort": 1,
		"level": [{
			"Code": "940001",
			"Name": "--",
			"sort": 1
		}]
	}]
}];

if ( typeof module != 'undefined' && module.exports ) {
    module.exports = cityData;
} else {
    window.cityData = cityData;
}

})(window, document, Math);